{
  "appName": {
    "message": "ಮೋರ್ಸ್ ಕೋಡ್ ಅನುವಾದಕ"
  },
  "shortDesc": {
    "message": "ಇದು ಮೋರ್ಸ್ ಕೋಡ್ ಅನುವಾದಕ - ಧ್ವನಿ ಮತ್ತು ಪಠ್ಯದೊಂದಿಗೆ ಮೋರ್ಸ್ ಕೋಡ್ ಜನರೇಟರ್. ಮೋರ್ಸ್ ಕೋಡ್ ವರ್ಣಮಾಲೆಯನ್ನು ಕಲಿಯಿರಿ ಮತ್ತು ನಿಮ್ಮ ಭಾಷೆಗೆ ಅನುವಾದಿಸಿ."
  },
  "storeDesc": {
    "message": "ನೀವು ಮೋರ್ಸ್ ಕೋಡ್ ಅನುವಾದಕದಲ್ಲಿ ಹೊಸ ಭಾಷೆಗಳಿಗೆ ಬೆಂಬಲವನ್ನು ಬಯಸಿದರೆ, ಡೆವಲಪರ್‌ಗೆ ಇಮೇಲ್ ಮೂಲಕ ಬರೆಯಿರಿ. ಬಳಕೆದಾರರಿಂದ ಬರುವ ಪ್ರತಿಕ್ರಿಯೆ ಭವಿಷ್ಯದ ನವೀಕರಣಗಳಿಗೆ ಮಾರ್ಗದರ್ಶನ ನೀಡುತ್ತದೆ ಮತ್ತು ನಿಮ್ಮ ಆಲೋಚನೆಗಳು ಮುಂದೆ ಏನಾಗುತ್ತದೆ ಎಂಬುದನ್ನು ರೂಪಿಸಬಹುದು. ವಿಸ್ತರಣೆಯು ಈಗಾಗಲೇ ಇಂಗ್ಲಿಷ್, ರಷ್ಯನ್ ಮತ್ತು ಅಂತರರಾಷ್ಟ್ರೀಯ ಸಂಕೇತಗಳೊಂದಿಗೆ ಕಾರ್ಯನಿರ್ವಹಿಸುತ್ತದೆ, ಆದರೆ ಹೆಚ್ಚಿನದನ್ನು ಯೋಜಿಸಲಾಗಿದೆ.\n ಆನ್‌ಲೈನ್‌ನಲ್ಲಿ ಚುಕ್ಕೆಗಳು ಮತ್ತು ಡ್ಯಾಶ್‌ಗಳೊಂದಿಗೆ ಕೆಲಸ ಮಾಡಲು ನೇರ ಮತ್ತು ವಿಶ್ವಾಸಾರ್ಹ ಮಾರ್ಗವನ್ನು ಬಯಸುವ ಜನರಿಗಾಗಿ ಮೋರ್ಸ್ ಕೋಡ್ ಅನುವಾದಕವನ್ನು ವಿನ್ಯಾಸಗೊಳಿಸಲಾಗಿದೆ. ಈ ಉಪಕರಣವು ಮೋರ್ಸ್ ಕೋಡ್ ಅನ್ನು ಇಂಗ್ಲಿಷ್‌ಗೆ ಮತ್ತು ಹಿಂದಕ್ಕೆ ಅನುವಾದಿಸಲು ಸರಳಗೊಳಿಸುತ್ತದೆ. ಎಲ್ಲವೂ ಬ್ರೌಸರ್ ಒಳಗೆ ಚಲಿಸುತ್ತದೆ, ನಡುವೆ ಯಾವುದೇ ಸರ್ವರ್‌ಗಳಿಲ್ಲ, ಆದ್ದರಿಂದ ಫಲಿತಾಂಶಗಳು ತಕ್ಷಣವೇ ಗೋಚರಿಸುತ್ತವೆ ಮತ್ತು ಖಾಸಗಿಯಾಗಿ ಉಳಿಯುತ್ತವೆ.\n ಅತ್ಯಂತ ಪ್ರಾಯೋಗಿಕ ವೈಶಿಷ್ಟ್ಯವೆಂದರೆ ಎರಡೂ ಕ್ಷೇತ್ರಗಳನ್ನು ನೈಜ ಸಮಯದಲ್ಲಿ ಸಿಂಕ್ರೊನೈಸ್ ಮಾಡಲಾಗುತ್ತದೆ. ನೀವು ಸರಳ ಪಠ್ಯವನ್ನು ಟೈಪ್ ಮಾಡಿದಾಗ, ಸಿಗ್ನಲ್ ಕ್ಷೇತ್ರವು ಸ್ವಯಂಚಾಲಿತವಾಗಿ ನವೀಕರಿಸುತ್ತದೆ. ನೀವು ಮಾದರಿಯ ಬದಿಯಲ್ಲಿ ಚುಕ್ಕೆಗಳು ಮತ್ತು ಡ್ಯಾಶ್‌ಗಳನ್ನು ಅಂಟಿಸಿದಾಗ ಅಥವಾ ನಮೂದಿಸಿದಾಗ, ಪಠ್ಯ ಕ್ಷೇತ್ರವು ತಕ್ಷಣವೇ ಪ್ರತಿಕ್ರಿಯಿಸುತ್ತದೆ. ವಿಸ್ತರಣೆಯು ಯಾವಾಗಲೂ ಎರಡೂ ದಿಕ್ಕುಗಳನ್ನು ಜೋಡಿಸುತ್ತದೆ.\n ಟೆಲಿಗ್ರಾಫ್ ಕೀ ಸಿಮ್ಯುಲೇಶನ್ ಕೂಡ ಇದೆ. ಈ ವಿಶೇಷ ಬಟನ್ ನಿಮಗೆ ಕೈಯಿಂದ ಲಯಗಳನ್ನು ಟ್ಯಾಪ್ ಮಾಡಲು ಅನುಮತಿಸುತ್ತದೆ. ಮೋಡ್ ಅನ್ನು ಪ್ರತ್ಯೇಕವಾಗಿ ಸಕ್ರಿಯಗೊಳಿಸಬಹುದು, ನಿಮ್ಮ ಕೀಬೋರ್ಡ್ ಅಥವಾ ಮೌಸ್ ಅನ್ನು ಸರಳ ಇನ್‌ಪುಟ್ ಪರಿಕರವಾಗಿ ಪರಿವರ್ತಿಸಬಹುದು. ಪ್ರತಿ ಟ್ಯಾಪ್ ಒಂದು ಮಾದರಿಯನ್ನು ಉತ್ಪಾದಿಸುತ್ತದೆ ಮತ್ತು ಅನುವಾದವು ಪಠ್ಯ ವಿಂಡೋದಲ್ಲಿ ಏಕಕಾಲದಲ್ಲಿ ಗೋಚರಿಸುತ್ತದೆ. ಬ್ರೌಸರ್‌ಗೆ ಅಳವಡಿಸಲಾದ ಐತಿಹಾಸಿಕ ಯಂತ್ರವನ್ನು ಬಳಸಿದಂತೆ ಭಾಸವಾಗುತ್ತದೆ.\n ಜನರು ಈ ಅನುವಾದಕವನ್ನು ಏಕೆ ಸ್ಥಾಪಿಸುತ್ತಾರೆ:\n ಹೆಚ್ಚುವರಿ ಸಾಫ್ಟ್‌ವೇರ್ ಇಲ್ಲದೆ ಆನ್‌ಲೈನ್ ಪರಿವರ್ತನೆ\n\n\n ಎರಡೂ ಕ್ಷೇತ್ರಗಳ ನಡುವೆ ಸ್ವಯಂಚಾಲಿತ ಸಿಂಕ್\n\n\n ಅಪ್ಲಿಕೇಶನ್ ಒಳಗೆ ಸ್ಪಷ್ಟವಾದ ಮೋರ್ಸ್ ಕೋಡ್ ವರ್ಣಮಾಲೆಯ ಉಲ್ಲೇಖ\n\n\n ಸಿಗ್ನಲ್‌ಗಳನ್ನು ಟ್ಯಾಪ್ ಮಾಡಲು ಟೆಲಿಗ್ರಾಫ್ ಕೀ ಮೋಡ್\n\n\n ಭಾಷೆಗಳು ಮತ್ತು ವೈಶಿಷ್ಟ್ಯಗಳನ್ನು ವಿಸ್ತರಿಸುವ ನವೀಕರಣಗಳು\n\n\n ಸಿಗ್ನಲ್‌ಗಳ ಮೂಲಕ ನೋಡಿದಾಗ ದೈನಂದಿನ ನುಡಿಗಟ್ಟುಗಳು ಹೆಚ್ಚು ಮೋಜಿನಿಂದ ಕೂಡಿರುತ್ತವೆ. &quot;ಹಲೋ&quot; ಹೇಗೆ ಕಾಣುತ್ತದೆ ಎಂಬುದನ್ನು ನೋಡಲು ನೀವು ಮೋರ್ಸ್ ಕೋಡ್ ಪರಿವರ್ತಕವನ್ನು ಬಳಸಬಹುದು ಮತ್ತು ಸಣ್ಣ ಶುಭಾಶಯಗಳು ಸಹ ತಮಾಷೆಯ ಸ್ವರವನ್ನು ಪಡೆಯಬಹುದು. ಕೆಲವರು ಸೃಜನಶೀಲ ಸಂದೇಶಗಳಿಗಾಗಿ ಮೋರ್ಸ್ ಕೋಡ್‌ನಲ್ಲಿ ಐ ಲವ್ ಯು ಅನ್ನು ಪ್ರಯೋಗಿಸುತ್ತಾರೆ, ಆದರೆ ಇತರರು ತುರ್ತು ಅಭ್ಯಾಸಕ್ಕಾಗಿ ಮೋರ್ಸ್ ಕೋಡ್‌ನಲ್ಲಿ sos ಅಥವಾ sos en ಕೋಡ್ ಮೋರ್ಸ್ ಅನ್ನು ಪರಿಶೀಲಿಸುತ್ತಾರೆ. ರೇಡಿಯೋ ಜಗತ್ತಿನಲ್ಲಿ ಈ ವ್ಯವಸ್ಥೆಯು ದೀರ್ಘ ಸಂಪ್ರದಾಯವನ್ನು ಹೊಂದಿದೆ, ಅಲ್ಲಿ ನಿರ್ವಾಹಕರು ಹೆಚ್ಚಾಗಿ ಸಣ್ಣ ಸಂಕೇತಗಳು ಮತ್ತು ಸಂಕ್ಷೇಪಣಗಳನ್ನು ಬಳಸುತ್ತಾರೆ:\n 73 (--... ...--): &quot;ಶುಭಾಶಯಗಳು&quot; ಎಂದರ್ಥ ಮತ್ತು ಸಂಪರ್ಕವನ್ನು ವಿನಮ್ರವಾಗಿ ಕೊನೆಗೊಳಿಸಲು ಬಳಸಲಾಗುತ್ತದೆ.\n\n\n 88 (---.. ---..): ಸ್ನೇಹಿತರು ಅಥವಾ ಸಹೋದ್ಯೋಗಿಗಳ ನಡುವೆ ಹೆಚ್ಚಾಗಿ ಹಂಚಿಕೊಳ್ಳಲಾಗುವ &quot;ಚುಂಬನಗಳು&quot; ಎಂದರ್ಥ.\n\n\n CQ (-.-. --.-): ಎಲ್ಲಾ ಆಪರೇಟರ್‌ಗಳಿಗೆ ಸಾಮಾನ್ಯ ಕರೆ, ಇದನ್ನು &quot;ನಿಮಗೆ ಕರೆ ಮಾಡಿ&quot; ಎಂದು ಅನುವಾದಿಸಲಾಗಿದೆ.\n\n\n GM (--. --): “ಶುಭೋದಯ,” GA (--. .-): “ಶುಭ ಮಧ್ಯಾಹ್ನ,” GE (--. .): “ಶುಭ ಸಂಜೆ,” GN (--. -.): “ಶುಭ ರಾತ್ರಿ.”\n\n\n R (.-.): &quot;ಸ್ವೀಕರಿಸಲಾಗಿದೆ&quot; ಅಥವಾ &quot;ಅರ್ಥಮಾಡಿಕೊಂಡಿದೆ&quot; ಎಂಬ ಅರ್ಥ ನೀಡುವ ದೃಢೀಕರಣ ಸಂಕೇತ.\n\n\n PSE (.--. ... .): &quot;ದಯವಿಟ್ಟು&quot; ಎಂಬುದರ ಸಂಕ್ಷಿಪ್ತ ರೂಪ, ವಿನಮ್ರ ವಿನಂತಿಗಳಲ್ಲಿ ಬಳಸಲಾಗುತ್ತದೆ.\n\n\n ..---...._, _ _.., ಅಥವಾ _. _. ನಂತಹ ಅಸಾಮಾನ್ಯ ಅನುಕ್ರಮಗಳನ್ನು ಸಹ ವಿಳಂಬವಿಲ್ಲದೆ ಡಿಕೋಡ್ ಮಾಡಲಾಗುತ್ತದೆ, ಇದು ಚುಕ್ಕೆಗಳು ಮತ್ತು ಡ್ಯಾಶ್‌ಗಳ ಪ್ರತಿಯೊಂದು ಸಾಲನ್ನು ಜೀವಂತ ಭಾಷೆಯ ಭಾಗವಾಗಿಸುತ್ತದೆ.\n ▸ ಸಾಮಾನ್ಯ ಬಳಕೆಯ ಸಂದರ್ಭಗಳು ಸೇರಿವೆ:\n ತರಗತಿಯ ಸಮಯದಲ್ಲಿ ಮೋರ್ಸ್ ಕೋಡ್ ಎಂದರೇನು ಎಂಬುದನ್ನು ವಿವರಿಸುವ ಶಿಕ್ಷಕರು\n\n\n ಇಂಗ್ಲಿಷ್‌ನಿಂದ ಮೋರ್ಸ್ ಕೋಡ್ ಯೋಜನೆಗಳನ್ನು ಅಭ್ಯಾಸ ಮಾಡುತ್ತಿರುವ ವಿದ್ಯಾರ್ಥಿಗಳು\n\n\n ಬಿಡುವಿನ ವೇಳೆಯಲ್ಲಿ ಮೋರ್ಸ್ ಕೋಡ್ ಸಂಖ್ಯೆಗಳೊಂದಿಗೆ ಕೆಲಸ ಮಾಡುವ ಹವ್ಯಾಸಿಗಳು\n\n\n ಸಂಸ್ಕೃತಿಯ ಭಾಗವಾಗಿ ಮೋರ್ಸ್‌ನಲ್ಲಿ SOS ಕೋಡ್ ಅನ್ನು ತೋರಿಸುತ್ತಿರುವ ಇತಿಹಾಸಕಾರರು.\n\n\n ವಿನ್ಯಾಸಕ್ಕಾಗಿ ಮೋರ್ಸ್ ಕೋಡ್ ಕ್ರಿಯೇಟರ್ ಪರಿಕರಗಳನ್ನು ಬಳಸುವ ಸೃಷ್ಟಿಕರ್ತರು\n\n\n ಈ ವಿಸ್ತರಣೆಯು ಮೋರ್ಸ್ ಕೋಡ್ ಡಿಕೋಡರ್ ಆಗಿಯೂ ಕಾರ್ಯನಿರ್ವಹಿಸುತ್ತದೆ. ಯಾವುದೇ ಅನುಕ್ರಮವನ್ನು ಅಂಟಿಸಿ, ಮತ್ತು ಅನುವಾದವು ಸರಳ ಪಠ್ಯಕ್ಕೆ ಒಮ್ಮೆಗೇ ಗೋಚರಿಸುತ್ತದೆ. ನೀವು _. _ ಅನ್ನು ಪರೀಕ್ಷಿಸಿದರೂ ಅಥವಾ // ನಂತಹ ದೀರ್ಘ ಅನುಕ್ರಮಗಳನ್ನು ಪರೀಕ್ಷಿಸಿದರೂ, ಉಪಕರಣವು ಅರ್ಥವನ್ನು ಸ್ಪಷ್ಟವಾಗಿ ತೋರಿಸುತ್ತದೆ. ಯಾವುದೇ ಊಹೆ ಇಲ್ಲ, ವಿಳಂಬವಿಲ್ಲ, ಕೇವಲ ಸುಗಮ ಸಂವಹನ. ಅನೇಕ ಕಲಿಯುವವರಿಗೆ ಇದು ನೈಜ ಸಮಯದಲ್ಲಿ ಮೋರ್ಸ್ ಅನ್ನು ಇಂಗ್ಲಿಷ್‌ಗೆ ತರಬೇತಿ ನೀಡಲು ಮತ್ತು ಪರಿವರ್ತಿಸಲು ಸರಳವಾದ ಮಾರ್ಗವಾಗಿದೆ.\n 1️⃣ ಪ್ರಯೋಜನಗಳ ಸಂಕ್ಷಿಪ್ತ ವಿವರಣೆ:\n ಮೋರ್ಸ್ ವರ್ಣಮಾಲೆಯ ಸುಲಭ ಪರಿಚಯ\n\n\n ಮೋರ್ಸ್ ಕೋಡ್ ಮತ್ತು ಇತರ ನುಡಿಗಟ್ಟುಗಳಲ್ಲಿ ಇಲ್ಲ ಎಂಬುದರ ಡಿಕೋಡಿಂಗ್\n\n\n ಪದಗಳಲ್ಲಿ ಮೋರ್ಸ್ ಕೋಡ್ ಅಕ್ಷರಗಳನ್ನು ಅಧ್ಯಯನ ಮಾಡಲು ಒಂದು ಅವಕಾಶ\n\n\n ಪ್ರಯೋಗಗಳಿಗಾಗಿ // ನಂತಹ ಸೃಜನಾತ್ಮಕ ಸಂಯೋಜನೆಗಳು\n\n\n ಧ್ವನಿಯು ಮತ್ತೊಂದು ಆಯಾಮವನ್ನು ಸೇರಿಸುತ್ತದೆ. ಅನುವಾದಕ ನೀವು ರಚಿಸುವ ಮಾದರಿಗಳನ್ನು ಪ್ಲೇಬ್ಯಾಕ್ ಮಾಡಬಹುದು. ಇದು ಪ್ಲೇಬ್ಯಾಕ್ ವೇಗವನ್ನು ಬದಲಾಯಿಸಲು ಸಹ ನಿಮಗೆ ಅನುಮತಿಸುತ್ತದೆ, ಆದ್ದರಿಂದ ಸಣ್ಣ ಚುಕ್ಕೆಗಳು ಮತ್ತು ಉದ್ದವಾದ ಡ್ಯಾಶ್‌ಗಳು ನಿಮ್ಮ ವೇಗಕ್ಕೆ ಹೊಂದಿಕೆಯಾಗುತ್ತವೆ. ಅಭ್ಯಾಸಕ್ಕಾಗಿ ನೀವು ಅದನ್ನು ನಿಧಾನಗೊಳಿಸಬಹುದು ಅಥವಾ ವಾಸ್ತವಿಕತೆಗಾಗಿ ಅದನ್ನು ವೇಗಗೊಳಿಸಬಹುದು. ಸಿಗ್ನಲ್‌ಗಳನ್ನು ರಫ್ತು ಮಾಡಲು ಮತ್ತು ನಂತರ ಕೇಳಲು ಅವುಗಳನ್ನು WAV ಫೈಲ್‌ನಲ್ಲಿ ಉಳಿಸಲು ಸಹ ಒಂದು ಆಯ್ಕೆ ಇದೆ.\n ➤ ಯಾರು ಇದನ್ನು ಆನಂದಿಸುತ್ತಾರೆ:\n ಯೋಜನೆಗಳ ಭಾಗವಾಗಿ ಕೋಡ್ ಸಾಸ್ ಮೋರ್ಸ್ ಅನ್ನು ಅನ್ವೇಷಿಸುವ ವಿದ್ಯಾರ್ಥಿಗಳು\n\n\n ಸ್ಪಷ್ಟ ವಿವರಣೆಗಳನ್ನು ಸಿದ್ಧಪಡಿಸುತ್ತಿರುವ ಶಿಕ್ಷಕರು\n\n\n ರೇಡಿಯೋ ಅಭಿಮಾನಿಗಳು ಮೋಜಿಗಾಗಿ ಸಾಸ್ ಎನ್ ಕೋಡ್ ಮೋರ್ಸ್ ಅನ್ನು ಡಿಕೋಡ್ ಮಾಡುತ್ತಿದ್ದಾರೆ\n\n\n ಸಂಕೇತಗಳ ಲಯದಿಂದ ಸ್ಫೂರ್ತಿ ಪಡೆದ ವಿನ್ಯಾಸಕರು\n\n\n ಯಾವುದೇ ಶ್ರಮವಿಲ್ಲದೆ ಮೋರ್ಸ್ ಕೋಡ್ ಅನ್ನು ಭಾಷಾಂತರಿಸಲು ಬಯಸುವ ಯಾರಾದರೂ\n\n\n ಗೌಪ್ಯತೆಯನ್ನು ಯಾವಾಗಲೂ ಗೌರವಿಸಲಾಗುತ್ತದೆ. ವಿಸ್ತರಣೆಯು ಯಾವುದೇ ಮಾಹಿತಿಯನ್ನು ಕಳುಹಿಸದೆ ಸಂಪೂರ್ಣವಾಗಿ ಬ್ರೌಸರ್ ಒಳಗೆ ಚಲಿಸುತ್ತದೆ. ವರ್ಣಮಾಲೆಯ ತರಬೇತಿ ಅಥವಾ ಸೃಜನಶೀಲ ಕೆಲಸಕ್ಕಾಗಿ ಈ ಮೋರ್ಸ್ ಕೋಡ್‌ನೊಂದಿಗೆ ನಿಮ್ಮ ಪ್ರಯೋಗಗಳು ನಿಮ್ಮದಾಗಿ ಉಳಿಯುತ್ತವೆ.\n 2️⃣ ಪದೇ ಪದೇ ಕೇಳಲಾಗುವ ಪ್ರಶ್ನೆಗಳು:\n ಮೋರ್ಸ್ ಕೋಡ್ ಅನುವಾದಕವು ತಕ್ಷಣವೇ ಇಂಗ್ಲಿಷ್‌ಗೆ ಪರಿವರ್ತಿಸಬಹುದೇ? ಹೌದು, ತಕ್ಷಣವೇ.\n\n\n ಅಕ್ಷರಗಳು ಮತ್ತು ಸಂಖ್ಯೆಗಳಿಗೆ ಮೋರ್ಸ್ ಕೋಡ್ ಪರಿವರ್ತಕವಿದೆಯೇ? ಹೌದು, ಎಲ್ಲವೂ ಒಳಗೊಂಡಿದೆ.\n\n\n ಇದು ಮೋರ್ಸ್ ಕೋಡ್ ಯಂತ್ರವನ್ನು ಅನುಕರಿಸುತ್ತದೆಯೇ? ಹೌದು, ಟ್ಯಾಪಿಂಗ್ ವೈಶಿಷ್ಟ್ಯದ ಮೂಲಕ.\n\n\n ನಾನು ಧ್ವನಿಯನ್ನು ಹೊಂದಿಸಬಹುದೇ? ಹೌದು, ವೇಗವನ್ನು ಬದಲಾಯಿಸಬಹುದು ಮತ್ತು ಪ್ಲೇಬ್ಯಾಕ್ ಅನ್ನು WAV ಆಗಿ ರಫ್ತು ಮಾಡಬಹುದು.\n\n\n ಮೋರ್ಸ್ ಕೋಡ್ ಜನರೇಟರ್ ಸೇರಿಸಲಾಗಿದೆಯೇ? ಹೌದು, ನೀವು ನಿಮ್ಮ ಸ್ವಂತ ಸಿಗ್ನಲ್‌ಗಳನ್ನು ರಚಿಸಬಹುದು ಮತ್ತು ಪರೀಕ್ಷಿಸಬಹುದು.\n\n\n ಈ ವಿಸ್ತರಣೆಯು ಅಸಾಮಾನ್ಯ ಮಾದರಿಗಳನ್ನು ನಿರ್ವಹಿಸುತ್ತದೆಯೇ? ಹೌದು, ಇದು ಅಪರೂಪದ ಅನುಕ್ರಮಗಳನ್ನು ಸಹ ಡಿಕೋಡ್ ಮಾಡುತ್ತದೆ.\n\n\n 3️⃣ ಇಂದು ಸ್ಥಾಪಿಸಲು ಕಾರಣಗಳು:\n ಟೆಲಿಗ್ರಾಫ್ ಕೀಲಿಯನ್ನು ತನ್ನದೇ ಆದ ಮೋಡ್‌ನಲ್ಲಿ ಅಭ್ಯಾಸ ಮಾಡಿ\n\n\n ವರ್ಣಮಾಲೆ ಮತ್ತು ಸಂಪೂರ್ಣ ಪದಗಳಿಗಾಗಿ ಮೋರ್ಸ್ ಕೋಡ್ ನಡುವೆ ಬದಲಾಯಿಸಿ\n\n\n ಯಾವುದೇ ಗೊಂದಲವಿಲ್ಲದೆ sos en code morse ನಂತಹ ಸಂಕೇತಗಳನ್ನು ಅನ್ವೇಷಿಸಿ.\n\n\n ಹೆಚ್ಚಿನ ಭಾಷೆಗಳು ಮತ್ತು ವೈಶಿಷ್ಟ್ಯಗಳೊಂದಿಗೆ ನವೀಕರಣಗಳನ್ನು ಆನಂದಿಸಿ\n\n\n ದೈನಂದಿನ ಕಲಿಕಾ ಸಾಧನವಾಗಿ ಈ ಅನುವಾದಕನನ್ನು ಅವಲಂಬಿಸಿರಿ.\n\n\n ಕೊನೆಯಲ್ಲಿ, ಮೋರ್ಸ್ ಕೋಡ್ ಅನುವಾದಕವು ಅನುವಾದಕರಿಗಿಂತ ಹೆಚ್ಚಿನದಾಗಿದೆ. ಇದು ಆಧುನಿಕ ಪರಿಕರಗಳನ್ನು ಬಳಸುವಾಗ ಇತಿಹಾಸದೊಂದಿಗೆ ಸಂಪರ್ಕ ಸಾಧಿಸುವ ಒಂದು ಮಾರ್ಗವಾಗಿದೆ.\n ಅಲೆಹ್ ಅವರ ವಿನ್ಯಾಸ: stariyleg@gmail.com\n ಐಕಾನ್ - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"ಮೋರ್ಸ್ ಕೋಡ್ ಐಕಾನ್‌ಗಳು\">ಫ್ರೀಪಿಕ್ ರಚಿಸಿದ ಮೋರ್ಸ್ ಕೋಡ್ ಐಕಾನ್‌ಗಳು - ಫ್ಲಾಟಿಕಾನ್</a>\n"
  }
}