{
  "appName": {
    "message": "Morse Code Translator"
  },
  "shortDesc": {
    "message": "This is Morse Code Translator – morse code generator with sound & text. Learn morse code alphabet and translate to your language."
  },
  "storeDesc": {
    "message": "If you want support for new languages in Morse Code Translator, just write to the developer by email. Feedback from users guides future updates, and your ideas can shape what will appear next. The extension already works with English, Russian, and International signals, but more are planned.\nMorse Code Translator is designed for people who want a direct and reliable way to work with dots and dashes online. The tool makes it simple to translate morse code to english and back again. Everything runs inside the browser, with no servers in between, so results appear instantly and remain private.\nOne of the most practical features is that both fields are synchronized in real time. When you type plain text, the signal field updates automatically. When you paste or enter dots-and-dashes into the pattern side, the text field responds immediately. The extension always keeps both directions aligned.\nThere is also a telegraph key simulation. This special button lets you tap rhythms by hand. The mode can be activated separately, turning your keyboard or mouse into a simple input tool. Each tap generates a pattern, and the translation appears in the text window at once. It feels almost like using a historic machine adapted for the browser.\nWhy people install this translator:\nOnline conversion without extra software\n\n\nAutomatic sync between both fields\n\n\nA clear morse code alphabet reference inside the app\n\n\nTelegraph key mode for tapping signals\n\n\nUpdates that expand languages and features\n\n\nDaily phrases are more fun when viewed through signals. You can use the morse code converter to see how “hello” looks, and even short greetings can take on a playful tone. Some people experiment with i love you in morse code for creative messages, while others check sos in morse code or sos en code morse for emergency practice. The system has a long tradition in the radio world, where operators often use short codes and abbreviations:\n73 (--... ...--): means “best wishes” and is used to end a contact politely.\n\n\n88 (---.. ---..): stands for “kisses,” often shared between friends or colleagues.\n\n\nCQ (-.-. --.-): a general call to all operators, translated as “call to you.”\n\n\nGM (--. --): “good morning,” GA (--. .-): “good afternoon,” GE (--. .): “good evening,” GN (--. -.): “good night.”\n\n\nR (.-.): a confirmation signal meaning “received” or “understood.”\n\n\nPSE (.--. ... .): short for “please,” used in polite requests.\n\n\nEven unusual sequences such as ..---...._, _ _.., or _. _. are decoded without delay, making every line of dots and dashes part of a living language.\n▸ Common use cases include:\nTeachers who explain what is morse code during class\n\n\nStudents practicing english to morse code projects\n\n\nHobbyists working with morse code numbers in their spare time\n\n\nHistorians showing sos code in morse as part of culture\n\n\nCreators using morse code creator tools for design\n\n\nThe extension also works as a morse code decoder. Paste any sequence, and the translation to plain text appears at once. Whether you test _. _ or longer sequences like //, the tool shows the meaning clearly. No guessing, no delays, only smooth interaction. For many learners this becomes the simplest way to train and to convert morse to english in real time.\n1️⃣ Benefits at a glance:\nEasy introduction to the morse alphabet\n\n\nDecoding of no in morse code and other phrases\n\n\nA chance to study morse code letters in words\n\n\nCreative combinations like // for experiments\n\n\nSound adds another dimension. The translator can play back the patterns you create. It also allows you to change playback speed, so short dots and longer dashes match your pace. You can slow it down for practice or speed it up for realism. There is even an option to export signals and save them in a WAV file for later listening.\n➤ Who will enjoy it:\nStudents exploring code sos morse as part of projects\n\n\nTeachers preparing clear illustrations\n\n\nRadio fans decoding sos en code morse for fun\n\n\nDesigners inspired by the rhythm of the signals\n\n\nAnyone who wants to translate morse code without effort\n\n\nPrivacy is always respected. The extension runs completely inside the browser, with no information sent away. Your experiments with this morse code for alphabet training or creative work remain yours alone.\n2️⃣ FAQ:\nCan Morse Code Translator convert to english right away? Yes, instantly.\n\n\nIs there a morse code converter for letters and numbers? Yes, everything is covered.\n\n\nDoes it simulate a morse code machine? Yes, through the tapping feature.\n\n\nCan I adjust sound? Yes, speed can be changed, and playback can be exported as WAV.\n\n\nIs there a morse code generator included? Yes, you can create and test your own signals.\n\n\nDoes the extension handle unusual patterns? Yes, it decodes even rare sequences.\n\n\n3️⃣ Reasons to install today:\nPractice with the telegraph key in its own mode\n\n\nSwitch between morse code for alphabet and complete words\n\n\nExplore signals like sos en code morse with no confusion\n\n\nEnjoy updates with more languages and features\n\n\nRely on this translator as a daily learning tool\n\n\nIn the end, Morse Code Translator is more than a translator. It is a way to connect with history while using modern tools.\nDesign by Aleh: stariyleg@gmail.com\nIcon - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"morse code icons\">Morse code icons created by Freepik - Flaticon</a>\n"
  }
}