{
  "appName": {
    "message": "Tradutor de Código Morse"
  },
  "shortDesc": {
    "message": "Este é o Tradutor de Código Morse – gerador de código morse com som e texto. Aprenda o alfabeto em código morse e traduza para o seu idioma."
  },
  "storeDesc": {
    "message": "Se você deseja suporte para novos idiomas no Tradutor de Código Morse, basta escrever para o desenvolvedor por e-mail. O feedback dos usuários orienta futuras atualizações, e suas ideias podem moldar o que aparecerá a seguir. A extensão já funciona com inglês, russo e sinais internacionais, mas mais idiomas estão planejados.  \nO Tradutor de Código Morse é projetado para pessoas que desejam uma maneira direta e confiável de trabalhar com pontos e traços online. A ferramenta torna simples traduzir código morse para inglês e vice-versa. Tudo funciona dentro do navegador, sem servidores intermediários, então os resultados aparecem instantaneamente e permanecem privados.  \nUma das características mais práticas é que ambos os campos estão sincronizados em tempo real. Quando você digita texto simples, o campo de sinal é atualizado automaticamente. Quando você cola ou insere pontos e traços no lado do padrão, o campo de texto responde imediatamente. A extensão sempre mantém ambas as direções alinhadas.  \nHá também uma simulação de chave de telégrafo. Este botão especial permite que você toque ritmos manualmente. O modo pode ser ativado separadamente, transformando seu teclado ou mouse em uma ferramenta de entrada simples. Cada toque gera um padrão, e a tradução aparece na janela de texto de uma vez. É quase como usar uma máquina histórica adaptada para o navegador.  \nPor que as pessoas instalem este tradutor:  \nConversão online sem software extra  \nSincronização automática entre ambos os campos  \nUma referência clara do alfabeto em código morse dentro do aplicativo  \nModo de chave de telégrafo para tocar sinais  \nAtualizações que expandem idiomas e recursos  \nFrases diárias são mais divertidas quando vistas através de sinais. Você pode usar o conversor de código morse para ver como “olá” fica, e até mesmo cumprimentos curtos podem assumir um tom brincalhão. Algumas pessoas experimentam com \"eu te amo\" em código morse para mensagens criativas, enquanto outras verificam \"sos\" em código morse ou \"sos en code morse\" para prática de emergência. O sistema tem uma longa tradição no mundo do rádio, onde os operadores costumam usar códigos curtos e abreviações:  \n73 (--... ...--): significa “melhores desejos” e é usado para encerrar um contato educadamente.  \n88 (---.. ---..): representa “beijos”, frequentemente compartilhados entre amigos ou colegas.  \nCQ (-.-. --.-): um chamado geral a todos os operadores, traduzido como “chamada para você”.  \nGM (--. --): “bom dia”, GA (--. .-): “boa tarde”, GE (--. .): “boa noite”, GN (--. -.): “boa noite”.  \nR (.-.): um sinal de confirmação que significa “recebido” ou “entendido”.  \nPSE (.--. ... .): abreviação de “por favor”, usada em pedidos educados.  \nAté sequências incomuns como ..---...._, _ _.., ou _. _. são decodificadas sem demora, fazendo com que cada linha de pontos e traços faça parte de uma linguagem viva.  \n▸ Casos de uso comuns incluem:  \nProfessores que explicam o que é código morse durante a aula  \nEstudantes praticando projetos de inglês para código morse  \nHobbyistas trabalhando com números em código morse em seu tempo livre  \nHistoriadores mostrando código sos em morse como parte da cultura  \nCriadores usando ferramentas de criação de código morse para design  \nA extensão também funciona como um decodificador de código morse. Cole qualquer sequência, e a tradução para texto simples aparece de imediato. Seja testando _. _ ou sequências mais longas como //, a ferramenta mostra o significado claramente. Sem adivinhações, sem atrasos, apenas interação suave. Para muitos aprendizes, isso se torna a maneira mais simples de treinar e converter morse para inglês em tempo real.  \n1️⃣ Benefícios em um relance:  \nFácil introdução ao alfabeto morse  \nDecodificação de não em código morse e outras frases  \nUma chance de estudar letras em código morse em palavras  \nCombinações criativas como // para experimentos  \nO som adiciona outra dimensão. O tradutor pode reproduzir os padrões que você cria. Ele também permite que você altere a velocidade de reprodução, para que pontos curtos e traços mais longos correspondam ao seu ritmo. Você pode desacelerá-lo para praticar ou acelerá-lo para realismo. Há até uma opção para exportar sinais e salvá-los em um arquivo WAV para ouvir depois.  \n➤ Quem vai gostar:  \nEstudantes explorando código sos morse como parte de projetos  \nProfessores preparando ilustrações claras  \nFãs de rádio decodificando sos en code morse por diversão  \nDesigners inspirados pelo ritmo dos sinais  \nQualquer um que queira traduzir código morse sem esforço  \nA privacidade é sempre respeitada. A extensão funciona completamente dentro do navegador, sem informações enviadas para fora. Seus experimentos com este código morse para treinamento de alfabeto ou trabalho criativo permanecem apenas seus.  \n2️⃣ FAQ:  \nO Tradutor de Código Morse pode converter para inglês imediatamente? Sim, instantaneamente.  \nHá um conversor de código morse para letras e números? Sim, tudo está coberto.  \nEle simula uma máquina de código morse? Sim, através do recurso de toque.  \nPosso ajustar o som? Sim, a velocidade pode ser alterada, e a reprodução pode ser exportada como WAV.  \nHá um gerador de código morse incluído? Sim, você pode criar e testar seus próprios sinais.  \nA extensão lida com padrões incomuns? Sim, ela decodifica até sequências raras.  \n3️⃣ Razões para instalar hoje:  \nPratique com a chave de telégrafo em seu próprio modo  \nAlternar entre código morse para alfabeto e palavras completas  \nExplore sinais como sos en code morse sem confusão  \nAproveite atualizações com mais idiomas e recursos  \nConte com este tradutor como uma ferramenta de aprendizado diária  \nNo final, o Tradutor de Código Morse é mais do que um tradutor. É uma maneira de se conectar com a história enquanto usa ferramentas modernas.  \nDesign por Aleh: stariyleg@gmail.com  \nÍcone - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"morse code icons\">Ícones de código morse criados por Freepik - Flaticon</a>"
  }
}