{
  "appName": {
    "message": "摩斯密碼翻譯器"
  },
  "shortDesc": {
    "message": "這是摩斯密碼翻譯器 – 帶有聲音和文字的摩斯密碼生成器。學習摩斯密碼字母並翻譯成您的語言。"
  },
  "storeDesc": {
    "message": "如果您希望摩斯密碼翻譯器支持新的語言，只需通過電子郵件聯繫開發者。來自用戶的反饋指導未來的更新，您的想法可以塑造下一步的內容。該擴展目前已支持英語、俄語和國際信號，但還計劃增加更多語言。\n\n摩斯密碼翻譯器旨在為希望在線直接且可靠地處理點和劃的人提供服務。這個工具使得將摩斯密碼翻譯成英語及其反向操作變得簡單。所有操作都在瀏覽器內部進行，沒有中間伺服器，因此結果瞬間顯示並保持私密。\n\n其中一個最實用的功能是兩個字段實時同步。當您輸入普通文本時，信號字段會自動更新。當您將點和劃粘貼或輸入到模式側時，文本字段會立即響應。該擴展始終保持兩個方向的對齊。\n\n還有一個電報鍵模擬功能。這個特殊按鈕讓您可以手動敲擊節奏。該模式可以單獨啟用，將您的鍵盤或鼠標變成一個簡單的輸入工具。每次敲擊都會生成一個模式，翻譯會立即顯示在文本窗口中。這感覺就像使用一台適應瀏覽器的歷史機器。\n\n人們為什麼安裝這個翻譯器：\n在線轉換無需額外軟件\n\n兩個字段之間的自動同步\n\n應用內清晰的摩斯密碼字母參考\n\n電報鍵模式以敲擊信號\n\n擴展語言和功能的更新\n\n當通過信號查看日常短語時會更有趣。您可以使用摩斯密碼轉換器查看“hello”的樣子，甚至短暫的問候也能變得有趣。一些人用摩斯密碼實驗“我愛你”以創造性地傳遞信息，而其他人則檢查摩斯密碼中的sos或摩斯密碼中的sos以進行緊急練習。這個系統在無線電世界中有著悠久的傳統，操作員經常使用簡短的代碼和縮寫：\n73 (--... ...--): 意思是“最好的祝願”，用於禮貌地結束聯繫。\n\n88 (---.. ---..): 代表“吻”，通常在朋友或同事之間分享。\n\nCQ (-.-. --.-): 向所有操作員發出的通用呼叫，翻譯為“呼叫你”。\n\nGM (--. --): “早安”，GA (--. .-): “午安”，GE (--. .): “晚安”，GN (--. -.): “晚安”。\n\nR (.-.): 確認信號，意味著“收到”或“明白”。\n\nPSE (.--. ... .): “請”的縮寫，用於禮貌的請求。\n\n即使是像..---...._、_ _..或_. _.這樣不尋常的序列也能毫不延遲地解碼，使每一行點和劃成為一種活的語言。\n▸ 常見用例包括：\n在課堂上解釋摩斯密碼的教師\n\n練習英語到摩斯密碼項目的學生\n\n在空閒時間研究摩斯密碼數字的愛好者\n\n展示摩斯密碼中的sos代碼作為文化一部分的歷史學家\n\n使用摩斯密碼創建工具進行設計的創作者\n\n該擴展還可以作為摩斯密碼解碼器。粘貼任何序列，翻譯成普通文本會立即顯示。無論您測試_. _還是更長的序列如//，該工具都能清晰顯示其含義。沒有猜測，沒有延遲，只有流暢的互動。對於許多學習者來說，這成為了實時訓練和將摩斯密碼轉換為英語的最簡單方法。\n1️⃣ 一目了然的好處：\n輕鬆介紹摩斯字母表\n\n摩斯密碼中的no和其他短語的解碼\n\n學習摩斯密碼字母在單詞中的機會\n\n像//這樣的創意組合進行實驗\n\n聲音增添了另一個維度。翻譯器可以播放您創建的模式。它還允許您改變播放速度，因此短點和長劃可以與您的節奏匹配。您可以放慢速度以進行練習，或加快速度以增強真實感。甚至還有一個選項可以導出信號並將其保存為WAV文件以便稍後收聽。\n➤ 誰會喜歡它：\n探索摩斯代碼sos的學生作為項目的一部分\n\n準備清晰插圖的教師\n\n為了娛樂而解碼摩斯密碼中的sos的無線電愛好者\n\n受到信號節奏啟發的設計師\n\n任何想要輕鬆翻譯摩斯密碼的人\n\n隱私始終受到尊重。該擴展完全在瀏覽器內運行，沒有信息被發送出去。您對這個摩斯密碼的實驗用於字母訓練或創意工作將僅屬於您自己。\n2️⃣ 常見問題：\n摩斯密碼翻譯器可以立即轉換為英語嗎？是的，瞬間。\n\n有摩斯密碼轉換器用於字母和數字嗎？是的，所有內容都涵蓋了。\n\n它模擬摩斯密碼機器嗎？是的，通過敲擊功能。\n\n我可以調整聲音嗎？是的，可以改變速度，播放可以導出為WAV。\n\n有包含摩斯密碼生成器嗎？是的，您可以創建和測試自己的信號。\n\n該擴展處理不尋常的模式嗎？是的，它甚至能解碼稀有序列。\n\n3️⃣ 今天安裝的理由：\n在其自己的模式中練習電報鍵\n\n在摩斯密碼字母和完整單詞之間切換\n\n探索像摩斯密碼中的sos這樣的信號，毫無困惑\n\n享受更多語言和功能的更新\n\n依賴這個翻譯器作為日常學習工具\n\n最終，摩斯密碼翻譯器不僅僅是一個翻譯器。它是一種使用現代工具與歷史連接的方式。\n設計者：Aleh: stariyleg@gmail.com\n圖標 - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"morse code icons\">摩斯密碼圖標由Freepik - Flaticon創建</a>"
  }
}