{
  "appName": {
    "message": "Morsekodöversättare"
  },
  "shortDesc": {
    "message": "Detta är Morsekodöversättare – morsekodsgenerator med ljud och text. Lär dig morsekodens alfabet och översätt till ditt språk."
  },
  "storeDesc": {
    "message": "Om du vill ha stöd för nya språk i Morsekodöversättare, skriv bara till utvecklaren via e-post. Feedback från användare vägleder framtida uppdateringar, och dina idéer kan forma vad som kommer att dyka upp härnäst. Tillägget fungerar redan med engelska, ryska och internationella signaler, men fler är planerade.  \nMorsekodöversättare är utformad för personer som vill ha ett direkt och pålitligt sätt att arbeta med prickar och streck online. Verktyget gör det enkelt att översätta morsekod till engelska och tillbaka igen. Allt körs i webbläsaren, utan servrar emellan, så resultaten visas omedelbart och förblir privata.  \nEn av de mest praktiska funktionerna är att båda fälten är synkroniserade i realtid. När du skriver vanlig text uppdateras signalfältet automatiskt. När du klistrar in eller anger prickar och streck i mönsterfältet svarar textfältet omedelbart. Tillägget håller alltid båda riktningarna i linje.  \nDet finns också en simulering av telegrafnyckel. Denna speciella knapp låter dig knacka rytmer för hand. Läge kan aktiveras separat, vilket gör att ditt tangentbord eller mus fungerar som ett enkelt inmatningsverktyg. Varje knackning genererar ett mönster, och översättningen visas i textfönstret på en gång. Det känns nästan som att använda en historisk maskin anpassad för webbläsaren.  \nVarför människor installerar denna översättare:  \nOnlinekonvertering utan extra programvara  \n\nAutomatisk synkronisering mellan båda fälten  \n\nEn tydlig referens för morsekodens alfabet inuti appen  \n\nTelegrafnyckelläge för att knacka signaler  \n\nUppdateringar som utökar språk och funktioner  \n\nDagliga fraser är roligare när de ses genom signaler. Du kan använda morsekodkonverteraren för att se hur \"hej\" ser ut, och även korta hälsningar kan få en lekfull ton. Vissa människor experimenterar med \"jag älskar dig\" i morsekod för kreativa meddelanden, medan andra kollar \"sos\" i morsekod eller \"sos en code morse\" för nödsituationsträning. Systemet har en lång tradition inom radiovärlden, där operatörer ofta använder korta koder och förkortningar:  \n73 (--... ...--): betyder \"bästa hälsningar\" och används för att avsluta en kontakt artigt.  \n\n88 (---.. ---..): står för \"kyssar\", ofta delade mellan vänner eller kollegor.  \n\nCQ (-.-. --.-): ett allmänt samtal till alla operatörer, översatt som \"samtal till dig.\"  \n\nGM (--. --): \"god morgon,\" GA (--. .-): \"god eftermiddag,\" GE (--. .): \"god kväll,\" GN (--. -.): \"god natt.\"  \n\nR (.-.): en bekräftelsesignal som betyder \"mottagen\" eller \"förstått.\"  \n\nPSE (.--. ... .): kort för \"snälla,\" används i artiga förfrågningar.  \n\nÄven ovanliga sekvenser som ..---...._, _ _.., eller _. _. avkodas utan fördröjning, vilket gör varje rad av prickar och streck till en del av ett levande språk.  \n▸ Vanliga användningsområden inkluderar:  \nLärare som förklarar vad morsekod är under lektionen  \n\nStudenter som övar engelska till morsekodprojekt  \n\nHobbyister som arbetar med morsekodnummer på sin fritid  \n\nHistoriker som visar \"sos\" kod i morse som en del av kulturen  \n\nSkapare som använder morsekodskapande verktyg för design  \n\nTillägget fungerar också som en morsekodavkodare. Klistra in vilken sekvens som helst, och översättningen till vanlig text visas omedelbart. Oavsett om du testar _. _ eller längre sekvenser som //, visar verktyget betydelsen tydligt. Ingen gissning, inga fördröjningar, bara smidig interaktion. För många elever blir detta det enklaste sättet att träna och konvertera morse till engelska i realtid.  \n1️⃣ Fördelar i korthet:  \nEnkel introduktion till morsealfabetet  \n\nAvkodning av \"nej\" i morsekod och andra fraser  \n\nEn chans att studera morsekodsbokstäver i ord  \n\nKreativa kombinationer som // för experiment  \n\nLjud tillför en annan dimension. Översättaren kan spela upp de mönster du skapar. Den låter dig också ändra uppspelningshastighet, så korta prickar och längre streck matchar din takt. Du kan sakta ner för träning eller snabba upp för realism. Det finns till och med ett alternativ för att exportera signaler och spara dem i en WAV-fil för senare lyssning.  \n➤ Vem kommer att uppskatta det:  \nStudenter som utforskar \"sos\" morse som en del av projekt  \n\nLärare som förbereder tydliga illustrationer  \n\nRadioentusiaster som avkodar \"sos en code morse\" för skojs skull  \n\nDesigners inspirerade av signalernas rytm  \n\nAlla som vill översätta morsekod utan ansträngning  \n\nIntegritet respekteras alltid. Tillägget körs helt inuti webbläsaren, utan information som skickas bort. Dina experiment med denna morsekod för alfabetsträning eller kreativt arbete förblir endast dina.  \n2️⃣ FAQ:  \nKan Morsekodöversättare konvertera till engelska direkt? Ja, omedelbart.  \n\nFinns det en morsekodkonverterare för bokstäver och siffror? Ja, allt täcks.  \n\nSimulerar den en morsekodmaskin? Ja, genom knackningsfunktionen.  \n\nKan jag justera ljudet? Ja, hastigheten kan ändras, och uppspelning kan exporteras som WAV.  \n\nFinns det en morsekodgenerator inkluderad? Ja, du kan skapa och testa dina egna signaler.  \n\nHantera tillägget ovanliga mönster? Ja, det avkodar även sällsynta sekvenser.  \n3️⃣ Anledningar att installera idag:  \nÖva med telegrafnyckeln i sitt eget läge  \n\nVäxla mellan morsekod för alfabet och hela ord  \n\nUtforska signaler som \"sos en code morse\" utan förvirring  \n\nNjut av uppdateringar med fler språk och funktioner  \n\nLita på denna översättare som ett dagligt lärverktyg  \n\nI slutändan är Morsekodöversättare mer än en översättare. Det är ett sätt att koppla samman med historien medan man använder moderna verktyg.  \nDesign av Aleh: stariyleg@gmail.com  \nIkon - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"morse code icons\">Morsekodikoner skapade av Freepik - Flaticon</a>"
  }
}