{
  "appName": {
    "message": "मोर्स कोड अनुवादक"
  },
  "shortDesc": {
    "message": "यह मोर्स कोड ट्रांसलेटर है - ध्वनि और पाठ के साथ मोर्स कोड जनरेटर। मोर्स कोड वर्णमाला सीखें और अपनी भाषा में अनुवाद करें।"
  },
  "storeDesc": {
    "message": "अगर आप मोर्स कोड ट्रांसलेटर में नई भाषाओं के लिए समर्थन चाहते हैं, तो डेवलपर को ईमेल से लिखें। उपयोगकर्ताओं से मिलने वाला फीडबैक भविष्य के अपडेट्स को दिशा देता है, और आपके विचार आगे क्या होगा, यह तय कर सकते हैं। यह एक्सटेंशन पहले से ही अंग्रेज़ी, रूसी और अंतर्राष्ट्रीय सिग्नल्स के साथ काम करता है, लेकिन और भी आने की योजना है।\n मोर्स कोड ट्रांसलेटर उन लोगों के लिए डिज़ाइन किया गया है जो ऑनलाइन डॉट्स और डैश के साथ काम करने का एक सीधा और विश्वसनीय तरीका चाहते हैं। यह टूल मोर्स कोड को अंग्रेज़ी में और फिर अंग्रेज़ी में अनुवाद करना आसान बनाता है। सब कुछ ब्राउज़र के अंदर चलता है, बीच में कोई सर्वर नहीं होता, इसलिए परिणाम तुरंत दिखाई देते हैं और निजी रहते हैं।\n सबसे व्यावहारिक विशेषताओं में से एक यह है कि दोनों फ़ील्ड वास्तविक समय में सिंक्रनाइज़ होते हैं। जब आप सादा टेक्स्ट टाइप करते हैं, तो सिग्नल फ़ील्ड अपने आप अपडेट हो जाता है। जब आप पैटर्न वाले हिस्से में डॉट्स और डैश पेस्ट करते हैं या डालते हैं, तो टेक्स्ट फ़ील्ड तुरंत प्रतिक्रिया देता है। एक्सटेंशन हमेशा दोनों दिशाओं को संरेखित रखता है।\n इसमें एक टेलीग्राफ़ कुंजी सिमुलेशन भी है। यह विशेष बटन आपको हाथ से लय पर टैप करने की सुविधा देता है। इस मोड को अलग से सक्रिय किया जा सकता है, जिससे आपका कीबोर्ड या माउस एक साधारण इनपुट टूल में बदल जाता है। प्रत्येक टैप एक पैटर्न बनाता है, और अनुवाद तुरंत टेक्स्ट विंडो में दिखाई देता है। यह लगभग ब्राउज़र के लिए अनुकूलित एक ऐतिहासिक मशीन का उपयोग करने जैसा लगता है।\n लोग इस अनुवादक को क्यों स्थापित करते हैं:\n अतिरिक्त सॉफ़्टवेयर के बिना ऑनलाइन रूपांतरण\n\n\n दोनों क्षेत्रों के बीच स्वचालित समन्वयन\n\n\n ऐप के अंदर एक स्पष्ट मोर्स कोड वर्णमाला संदर्भ\n\n\n सिग्नल टैपिंग के लिए टेलीग्राफ कुंजी मोड\n\n\n भाषाओं और सुविधाओं का विस्तार करने वाले अपडेट\n\n\n संकेतों के माध्यम से देखे जाने पर दैनिक वाक्यांश अधिक मज़ेदार लगते हैं। आप मोर्स कोड कनवर्टर का उपयोग करके देख सकते हैं कि &quot;हैलो&quot; कैसा दिखता है, और यहाँ तक कि छोटे अभिवादन भी एक चंचल लहजे में बदल सकते हैं। कुछ लोग रचनात्मक संदेशों के लिए मोर्स कोड में &quot;आई लव यू&quot; का प्रयोग करते हैं, जबकि अन्य आपातकालीन अभ्यास के लिए मोर्स कोड में &quot;एसओएस&quot; या &quot;एसओएस एन कोड मोर्स&quot; की जाँच करते हैं। रेडियो जगत में इस प्रणाली की एक लंबी परंपरा रही है, जहाँ ऑपरेटर अक्सर छोटे कोड और संक्षिप्त रूपों का उपयोग करते हैं:\n 73 (--... ...--): इसका अर्थ है “शुभकामनाएं” और इसका उपयोग किसी संपर्क को विनम्रतापूर्वक समाप्त करने के लिए किया जाता है।\n\n\n 88 (---.. ---..): का अर्थ है &quot;चुंबन&quot;, जो अक्सर दोस्तों या सहकर्मियों के बीच साझा किया जाता है।\n\n\n सीक्यू (-.-. --.-): सभी ऑपरेटरों के लिए एक सामान्य कॉल, जिसका अनुवाद &quot;आपके लिए कॉल&quot; के रूप में किया जाता है।\n\n\n जीएम (--. --): “शुभ प्रभात,” जीए (--. .-): “शुभ दोपहर,” जीई (--. .): “शुभ संध्या,” जीएन (--. -.): “शुभ रात्रि।”\n\n\n आर (.-.): एक पुष्टिकरण संकेत जिसका अर्थ है “प्राप्त” या “समझा गया।”\n\n\n पीएसई (.--. ... .): &quot;कृपया&quot; का संक्षिप्त रूप, विनम्र अनुरोधों में प्रयुक्त।\n\n\n यहां तक ​​कि असामान्य अनुक्रम जैसे ..---...._, _ _.., या _. _. को भी बिना किसी देरी के डिकोड किया जा सकता है, जिससे बिंदुओं और डैश की प्रत्येक पंक्ति एक जीवंत भाषा का हिस्सा बन जाती है।\n ▸ सामान्य उपयोग के मामलों में शामिल हैं:\n शिक्षक जो कक्षा के दौरान मोर्स कोड क्या है, समझाते हैं\n\n\n अंग्रेजी से मोर्स कोड परियोजनाओं का अभ्यास करते छात्र\n\n\n अपने खाली समय में मोर्स कोड संख्याओं के साथ काम करने वाले शौकिया लोग\n\n\n इतिहासकार मोर्स में एसओएस कोड को संस्कृति का हिस्सा बता रहे हैं\n\n\n डिज़ाइन के लिए मोर्स कोड क्रिएटर टूल का उपयोग करने वाले क्रिएटर\n\n\n यह एक्सटेंशन मोर्स कोड डिकोडर के रूप में भी काम करता है। कोई भी क्रम पेस्ट करें, और सादे पाठ में अनुवाद तुरंत दिखाई देगा। चाहे आप _. _ का परीक्षण करें या // जैसे लंबे क्रमों का, यह टूल अर्थ स्पष्ट रूप से दिखाता है। कोई अनुमान नहीं, कोई देरी नहीं, केवल सहज बातचीत। कई शिक्षार्थियों के लिए, यह वास्तविक समय में मोर्स को अंग्रेजी में प्रशिक्षित करने और परिवर्तित करने का सबसे आसान तरीका बन जाता है।\n 1️⃣ लाभ एक नज़र में:\n मोर्स वर्णमाला का आसान परिचय\n\n\n मोर्स कोड और अन्य वाक्यांशों में &#39;नहीं&#39; का डिकोडिंग\n\n\n शब्दों में मोर्स कोड अक्षरों का अध्ययन करने का मौका\n\n\n प्रयोगों के लिए // जैसे रचनात्मक संयोजन\n\n\n ध्वनि एक और आयाम जोड़ती है। अनुवादक आपके द्वारा बनाए गए पैटर्न को प्लेबैक कर सकता है। यह आपको प्लेबैक गति बदलने की भी सुविधा देता है, ताकि छोटे बिंदु और लंबे डैश आपकी गति से मेल खाएँ। आप अभ्यास के लिए इसे धीमा कर सकते हैं या यथार्थवाद के लिए तेज़ कर सकते हैं। सिग्नल को एक्सपोर्ट करने और बाद में सुनने के लिए उन्हें WAV फ़ाइल में सेव करने का विकल्प भी है।\n ➤ इसका आनंद कौन लेगा:\n छात्र परियोजनाओं के एक भाग के रूप में कोड सोस मोर्स का अन्वेषण कर रहे हैं\n\n\n शिक्षक स्पष्ट चित्र तैयार कर रहे हैं\n\n\n रेडियो प्रशंसक मनोरंजन के लिए एसओएस एन कोड मोर्स को डिकोड कर रहे हैं\n\n\n सिग्नल की लय से प्रेरित डिजाइनर\n\n\n जो कोई भी बिना प्रयास के मोर्स कोड का अनुवाद करना चाहता है\n\n\n गोपनीयता का हमेशा सम्मान किया जाता है। यह एक्सटेंशन पूरी तरह से ब्राउज़र के अंदर चलता है, कोई भी जानकारी बाहर नहीं भेजी जाती। वर्णमाला प्रशिक्षण या रचनात्मक कार्य के लिए इस मोर्स कोड के साथ आपके प्रयोग केवल आपके ही रहेंगे।\n 2️⃣ अक्सर पूछे जाने वाले प्रश्न:\n क्या मोर्स कोड ट्रांसलेटर तुरंत अंग्रेज़ी में बदल सकता है? हाँ, तुरंत।\n\n\n क्या अक्षरों और संख्याओं के लिए कोई मोर्स कोड कनवर्टर उपलब्ध है? हाँ, सब कुछ इसमें शामिल है।\n\n\n क्या यह मोर्स कोड मशीन की नकल करता है? हाँ, टैपिंग फ़ीचर के ज़रिए।\n\n\n क्या मैं ध्वनि समायोजित कर सकता हूँ? हाँ, गति बदली जा सकती है, और प्लेबैक को WAV के रूप में निर्यात किया जा सकता है।\n\n\n क्या इसमें मोर्स कोड जनरेटर शामिल है? हाँ, आप अपने सिग्नल खुद बना और परख सकते हैं।\n\n\n क्या यह एक्सटेंशन असामान्य पैटर्न को भी संभाल सकता है? हाँ, यह दुर्लभ अनुक्रमों को भी डिकोड कर लेता है।\n\n\n आज ही इंस्टॉल करने के 3️⃣ कारण:\n टेलीग्राफ कुंजी के साथ अपने स्वयं के मोड में अभ्यास करें\n\n\n वर्णमाला और पूर्ण शब्दों के लिए मोर्स कोड के बीच स्विच करें\n\n\n बिना किसी भ्रम के sos en code morse जैसे संकेतों का अन्वेषण करें\n\n\n अधिक भाषाओं और सुविधाओं के साथ अपडेट का आनंद लें\n\n\n दैनिक शिक्षण उपकरण के रूप में इस अनुवादक पर भरोसा करें\n\n\n अंततः, मोर्स कोड ट्रांसलेटर एक अनुवादक से कहीं बढ़कर है। यह आधुनिक उपकरणों का उपयोग करते हुए इतिहास से जुड़ने का एक ज़रिया है।\n डिज़ाइन: अलेह: stariyleg@gmail.com\n आइकन - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"मोर्स कोड चिह्न\">Freepik द्वारा निर्मित मोर्स कोड आइकन - Flaticon</a>\n"
  }
}