import { MAP_FWD as ITU_BASE } from './mapping_itu.js';

export const MAP_FWD = {
  ...ITU_BASE,
  'ا': '.-',
  'ب': '-...',
  'ت': '-',
  'ث': '-.-.',
  'ج': '.--',
  'ح': '....',
  'خ': '---.',
  'د': '-..',
  'ذ': '--.',
  'ر': '.-.',
  'ز': '--..',
  'س': '...',
  'ش': '---',
  'ص': '--.-',
  'ض': '-..-',
  'ط': '--',
  'ظ': '-.--',
  'ع': '.-.-',
  'غ': '--.',
  'ف': '..-.',
  'ق': '--.-',
  'ك': '-.-',
  'ل': '.-..',
  'م': '--',
  'ن': '-.',
  'ه': '....',
  'و': '.--',
  'ي': '..'
};

export const MAP_REV = Object.fromEntries(
  Object.entries(MAP_FWD).map(([char, code]) => [code, char])
);


