{
  "appName": {
    "message": "مترجم کد مورس"
  },
  "shortDesc": {
    "message": "این مترجم کد مورس است – تولیدکننده کد مورس با صدا و متن. الفبای کد مورس را یاد بگیرید و به زبان خود ترجمه کنید."
  },
  "storeDesc": {
    "message": "اگر می‌خواهید از زبان‌های جدید در مترجم کد مورس پشتیبانی شود، فقط با ایمیل به توسعه‌دهنده بنویسید. بازخورد کاربران راهنمای به‌روزرسانی‌های آینده است و ایده‌های شما می‌تواند شکل‌دهنده آنچه باشد که در آینده ظاهر می‌شود. این افزونه در حال حاضر با زبان‌های انگلیسی، روسی و سیگنال‌های بین‌المللی کار می‌کند، اما برنامه‌های بیشتری در دست اقدام است.\nمترجم کد مورس برای افرادی طراحی شده است که می‌خواهند راهی مستقیم و قابل اعتماد برای کار با نقطه‌ها و خط‌ها به صورت آنلاین داشته باشند. این ابزار ترجمه کد مورس به انگلیسی و بالعکس را ساده می‌کند. همه چیز درون مرورگر اجرا می‌شود، بدون سرورهای میانجی، بنابراین نتایج به‌طور آنی ظاهر می‌شوند و خصوصی باقی می‌مانند.\nیکی از عملی‌ترین ویژگی‌ها این است که هر دو فیلد به‌صورت همزمان همگام‌سازی می‌شوند. وقتی متن ساده را تایپ می‌کنید، فیلد سیگنال به‌طور خودکار به‌روزرسانی می‌شود. وقتی نقطه‌ها و خط‌ها را در سمت الگو پیست یا وارد می‌کنید، فیلد متن بلافاصله پاسخ می‌دهد. این افزونه همیشه هر دو جهت را هم‌راستا نگه می‌دارد.\nهمچنین شبیه‌سازی کلید تلگراف وجود دارد. این دکمه ویژه به شما اجازه می‌دهد تا ریتم‌ها را با دست بزنید. این حالت می‌تواند به‌طور جداگانه فعال شود و کیبورد یا ماوس شما را به یک ابزار ورودی ساده تبدیل کند. هر ضربه یک الگو تولید می‌کند و ترجمه بلافاصله در پنجره متن ظاهر می‌شود. این تقریباً شبیه به استفاده از یک ماشین تاریخی است که برای مرورگر سازگار شده است.\nچرا مردم این مترجم را نصب می‌کنند:\nتبدیل آنلاین بدون نرم‌افزار اضافی\n\nهمگام‌سازی خودکار بین هر دو فیلد\n\nمرجع واضح الفبای کد مورس درون برنامه\n\nحالت کلید تلگراف برای زدن سیگنال‌ها\n\nبه‌روزرسانی‌هایی که زبان‌ها و ویژگی‌ها را گسترش می‌دهند\n\nعبارات روزمره وقتی از طریق سیگنال‌ها مشاهده می‌شوند، بیشتر سرگرم‌کننده هستند. شما می‌توانید از مبدل کد مورس استفاده کنید تا ببینید \"سلام\" چگونه به نظر می‌رسد و حتی سلام‌های کوتاه می‌توانند لحن بازیگوشانه‌ای به خود بگیرند. برخی افراد با \"دوستت دارم\" به زبان کد مورس برای پیام‌های خلاقانه آزمایش می‌کنند، در حالی که دیگران \"س.ا.س\" را به زبان کد مورس یا \"س.ا.س\" به کد مورس برای تمرین اضطراری بررسی می‌کنند. این سیستم در دنیای رادیو سنتی طولانی دارد، جایی که اپراتورها اغلب از کدهای کوتاه و اختصارات استفاده می‌کنند:\n73 (--... ...--): به معنای \"بهترین آرزوها\" و برای پایان دادن به یک تماس به‌طور مودبانه استفاده می‌شود.\n\n88 (---.. ---..): به معنای \"بوسه‌ها\"، که اغلب بین دوستان یا همکاران به اشتراک گذاشته می‌شود.\n\nCQ (-.-. --.-): یک تماس عمومی به همه اپراتورها، به معنای \"تماس به شما\".\n\nGM (--. --): \"صبح بخیر\"، GA (--. .-): \"عصر بخیر\"، GE (--. .): \"عصر بخیر\"، GN (--. -.): \"شب بخیر\".\n\nR (.-.): یک سیگنال تأیید به معنای \"دریافت شد\" یا \"درک شد\".\n\nPSE (.--. ... .): کوتاه شده \"لطفاً\"، که در درخواست‌های مودبانه استفاده می‌شود.\n\nحتی دنباله‌های غیرمعمول مانند ..---...._, _ _..، یا _. _. بدون تأخیر رمزگشایی می‌شوند و هر خط از نقطه‌ها و خط‌ها بخشی از یک زبان زنده است.\n▸ موارد استفاده رایج شامل:\nمعلمان که توضیح می‌دهند کد مورس چیست در کلاس\n\nدانش‌آموزانی که پروژه‌های کد مورس به انگلیسی را تمرین می‌کنند\n\nعلاقه‌مندان که در اوقات فراغت با اعداد کد مورس کار می‌کنند\n\nتاریخ‌نگاران که کد س.ا.س را به زبان کد مورس به عنوان بخشی از فرهنگ نشان می‌دهند\n\nسازندگان که از ابزارهای خالق کد مورس برای طراحی استفاده می‌کنند\n\nاین افزونه همچنین به عنوان یک رمزگشای کد مورس عمل می‌کند. هر دنباله‌ای را پیست کنید و ترجمه به متن ساده بلافاصله ظاهر می‌شود. چه شما _. _ را آزمایش کنید یا دنباله‌های طولانی‌تری مانند //، این ابزار معنی را به وضوح نشان می‌دهد. هیچ حدس و گمانی، هیچ تأخیری، فقط تعامل روان. برای بسیاری از یادگیرندگان، این ساده‌ترین راه برای تمرین و تبدیل کد مورس به انگلیسی در زمان واقعی می‌شود.\n1️⃣ مزایا در یک نگاه:\nمعرفی آسان به الفبای مورس\n\nرمزگشایی \"نه\" در کد مورس و دیگر عبارات\n\nفرصتی برای مطالعه حروف کد مورس در کلمات\n\nترکیب‌های خلاقانه مانند // برای آزمایش‌ها\n\nصدا بعد بعد دیگری اضافه می‌کند. مترجم می‌تواند الگوهایی را که ایجاد می‌کنید پخش کند. همچنین به شما اجازه می‌دهد سرعت پخش را تغییر دهید، بنابراین نقطه‌های کوتاه و خط‌های بلند با سرعت شما مطابقت دارند. می‌توانید آن را برای تمرین کند کنید یا برای واقع‌گرایی سریع‌تر کنید. حتی گزینه‌ای برای صادرات سیگنال‌ها و ذخیره آن‌ها در یک فایل WAV برای گوش دادن بعدی وجود دارد.\n➤ چه کسانی از آن لذت خواهند برد:\nدانش‌آموزانی که کد س.ا.س را به عنوان بخشی از پروژه‌ها بررسی می‌کنند\n\nمعلمان که تصاویری واضح تهیه می‌کنند\n\nطرفداران رادیو که کد س.ا.س را برای سرگرمی رمزگشایی می‌کنند\n\nطراحانی که از ریتم سیگنال‌ها الهام می‌گیرند\n\nهر کسی که می‌خواهد بدون زحمت کد مورس را ترجمه کند\n\nحریم خصوصی همیشه محترم شمرده می‌شود. این افزونه به‌طور کامل درون مرورگر اجرا می‌شود و هیچ اطلاعاتی ارسال نمی‌شود. آزمایش‌های شما با این کد مورس برای آموزش الفبا یا کار خلاقانه تنها متعلق به شما باقی می‌ماند.\n2️⃣ سوالات متداول:\nآیا مترجم کد مورس می‌تواند بلافاصله به انگلیسی تبدیل کند؟ بله، به‌طور آنی.\n\nآیا مبدل کد مورس برای حروف و اعداد وجود دارد؟ بله، همه چیز پوشش داده شده است.\n\nآیا این شبیه‌سازی یک ماشین کد مورس است؟ بله، از طریق ویژگی ضربه زدن.\n\nآیا می‌توانم صدا را تنظیم کنم؟ بله، سرعت می‌تواند تغییر کند و پخش می‌تواند به عنوان WAV صادر شود.\n\nآیا یک تولیدکننده کد مورس در آن گنجانده شده است؟ بله، می‌توانید سیگنال‌های خود را ایجاد و آزمایش کنید.\n\nآیا این افزونه الگوهای غیرمعمول را مدیریت می‌کند؟ بله، حتی دنباله‌های نادر را رمزگشایی می‌کند.\n\n3️⃣ دلایل نصب امروز:\nتمرین با کلید تلگراف در حالت خود\n\nتغییر بین کد مورس برای الفبا و کلمات کامل\n\nکاوش در سیگنال‌ها مانند کد س.ا.س بدون سردرگمی\n\nلذت بردن از به‌روزرسانی‌ها با زبان‌ها و ویژگی‌های بیشتر\n\nتکیه بر این مترجم به عنوان یک ابزار یادگیری روزانه\n\nدر نهایت، مترجم کد مورس بیشتر از یک مترجم است. این یک راه برای ارتباط با تاریخ در حالی که از ابزارهای مدرن استفاده می‌کنید است.\nطراحی توسط آله: stariyleg@gmail.com\nآیکون - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"morse code icons\">آیکون‌های کد مورس ایجاد شده توسط Freepik - Flaticon</a>"
  }
}