{
  "appName": {
    "message": "Morsekodeoversætter"
  },
  "shortDesc": {
    "message": "Dette er Morsekodeoversætter – morse kodegenerator med lyd og tekst. Lær morse kode alfabetet og oversæt til dit sprog."
  },
  "storeDesc": {
    "message": "Hvis du ønsker support til nye sprog i Morsekodeoversætter, kan du blot skrive til udvikleren via e-mail. Feedback fra brugerne guider fremtidige opdateringer, og dine idéer kan forme, hvad der vil komme næste gang. Udvidelsen fungerer allerede med engelsk, russisk og internationale signaler, men flere er planlagt.  \nMorsekodeoversætter er designet til folk, der ønsker en direkte og pålidelig måde at arbejde med prikker og streger online. Værktøjet gør det enkelt at oversætte morse kode til engelsk og tilbage igen. Alt kører inde i browseren, uden servere imellem, så resultaterne vises straks og forbliver private.  \nEn af de mest praktiske funktioner er, at begge felter er synkroniseret i realtid. Når du skriver almindelig tekst, opdateres signalfeltet automatisk. Når du indsætter eller indtaster prikker og streger i mønsterfeltet, reagerer tekstfeltet straks. Udvidelsen holder altid begge retninger justeret.  \nDer er også en simulation af telegrafnøglen. Denne specielle knap lader dig tappe rytmer i hånden. Tilstanden kan aktiveres separat, hvilket gør dit tastatur eller mus til et simpelt inputværktøj. Hver tap genererer et mønster, og oversættelsen vises straks i tekstvinduet. Det føles næsten som at bruge en historisk maskine tilpasset til browseren.  \nHvorfor folk installerer denne oversætter:  \nOnline konvertering uden ekstra software  \nAutomatisk synkronisering mellem begge felter  \nEn klar morse kode alfabet reference inde i appen  \nTelegrafnøgle tilstand til at tappe signaler  \nOpdateringer, der udvider sprog og funktioner  \nDaglige sætninger er sjovere, når de ses gennem signaler. Du kan bruge morse kode konverteren til at se, hvordan “hej” ser ud, og selv korte hilsner kan få en legende tone. Nogle mennesker eksperimenterer med jeg elsker dig i morse kode til kreative beskeder, mens andre tjekker sos i morse kode eller sos en kode morse til nødøvelser. Systemet har en lang tradition i radiov verden, hvor operatører ofte bruger korte koder og forkortelser:  \n73 (--... ...--): betyder “bedste ønsker” og bruges til at afslutte en kontakt høfligt.  \n88 (---.. ---..): står for “kys,” ofte delt mellem venner eller kolleger.  \nCQ (-.-. --.-): et generelt kald til alle operatører, oversat som “kald til dig.”  \nGM (--. --): “godmorgen,” GA (--. .-): “god eftermiddag,” GE (--. .): “god aften,” GN (--. -.): “god nat.”  \nR (.-.): et bekræftelsessignal, der betyder “modtaget” eller “forstået.”  \nPSE (.--. ... .): forkortelse for “venligst,” brugt i høflige anmodninger.  \nSelv usædvanlige sekvenser som ..---...._, _ _.., eller _. _. bliver dekodet uden forsinkelse, hvilket gør hver linje af prikker og streger til en del af et levende sprog.  \n▸ Almindelige anvendelsestilfælde inkluderer:  \nLærere, der forklarer, hvad morse kode er under klasse  \nStuderende, der øver engelsk til morse kode projekter  \nHobbyister, der arbejder med morse kode numre i deres fritid  \nHistorikere, der viser sos kode i morse som en del af kulturen  \nSkabere, der bruger morse kode skaber værktøjer til design  \nUdvidelsen fungerer også som en morse kode dekoder. Indsæt enhver sekvens, og oversættelsen til almindelig tekst vises straks. Uanset om du tester _. _ eller længere sekvenser som //, viser værktøjet betydningen klart. Ingen gætteri, ingen forsinkelser, kun glat interaktion. For mange lærende bliver dette den nemmeste måde at træne og konvertere morse til engelsk i realtid.  \n1️⃣ Fordele ved et hurtigt overblik:  \nNem introduktion til morse alfabetet  \nDekodning af nej i morse kode og andre sætninger  \nEn chance for at studere morse kode bogstaver i ord  \nKreative kombinationer som // til eksperimenter  \nLyd tilføjer en anden dimension. Oversætteren kan afspille de mønstre, du skaber. Den giver dig også mulighed for at ændre afspilningshastigheden, så korte prikker og længere streger matcher dit tempo. Du kan sænke det for øvelse eller øge det for realisme. Der er endda en mulighed for at eksportere signaler og gemme dem i en WAV-fil til senere lytning.  \n➤ Hvem vil nyde det:  \nStuderende, der udforsker kode sos morse som en del af projekter  \nLærere, der forbereder klare illustrationer  \nRadiofans, der dekoder sos en kode morse for sjov  \nDesignere inspireret af rytmen i signalerne  \nAlle, der ønsker at oversætte morse kode uden besvær  \nPrivatliv respekteres altid. Udvidelsen kører helt inde i browseren, uden information sendt væk. Dine eksperimenter med denne morse kode til alfabet træning eller kreativt arbejde forbliver kun dine.  \n2️⃣ FAQ:  \nKan Morsekodeoversætter konvertere til engelsk med det samme? Ja, straks.  \nEr der en morse kode konverter til bogstaver og tal? Ja, alt er dækket.  \nSimulerer det en morse kode maskine? Ja, gennem tappefunktionen.  \nKan jeg justere lyd? Ja, hastigheden kan ændres, og afspilning kan eksporteres som WAV.  \nEr der en morse kode generator inkluderet? Ja, du kan oprette og teste dine egne signaler.  \nHåndterer udvidelsen usædvanlige mønstre? Ja, den dekoder selv sjældne sekvenser.  \n3️⃣ Grunde til at installere i dag:  \nØv med telegrafnøglen i sin egen tilstand  \nSkift mellem morse kode for alfabet og komplette ord  \nUdforsk signaler som sos en kode morse uden forvirring  \nNyd opdateringer med flere sprog og funktioner  \nStol på denne oversætter som et dagligt læringsværktøj  \nI sidste ende er Morsekodeoversætter mere end en oversætter. Det er en måde at forbinde med historien, mens man bruger moderne værktøjer.  \nDesign af Aleh: stariyleg@gmail.com  \nIkon - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"morse code icons\">Morse kode ikoner skabt af Freepik - Flaticon</a>"
  }
}