{
  "appName": {
    "message": "מתרגם קוד מורס"
  },
  "shortDesc": {
    "message": "זהו מתרגם קוד מורס - מחולל קוד מורס עם צליל וטקסט. למד את אלפבית קוד המורס ותרגם אותו לשפה שלך."
  },
  "storeDesc": {
    "message": "אם אתם רוצים תמיכה בשפות חדשות ב-Morse Code Translator, פשוט כתבו למפתח בדוא&quot;ל. משוב מהמשתמשים ידריך עדכונים עתידיים, והרעיונות שלכם יכולים לעצב את מה שיופיע בהמשך. ההרחבה כבר עובדת עם אותות באנגלית, רוסית ובינלאומית, אך עוד מתוכננים.\n מתרגם קוד מורס מיועד לאנשים המעוניינים דרך ישירה ואמינה לעבוד עם נקודות ומקפים באופן מקוון. הכלי מאפשר תרגום פשוט של קוד מורס לאנגלית וחזרה. הכל פועל בתוך הדפדפן, ללא שרתים בין לבין, כך שהתוצאות מופיעות באופן מיידי ונשארות פרטיות.\n אחת התכונות המעשיות ביותר היא ששני השדות מסונכרנים בזמן אמת. כשמקלידים טקסט רגיל, שדה הסימן מתעדכן אוטומטית. כשמדביקים או מזינים נקודות ומקפים בצד התבנית, שדה הטקסט מגיב מיד. ההרחבה תמיד שומרת על שני הכיוונים מיושרים.\n יש גם סימולציה של מקשי טלגרף. כפתור מיוחד זה מאפשר לך להקיש על מקצבים ידנית. ניתן להפעיל את המצב בנפרד, מה שהופך את המקלדת או העכבר לכלי קלט פשוט. כל נגיעה יוצרת תבנית, והתרגום מופיע בחלון הטקסט בבת אחת. זה מרגיש כמעט כמו שימוש במכונה היסטורית המותאמת לדפדפן.\n למה אנשים מתקינים את המתרגם הזה:\n המרה מקוונת ללא תוכנה נוספת\n\n\n סנכרון אוטומטי בין שני השדות\n\n\n התייחסות ברורה לאלפבית קוד מורס בתוך האפליקציה\n\n\n מצב מקש טלגרף להקשה על אותות\n\n\n עדכונים שמרחיבים שפות ותכונות\n\n\n ביטויים יומיומיים מהנים יותר כאשר צופים בהם דרך אותות. ניתן להשתמש בממיר קוד מורס כדי לראות איך נראה &quot;שלום&quot;, ואפילו ברכות קצרות יכולות לקבל גוון שובב. יש אנשים שמתנסים ב-i love you בקוד מורס להודעות יצירתיות, בעוד שאחרים בודקים sos בקוד מורס או sos en code morse לתרגול חירום. למערכת מסורת ארוכה בעולם הרדיו, שבו מפעילים משתמשים לעתים קרובות בקודים קצרים ובקיצורים:\n 73 (--... ...--): פירושו &quot;איחולים לבביים&quot; ומשמש לסיום קשר בנימוס.\n\n\n 88 (---.. ---..): מייצג &quot;נשיקות&quot;, שלעתים קרובות חולקות בין חברים או עמיתים לעבודה.\n\n\n CQ (-.-. --.-): קריאה כללית לכל המפעילים, מתורגמת כ&quot;קריאה אליכם&quot;.\n\n\n GM (--. --): &quot;בוקר טוב&quot;, GA (--. .-): &quot;צהריים טובים&quot;, GE (--. .): &quot;ערב טוב&quot;, GN (--. -.): &quot;לילה טוב&quot;.\n\n\n R (.-.): אות אישור שמשמעותו &quot;התקבל&quot; או &quot;הובן&quot;.\n\n\n PSE (.--. ... .): קיצור של &quot;בבקשה&quot;, משמש בבקשות מנומסות.\n\n\n אפילו רצפים יוצאי דופן כמו ..---...._, _ _.., או _. _. מפוענחים ללא דיחוי, מה שהופך כל שורת נקודות ומקפים לחלק משפה חיה.\n ▸ מקרי שימוש נפוצים כוללים:\n מורים שמסבירים מהו קוד מורס במהלך השיעור\n\n\n סטודנטים מתרגלים פרויקטים של מעבר מאנגלית לקוד מורס\n\n\n חובבים שעובדים עם מספרי קוד מורס בזמנם הפנוי\n\n\n היסטוריונים המציגים קוד SOS במורס כחלק מהתרבות\n\n\n יוצרים המשתמשים בכלי יצירת קוד מורס לעיצוב\n\n\n ההרחבה פועלת גם כמפענח קוד מורס. הדבק כל רצף, והתרגום לטקסט רגיל יופיע מיד. בין אם אתה בודק _. _ או רצפים ארוכים יותר כמו //, הכלי מציג את המשמעות בבירור. אין ניחושים, אין עיכובים, רק אינטראקציה חלקה. עבור לומדים רבים זו הופכת לדרך הפשוטה ביותר לאמן ולהמיר מורס לאנגלית בזמן אמת.\n 1️⃣ יתרונות במבט חטוף:\n מבוא קל לאלפבית מורס\n\n\n פענוח של no בקוד מורס וביטויים אחרים\n\n\n הזדמנות ללמוד אותיות קוד מורס במילים\n\n\n שילובים יצירתיים כמו // לניסויים\n\n\n סאונד מוסיף מימד נוסף. המתרגם יכול להשמיע את התבניות שאתם יוצרים. הוא גם מאפשר לכם לשנות את מהירות ההשמעה, כך שנקודות קצרות וקווים ארוכים יותר יתאימו לקצב שלכם. אתם יכולים להאט את הקצב לתרגול או להאיץ אותו למען ריאליזם. יש אפילו אפשרות לייצא אותות ולשמור אותם בקובץ WAV להאזנה מאוחרת יותר.\n ➤ מי יהנה מזה:\n סטודנטים חוקרים קוד SOS מורס כחלק מפרויקטים\n\n\n מורים מכינים איורים ברורים\n\n\n אוהדי רדיו מפענחים SOS בקוד מורס בשביל הכיף\n\n\n מעצבים בהשראת קצב האותות\n\n\n כל מי שרוצה לתרגם קוד מורס ללא מאמץ\n\n\n הפרטיות תמיד נשמרת. ההרחבה פועלת כולה בתוך הדפדפן, ללא שליחת מידע. הניסויים שלך עם קוד מורס זה לאימון אלפביתי או לעבודה יצירתית נשארים שלך בלבד.\n 2️⃣ שאלות נפוצות:\n האם מתרגם קוד מורס יכול להמיר לאנגלית באופן מיידי? כן, באופן מיידי.\n\n\n האם יש ממיר קוד מורס לאותיות ומספרים? כן, הכל מכוסה.\n\n\n האם זה מדמה מכונת קוד מורס? כן, באמצעות תכונת ההקשה.\n\n\n האם ניתן לכוונן את הצליל? כן, ניתן לשנות את המהירות, וניתן לייצא את השמעה כקובץ WAV.\n\n\n האם יש מחולל קוד מורס? כן, אתה יכול ליצור ולבדוק אותות משלך.\n\n\n האם ההרחבה מטפלת בדפוסים יוצאי דופן? כן, היא מפענחת אפילו רצפים נדירים.\n\n\n 3️⃣ סיבות להתקין היום:\n תרגול עם מקש הטלגרף במצב משלו\n\n\n מעבר בין קוד מורס לאלפבית ומילים שלמות\n\n\n חקור אותות כמו sos en code מורס ללא בלבול\n\n\n תהנו מעדכונים עם שפות ותכונות נוספות\n\n\n הסתמכו על מתרגם זה ככלי למידה יומיומי\n\n\n בסופו של דבר, מתרגם קוד מורס הוא יותר מסתם מתרגם. זוהי דרך להתחבר להיסטוריה תוך שימוש בכלים מודרניים.\n עיצוב מאת Aleh: stariyleg@gmail.com\n אייקון - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"סמלי קוד מורס\">סמלי קוד מורס שנוצרו על ידי Freepik - Flaticon</a>\n"
  }
}