{
  "appName": {
    "message": "Morse Kodu Çevirici"
  },
  "shortDesc": {
    "message": "Bu, Morse Kodu Çevirici – sesli ve metinli morse kodu oluşturucusudur. Morse kodu alfabesini öğrenin ve kendi dilinize çevirin."
  },
  "storeDesc": {
    "message": "Eğer Morse Kodu Çevirici'de yeni diller için destek istiyorsanız, geliştiriciye e-posta ile yazmanız yeterlidir. Kullanıcılardan gelen geri bildirimler, gelecekteki güncellemeleri yönlendirir ve fikirleriniz, bir sonraki neyin ortaya çıkacağını şekillendirebilir. Uzantı, zaten İngilizce, Rusça ve Uluslararası sinyallerle çalışıyor, ancak daha fazlası planlanıyor.\nMorse Kodu Çevirici, noktalar ve çizgilerle çevrimiçi çalışmak isteyen insanlar için doğrudan ve güvenilir bir yol sunmak üzere tasarlanmıştır. Araç, morse kodunu İngilizceye ve geri çevirmeyi basit hale getirir. Her şey tarayıcı içinde çalışır, arada sunucu yoktur, bu nedenle sonuçlar anında görünür ve özel kalır.\nEn pratik özelliklerden biri, her iki alanın gerçek zamanlı olarak senkronize edilmesidir. Düz metin yazdığınızda, sinyal alanı otomatik olarak güncellenir. Noktalar ve çizgilerle deseni yan tarafa yapıştırdığınızda veya girdiğinizde, metin alanı hemen yanıt verir. Uzantı her zaman her iki yönü de hizalı tutar.\nAyrıca bir telgraf anahtarı simülasyonu da vardır. Bu özel düğme, ritimleri elle vurmanıza olanak tanır. Mod ayrı olarak etkinleştirilebilir, klavyenizi veya farenizi basit bir giriş aracına dönüştürür. Her vurma bir desen oluşturur ve çeviri metin penceresinde hemen görünür. Tarayıcı için uyarlanmış tarihi bir makine kullanıyormuşsunuz gibi hissediyorsunuz.\nİnsanların bu çeviriciyi kurma nedenleri:\nEk yazılım olmadan çevrimiçi dönüşüm\n\n\nHer iki alan arasında otomatik senkronizasyon\n\n\nUygulama içinde net bir morse kodu alfabesi referansı\n\n\nSinyalleri vurmak için telgraf anahtarı modu\n\n\nDilleri ve özellikleri genişleten güncellemeler\n\n\nGünlük ifadeler, sinyaller aracılığıyla görüntülendiğinde daha eğlencelidir. \"Merhaba\"nın nasıl göründüğünü görmek için morse kodu çeviricisini kullanabilirsiniz ve hatta kısa selamlar bile eğlenceli bir ton alabilir. Bazı insanlar yaratıcı mesajlar için morse kodunda \"seni seviyorum\" ile denemeler yaparken, diğerleri acil durum pratiği için morse kodunda \"sos\" veya \"sos en code morse\" kontrol eder. Sistem, operatörlerin genellikle kısa kodlar ve kısaltmalar kullandığı radyo dünyasında uzun bir geleneğe sahiptir:\n73 (--... ...--): \"en iyi dilekler\" anlamına gelir ve bir teması nazikçe sonlandırmak için kullanılır.\n\n\n88 (---.. ---..): \"öpücükler\" anlamına gelir, genellikle arkadaşlar veya meslektaşlar arasında paylaşılır.\n\n\nCQ (-.-. --.-): tüm operatörlere genel bir çağrı, \"sana çağrı\" olarak çevrilir.\n\n\nGM (--. --): \"günaydın,\" GA (--. .-): \"iyi öğleden sonra,\" GE (--. .): \"iyi akşamlar,\" GN (--. -.): \"iyi geceler.\"\n\n\nR (.-.): \"alındı\" veya \"anlaşıldı\" anlamına gelen bir onay sinyali.\n\n\nPSE (.--. ... .): \"lütfen\" anlamına gelen kısaltma, nazik taleplerde kullanılır.\n\n\nAyrıca ..---...._, _ _.. veya _. _. gibi alışılmadık diziler de gecikmeden çözümlenir, her nokta ve çizgi satırı yaşayan bir dilin parçası haline gelir.\n▸ Yaygın kullanım durumları şunları içerir:\nDers sırasında morse kodunun ne olduğunu açıklayan öğretmenler\n\n\nMorse kodu projeleri üzerinde pratik yapan öğrenciler\n\n\nBoş zamanlarında morse kodu sayılarıyla çalışan hobi sahipleri\n\n\nKültürün bir parçası olarak morse kodunda sos kodunu gösteren tarihçiler\n\n\nTasarım için morse kodu oluşturma araçlarını kullanan yaratıcılar\n\n\nUzantı ayrıca bir morse kodu çözücü olarak da çalışır. Herhangi bir diziyi yapıştırın ve düz metne çeviri hemen görünür. İster _. _ ister // gibi daha uzun dizileri test edin, araç anlamı net bir şekilde gösterir. Tahmin yok, gecikme yok, sadece akıcı etkileşim. Birçok öğrenici için bu, morse kodunu İngilizceye gerçek zamanlı olarak dönüştürmenin en basit yolu haline gelir.\n1️⃣ Avantajlar bir bakışta:\nMorse alfabesine kolay giriş\n\n\nMorse kodunda \"hayır\" ve diğer ifadelerin çözülmesi\n\n\nKelimelerde morse kodu harflerini inceleme fırsatı\n\n\nDenemeler için yaratıcı kombinasyonlar gibi //\n\n\nSes başka bir boyut ekler. Çevirici, oluşturduğunuz desenleri çalabilir. Ayrıca çalma hızını değiştirmenize olanak tanır, böylece kısa noktalar ve daha uzun çizgiler sizin hızınıza uyum sağlar. Pratik için yavaşlatabilir veya gerçekçilik için hızlandırabilirsiniz. Ayrıca sinyalleri dışa aktarma ve daha sonra dinlemek için WAV dosyasında kaydetme seçeneği bile vardır.\n➤ Kimler keyif alacak:\nProjelerin bir parçası olarak morse kodunu keşfeden öğrenciler\n\n\nAçık illüstrasyonlar hazırlayan öğretmenler\n\n\nEğlence için morse kodunu çözen radyo hayranları\n\n\nSinyallerin ritminden ilham alan tasarımcılar\n\n\nMorse kodunu zahmetsizce çevirmek isteyen herkes\n\n\nGizlilik her zaman saygı görür. Uzantı tamamen tarayıcı içinde çalışır, hiçbir bilgi dışarı gönderilmez. Bu morse kodu ile alfabeyi eğitme veya yaratıcı çalışma deneyimleriniz yalnızca size aittir.\n2️⃣ SSS:\nMorse Kodu Çevirici hemen İngilizceye çevirebilir mi? Evet, anında.\n\n\nHarfler ve sayılar için bir morse kodu çevirici var mı? Evet, her şey kapsanmıştır.\n\n\nBir morse kodu makinesini simüle ediyor mu? Evet, vurma özelliği aracılığıyla.\n\n\nSesi ayarlayabilir miyim? Evet, hız değiştirilebilir ve çalma WAV olarak dışa aktarılabilir.\n\n\nBir morse kodu oluşturucu dahil mi? Evet, kendi sinyallerinizi oluşturabilir ve test edebilirsiniz.\n\n\nUzun dizileri işleyebiliyor mu? Evet, nadir dizileri bile çözümler.\n\n\n3️⃣ Bugün kurmak için nedenler:\nKendi modunda telgraf anahtarı ile pratik yapın\n\n\nAlfabeyi ve tam kelimeleri morse kodu arasında geçiş yapın\n\n\nSos en code morse gibi sinyalleri karışıklık olmadan keşfedin\n\n\nDaha fazla dil ve özellik ile güncellemelerin tadını çıkarın\n\n\nBu çeviriciye günlük bir öğrenme aracı olarak güvenin\n\n\nSonuç olarak, Morse Kodu Çevirici sadece bir çevirici değildir. Modern araçlar kullanırken tarihle bağlantı kurmanın bir yoludur.\nTasarım: Aleh: stariyleg@gmail.com\nSimge - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"morse code icons\">Morse kodu simgeleri Freepik - Flaticon tarafından oluşturulmuştur</a>"
  }
}