{
  "appName": {
    "message": "Переводчик Морзе"
  },
  "shortDesc": {
    "message": "Это Переводчик Морзе – генератор морзянки со звуком и текстом. Изучите алфавит морзе и переводите на ваш язык."
  },
  "storeDesc": {
    "message": "Если вы хотите поддержку новых языков в Переводчике Морзе, просто напишите разработчику по электронной почте. Обратная связь от пользователей направляет будущие обновления, и ваши идеи могут сформировать то, что появится дальше. Расширение уже работает с английским, русским и международными сигналами, но планируется добавить больше языков.\n\nПереводчик Морзе предназначен для людей, которые хотят прямой и надежный способ работы с точками и тире онлайн. Инструмент упрощает перевод кода Морзе на английский и обратно. Все работает внутри браузера, без серверов между ними, поэтому результаты появляются мгновенно и остаются конфиденциальными.\n\nОдной из самых практичных функций является то, что оба поля синхронизированы в реальном времени. Когда вы вводите обычный текст, поле сигнала обновляется автоматически. Когда вы вставляете или вводите точки и тире в сторону шаблона, текстовое поле реагирует мгновенно. Расширение всегда поддерживает согласованность в обоих направлениях.\n\nТакже есть симуляция телеграфного ключа. Эта специальная кнопка позволяет вам вручную задавать ритмы. Режим можно активировать отдельно, превращая вашу клавиатуру или мышь в простой инструмент ввода. Каждое нажатие генерирует шаблон, и перевод появляется в текстовом окне сразу. Это ощущается почти как использование исторической машины, адаптированной для браузера.\n\nПочему люди устанавливают этот переводчик:\nОнлайн-конвертация без дополнительного программного обеспечения\n\nАвтоматическая синхронизация между обоими полями\n\nЯсная справка по алфавиту кода Морзе внутри приложения\n\nРежим телеграфного ключа для передачи сигналов\n\nОбновления, которые расширяют языки и функции\n\nЕжедневные фразы становятся более увлекательными, когда их рассматривают через сигналы. Вы можете использовать конвертер кода Морзе, чтобы увидеть, как выглядит \"привет\", и даже короткие приветствия могут приобрести игривый тон. Некоторые люди экспериментируют с \"я тебя люблю\" на коде Морзе для креативных сообщений, в то время как другие проверяют \"сос\" на коде Морзе или \"сос\" на коде Морзе для практики в экстренных ситуациях. Система имеет долгую традицию в радиомире, где операторы часто используют короткие коды и аббревиатуры:\n73 (--... ...--): означает \"наилучшие пожелания\" и используется для вежливого завершения контакта.\n\n88 (---.. ---..): означает \"поцелуи\", часто передаваемые между друзьями или коллегами.\n\nCQ (-.-. --.-): общий вызов всем операторам, переводится как \"вызов к вам\".\n\nGM (--. --): \"доброе утро\", GA (--. .-): \"добрый день\", GE (--. .): \"добрый вечер\", GN (--. -.): \"спокойной ночи\".\n\nR (.-.): сигнал подтверждения, означающий \"получено\" или \"понято\".\n\nPSE (.--. ... .): сокращение от \"пожалуйста\", используется в вежливых запросах.\n\nДаже необычные последовательности, такие как ..---...._, _ _.. или _. _. декодируются без задержек, делая каждую строку точек и тире частью живого языка.\n▸ Общие случаи использования включают:\nУчителей, которые объясняют, что такое код Морзе на уроках\n\nСтудентов, практикующих проекты по переводу английского в код Морзе\n\nЛюбителей, работающих с числами кода Морзе в свободное время\n\nИсториков, показывающих код \"сос\" на Морзе как часть культуры\n\nСоздателей, использующих инструменты для создания кода Морзе для дизайна\n\nРасширение также работает как декодер кода Морзе. Вставьте любую последовательность, и перевод в обычный текст появится сразу. Независимо от того, тестируете ли вы _. _ или более длинные последовательности, такие как //, инструмент четко показывает значение. Никаких догадок, никаких задержек, только плавное взаимодействие. Для многих учащихся это становится самым простым способом тренироваться и переводить код Морзе на английский в реальном времени.\n\n1️⃣ Преимущества на первый взгляд:\nЛегкое введение в алфавит Морзе\n\nДекодирование \"нет\" в коде Морзе и других фраз\n\nВозможность изучать буквы кода Морзе в словах\n\nКреативные комбинации, такие как // для экспериментов\n\nЗвук добавляет еще одно измерение. Переводчик может воспроизводить шаблоны, которые вы создаете. Он также позволяет изменять скорость воспроизведения, чтобы короткие точки и длинные тире соответствовали вашему темпу. Вы можете замедлить его для практики или ускорить для реализма. Есть даже возможность экспортировать сигналы и сохранить их в WAV-файле для последующего прослушивания.\n\n➤ Кто это оценит:\nСтуденты, исследующие код \"сос\" на Морзе как часть проектов\n\nУчителя, готовящие ясные иллюстрации\n\nЛюбители радио, декодирующие \"сос\" на коде Морзе для удовольствия\n\nДизайнеры, вдохновленные ритмом сигналов\n\nВсе, кто хочет переводить код Морзе без усилий\n\nКонфиденциальность всегда соблюдается. Расширение полностью работает внутри браузера, без отправки информации. Ваши эксперименты с этим кодом Морзе для обучения алфавиту или креативной работы остаются только вашими.\n\n2️⃣ Часто задаваемые вопросы:\nМожет ли Переводчик Морзе сразу перевести на английский? Да, мгновенно.\n\nСуществует ли конвертер кода Морзе для букв и цифр? Да, все охвачено.\n\nСимулирует ли он машину кода Морзе? Да, через функцию нажатия.\n\nМогу ли я настроить звук? Да, скорость можно изменить, а воспроизведение можно экспортировать как WAV.\n\nВключен ли генератор кода Морзе? Да, вы можете создавать и тестировать свои собственные сигналы.\n\nОбрабатывает ли расширение необычные шаблоны? Да, оно декодирует даже редкие последовательности.\n\n3️⃣ Причины установить сегодня:\nПрактика с телеграфным ключом в собственном режиме\n\nПереключение между кодом Морзе для алфавита и полными словами\n\nИзучение сигналов, таких как \"сос\" на коде Морзе, без путаницы\n\nНаслаждайтесь обновлениями с новыми языками и функциями\n\nПолагайтесь на этот переводчик как на ежедневный инструмент обучения\n\nВ конце концов, Переводчик Морзе — это больше, чем просто переводчик. Это способ связаться с историей, используя современные инструменты.\nДизайн от Алеха: stariyleg@gmail.com\nИконка - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"morse code icons\">Иконки кода Морзе созданы Freepik - Flaticon</a>"
  }
}