{
  "appName": {
    "message": "Морзов код преводач"
  },
  "shortDesc": {
    "message": "Това е Морзов код преводач – генератор на морзов код със звук и текст. Научете азбуката на морзовия код и преведете на вашия език."
  },
  "storeDesc": {
    "message": "Ако искате поддръжка за нови езици в Морзов код преводач, просто пишете на разработчика по имейл. Обратната връзка от потребителите ръководи бъдещите актуализации, а вашите идеи могат да оформят това, което ще се появи следващо. Разширението вече работи с английски, руски и международни сигнали, но са планирани и още.\n\nМорзов код преводач е проектиран за хора, които искат директен и надежден начин да работят с точки и тирета онлайн. Инструментът улеснява превода на морзов код на английски и обратно. Всичко работи в браузъра, без сървъри между тях, така че резултатите се появяват мигновено и остават частни.\n\nЕдна от най-практичните функции е, че и двете полета са синхронизирани в реално време. Когато напишете обикновен текст, полето за сигнали се актуализира автоматично. Когато поставите или въведете точки и тирета в страната на модела, текстовото поле реагира незабавно. Разширението винаги поддържа двете посоки синхронизирани.\n\nИма и симулация на телеграфен ключ. Този специален бутон ви позволява да натискате ритми на ръка. Режимът може да бъде активиран отделно, превръщайки клавиатурата или мишката ви в прост инструмент за въвеждане. Всяко натискане генерира модел, а преводът се появява в текстовия прозорец веднага. Чувства се почти като използване на историческа машина, адаптирана за браузъра.\n\nЗащо хората инсталират този преводач:\nОнлайн конверсия без допълнителен софтуер\n\nАвтоматична синхронизация между двете полета\n\nЯсна справка за азбуката на морзовия код в приложението\n\nРежим на телеграфен ключ за натискане на сигнали\n\nАктуализации, които разширяват езиците и функциите\n\nДневните фрази са по-забавни, когато се гледат през сигнали. Можете да използвате конвертора на морзов код, за да видите как изглежда \"здравей\", а дори и кратките поздрави могат да придобият игрив тон. Някои хора експериментират с \"обичам те\" на морзов код за креативни съобщения, докато други проверяват \"сос\" на морзов код или \"сос\" на код морз за практическа подготовка. Системата има дълга традиция в радиосвета, където операторите често използват кратки кодове и съкращения:\n73 (--... ...--): означава \"най-добри пожелания\" и се използва за учтиво приключване на контакт.\n\n88 (---.. ---..): означава \"целувки\", често споделяни между приятели или колеги.\n\nCQ (-.-. --.-): общо обаждане до всички оператори, преведено като \"обаждане до вас\".\n\nGM (--. --): \"добро утро\", GA (--. .-): \"добър следобед\", GE (--. .): \"добър вечер\", GN (--. -.): \"лека нощ\".\n\nR (.-.): сигнал за потвърждение, означаващ \"получено\" или \"разбрано\".\n\nPSE (.--. ... .): кратко за \"моля\", използвано в учтиви искания.\n\nДори необичайни последователности като ..---...._, _ _.., или _. _. се декодират без забавяне, правейки всяка линия от точки и тирета част от жив език.\n▸ Чести случаи на употреба включват:\nУчители, които обясняват какво е морзов код по време на час\n\nСтуденти, практикуващи проекти от английски на морзов код\n\nХобисти, работещи с морзови кодове в свободното си време\n\nИсторици, показващи код \"сос\" на морзов код като част от културата\n\nСъздатели, използващи инструменти за създаване на морзов код за дизайн\n\nРазширението също работи като декодер на морзов код. Поставете всяка последователност и преводът на обикновен текст се появява веднага. Независимо дали тествате _. _ или по-дълги последователности като //, инструментът ясно показва значението. Няма предположения, няма забавяния, само гладка интеракция. За много ученици това става най-простият начин да тренират и да конвертират морзов код на английски в реално време.\n1️⃣ Ползи в кратце:\nЛесно въвеждане в морзовата азбука\n\nДекодиране на \"не\" на морзов код и други фрази\n\nВъзможност за изучаване на букви от морзов код в думи\n\nКреативни комбинации като // за експерименти\n\nЗвукът добавя още едно измерение. Преводачът може да възпроизвежда моделите, които създавате. Той също така ви позволява да променяте скоростта на възпроизвеждане, така че кратките точки и по-дългите тирета да съответстват на вашето темпо. Можете да го забавите за практика или да го ускорите за реализъм. Има дори опция за експортиране на сигнали и запазването им в WAV файл за по-късно слушане.\n➤ Кой ще се радва на това:\nСтуденти, изследващи код \"сос\" на морзов код като част от проекти\n\nУчители, подготвящи ясни илюстрации\n\nФенове на радиото, декодиращи \"сос\" на код морз за забавление\n\nДизайнери, вдъхновени от ритъма на сигналите\n\nВсеки, който иска да превежда морзов код без усилие\n\nЧастността винаги се уважава. Разширението работи напълно в браузъра, без информация да се изпраща навън. Вашите експерименти с този морзов код за обучение на азбука или креативна работа остават само ваши.\n\n2️⃣ Често задавани въпроси:\nМоже ли Морзов код преводач да конвертира на английски веднага? Да, мигновено.\n\nИма ли конвертор на морзов код за букви и числа? Да, всичко е покрито.\n\nИмитира ли машина за морзов код? Да, чрез функцията за натискане.\n\nМога ли да регулирам звука? Да, скоростта може да се променя, а възпроизвеждането може да се експортира като WAV.\n\nИма ли включен генератор на морзов код? Да, можете да създавате и тествате свои собствени сигнали.\n\nСправя ли се разширението с необичайни модели? Да, декодира дори редки последователности.\n\n3️⃣ Причини да инсталирате днес:\nПрактикувайте с телеграфния ключ в собствен режим\n\nПревключвайте между морзов код за азбука и цели думи\n\nИзследвайте сигнали като \"сос\" на код морз без объркване\n\nНаслаждавайте се на актуализации с повече езици и функции\n\nРазчитайте на този преводач като на ежедневен инструмент за учене\n\nВ крайна сметка, Морзов код преводач е повече от преводач. Това е начин да се свържете с историята, използвайки съвременни инструменти.\nДизайн от Алех: stariyleg@gmail.com\nИкона - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"morse code icons\">Иконите на морзов код са създадени от Freepik - Flaticon</a>"
  }
}