{
  "appName": {
    "message": "Traductor de Codi Morse"
  },
  "shortDesc": {
    "message": "Això és Traductor de Codi Morse – generador de codi morse amb so i text. Aprèn l'alfabet de codi morse i tradueix a la teva llengua."
  },
  "storeDesc": {
    "message": "Si voleu suport per a nous idiomes en Traductor de Codi Morse, només cal que escriviu al desenvolupador per correu electrònic. Els comentaris dels usuaris guien les futures actualitzacions, i les vostres idees poden modelar el que apareixerà a continuació. L'extensió ja funciona amb anglès, rus i senyals internacionals, però n'hi ha més de planificades.  \nTraductor de Codi Morse està dissenyat per a persones que volen una manera directa i fiable de treballar amb punts i guions en línia. L'eina fa que sigui senzill traduir codi morse a anglès i viceversa. Tot funciona dins del navegador, sense servidors pel mig, així que els resultats apareixen instantàniament i es mantenen privats.  \nUna de les característiques més pràctiques és que ambdós camps estan sincronitzats en temps real. Quan escriviu text pla, el camp de senyal s'actualitza automàticament. Quan enganxeu o introduïu punts i guions al costat del patró, el camp de text respon immediatament. L'extensió sempre manté ambdues direccions alineades.  \nTambé hi ha una simulació de clau de telègraf. Aquest botó especial us permet tocar ritmes a mà. El mode es pot activar per separat, convertint el vostre teclat o ratolí en una eina d'entrada senzilla. Cada toc genera un patró, i la traducció apareix a la finestra de text de seguida. Sembla gairebé com utilitzar una màquina històrica adaptada per al navegador.  \nPer què la gent instal·la aquest traductor:  \nConversió en línia sense programari addicional  \n\nSincronització automàtica entre ambdós camps  \n\nUna referència clara de l'alfabet de codi morse dins de l'aplicació  \n\nMode de clau de telègraf per tocar senyals  \n\nActualitzacions que amplien idiomes i característiques  \n\nLes frases diàries són més divertides quan es veuen a través de senyals. Podeu utilitzar el conversor de codi morse per veure com es veu \"hola\", i fins i tot salutacions curtes poden adoptar un to juganer. Algunes persones experimenten amb \"t'estimo\" en codi morse per a missatges creatius, mentre que altres comproven \"sos\" en codi morse o \"sos en codi morse\" per a pràctica d'emergència. El sistema té una llarga tradició en el món de la ràdio, on els operadors sovint utilitzen codis curts i abreviatures:  \n73 (--... ...--): significa \"millors desitjos\" i s'utilitza per acabar un contacte de manera educada.  \n\n88 (---.. ---..): representa \"petons\", sovint compartits entre amics o companys.  \n\nCQ (-.-. --.-): una crida general a tots els operadors, traduïda com \"crida a tu\".  \n\nGM (--. --): \"bon dia\", GA (--. .-): \"bona tarda\", GE (--. .): \"bona nit\", GN (--. -.): \"bona nit\".  \n\nR (.-.): un senyal de confirmació que significa \"rebut\" o \"entès\".  \n\nPSE (.--. ... .): abreviatura de \"si us plau\", utilitzada en sol·licituds educades.  \n\nFins i tot seqüències inusuals com ..---...._, _ _.., o _. _. es decodifiquen sense retard, fent que cada línia de punts i guions sigui part d'un llenguatge viu.  \n▸ Casos d'ús comuns inclouen:  \nProfessors que expliquen què és el codi morse durant la classe  \n\nEstudiants practicant projectes de codi morse a anglès  \n\nAficionats treballant amb números de codi morse en el seu temps lliure  \n\nHistoriadors mostrant codi sos en morse com a part de la cultura  \n\nCreadors utilitzant eines de creació de codi morse per al disseny  \n\nL'extensió també funciona com a decodificador de codi morse. Enganxeu qualsevol seqüència, i la traducció a text pla apareix de seguida. Tant si proveu _. _ com seqüències més llargues com //, l'eina mostra el significat clarament. Sense endevinalles, sense retards, només interacció fluida. Per a molts aprenents, això es converteix en la manera més senzilla d'entrenar i de convertir codi morse a anglès en temps real.  \n1️⃣ Beneficis a primera vista:  \nIntroducció fàcil a l'alfabet morse  \n\nDecodificació de \"no\" en codi morse i altres frases  \n\nUna oportunitat per estudiar les lletres del codi morse en paraules  \n\nCombinacions creatives com // per a experiments  \n\nEl so afegeix una altra dimensió. El traductor pot reproduir els patrons que creeu. També us permet canviar la velocitat de reproducció, de manera que els punts curts i els guions més llargs s'adaptin al vostre ritme. Podeu reduir la velocitat per practicar o augmentar-la per a realisme. Hi ha fins i tot una opció per exportar senyals i desar-los en un fitxer WAV per a escoltar més tard.  \n➤ Qui ho gaudirà:  \nEstudiants explorant el codi sos morse com a part de projectes  \n\nProfessors preparant il·lustracions clares  \n\nFans de la ràdio decodificant \"sos en codi morse\" per diversió  \n\nDissenyadors inspirats pel ritme dels senyals  \n\nQualsevol que vulgui traduir codi morse sense esforç  \n\nLa privadesa sempre es respecta. L'extensió funciona completament dins del navegador, sense informació enviada enlloc. Els vostres experiments amb aquest codi morse per a l'entrenament de l'alfabet o treball creatiu romanen només vostres.  \n2️⃣ FAQ:  \nPot Traductor de Codi Morse convertir a anglès de seguida? Sí, instantàniament.  \n\nHi ha un conversor de codi morse per a lletres i números? Sí, tot està cobert.  \n\nSimula una màquina de codi morse? Sí, a través de la funció de toc.  \n\nPuc ajustar el so? Sí, la velocitat es pot canviar, i la reproducció es pot exportar com a WAV.  \n\nHi ha un generador de codi morse inclòs? Sí, podeu crear i provar els vostres propis senyals.  \n\nL'extensió gestiona patrons inusuals? Sí, decodifica fins i tot seqüències rares.  \n3️⃣ Raons per instal·lar avui:  \nPractiqueu amb la clau de telègraf en el seu propi mode  \n\nCanvieu entre codi morse per a l'alfabet i paraules completes  \n\nExploreu senyals com \"sos en codi morse\" sense confusió  \n\nGaudiu d'actualitzacions amb més idiomes i característiques  \n\nConfieu en aquest traductor com a eina d'aprenentatge diària  \n\nAl final, Traductor de Codi Morse és més que un traductor. És una manera de connectar amb la història mentre utilitzeu eines modernes.  \nDisseny per Aleh: stariyleg@gmail.com  \nIcona - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"icones de codi morse\">Icònes de codi morse creades per Freepik - Flaticon</a>"
  }
}