{
  "appName": {
    "message": "Morse Code Vertaler"
  },
  "shortDesc": {
    "message": "Dit is de Morse Code Vertaler – morsecodegenerator met geluid en tekst. Leer het morsecodealfabet en vertaal naar jouw taal."
  },
  "storeDesc": {
    "message": "Als je ondersteuning wilt voor nieuwe talen in de Morse Code Vertaler, schrijf dan gewoon een e-mail naar de ontwikkelaar. Feedback van gebruikers leidt toekomstige updates, en jouw ideeën kunnen bepalen wat er als volgende zal verschijnen. De extensie werkt al met Engels, Russisch en internationale signalen, maar er zijn meer gepland.\n\nMorse Code Vertaler is ontworpen voor mensen die een directe en betrouwbare manier willen om online met punten en streepjes te werken. De tool maakt het eenvoudig om morsecode naar het Engels te vertalen en weer terug. Alles draait in de browser, zonder servers ertussen, zodat resultaten onmiddellijk verschijnen en privé blijven.\n\nEen van de meest praktische functies is dat beide velden in realtime zijn gesynchroniseerd. Wanneer je gewone tekst typt, wordt het signaalveld automatisch bijgewerkt. Wanneer je punten en streepjes in het patroonveld plakt of invoert, reageert het tekstveld onmiddellijk. De extensie houdt altijd beide richtingen op elkaar afgestemd.\n\nEr is ook een simulatie van een telegraafsleutel. Deze speciale knop laat je ritmes met de hand tikken. De modus kan apart worden geactiveerd, waardoor je toetsenbord of muis een eenvoudig invoertool wordt. Elke tik genereert een patroon, en de vertaling verschijnt onmiddellijk in het tekstvenster. Het voelt bijna alsof je een historische machine gebruikt die is aangepast voor de browser.\n\nWaarom mensen deze vertaler installeren:\nOnline conversie zonder extra software\n\nAutomatische synchronisatie tussen beide velden\n\nEen duidelijke morsecode alfabetreferentie binnen de app\n\nTelegraafsleutelmodus voor het tikken van signalen\n\nUpdates die talen en functies uitbreiden\n\nDagelijkse zinnen zijn leuker wanneer ze door signalen worden bekeken. Je kunt de morsecodeconverter gebruiken om te zien hoe “hallo” eruitziet, en zelfs korte begroetingen kunnen een speelse toon krijgen. Sommige mensen experimenteren met ik hou van jou in morsecode voor creatieve berichten, terwijl anderen sos in morsecode of sos en code morse controleren voor noodtraining. Het systeem heeft een lange traditie in de radiowereld, waar operators vaak korte codes en afkortingen gebruiken:\n73 (--... ...--): betekent “beste wensen” en wordt gebruikt om een contact beleefd te beëindigen.\n\n88 (---.. ---..): staat voor “kussen,” vaak gedeeld tussen vrienden of collega's.\n\nCQ (-.-. --.-): een algemene oproep aan alle operators, vertaald als “oproep aan jou.”\n\nGM (--. --): “goedemorgen,” GA (--. .-): “goedemiddag,” GE (--. .): “goedenavond,” GN (--. -.): “goedenacht.”\n\nR (.-.): een bevestigingssignaal dat “ontvangen” of “begrepen” betekent.\n\nPSE (.--. ... .): kort voor “alsjeblieft,” gebruikt in beleefde verzoeken.\n\nZelfs ongebruikelijke sequenties zoals ..---...._, _ _.., of _. _. worden zonder vertraging gedecodeerd, waardoor elke regel van punten en streepjes deel uitmaakt van een levende taal.\n▸ Veelvoorkomende gebruikssituaties zijn onder andere:\nDocenten die uitleggen wat morsecode is tijdens de les\n\nStudenten die oefenen met Engelse naar morsecode projecten\n\nHobbyisten die in hun vrije tijd met morsecode nummers werken\n\nHistorici die sos-code in morse tonen als onderdeel van de cultuur\n\nCreators die morsecode-creator-tools gebruiken voor ontwerp\n\nDe extensie werkt ook als een morsecode-decoder. Plak een willekeurige sequentie, en de vertaling naar gewone tekst verschijnt onmiddellijk. Of je nu _. _ of langere sequenties zoals // test, de tool toont de betekenis duidelijk. Geen giswerk, geen vertragingen, alleen een soepele interactie. Voor veel leerlingen wordt dit de eenvoudigste manier om te trainen en morse naar het Engels in realtime te converteren.\n\n1️⃣ Voordelen in een oogopslag:\nEenvoudige introductie tot het morsealfabet\n\nDecodering van nee in morsecode en andere zinnen\n\nEen kans om morsecodeletters in woorden te bestuderen\n\nCreatieve combinaties zoals // voor experimenten\n\nGeluid voegt een andere dimensie toe. De vertaler kan de patronen die je maakt afspelen. Het stelt je ook in staat om de afspeelsnelheid te veranderen, zodat korte punten en langere streepjes overeenkomen met jouw tempo. Je kunt het vertragen voor oefening of versnellen voor realisme. Er is zelfs een optie om signalen te exporteren en ze op te slaan in een WAV-bestand voor later luisteren.\n\n➤ Wie zal ervan genieten:\nStudenten die code sos morse verkennen als onderdeel van projecten\n\nDocenten die duidelijke illustraties voorbereiden\n\nRadiofans die sos en code morse decoderen voor plezier\n\nOntwerpers geïnspireerd door het ritme van de signalen\n\nIedereen die morsecode zonder moeite wil vertalen\n\nPrivacy wordt altijd gerespecteerd. De extensie draait volledig in de browser, zonder dat informatie wordt verzonden. Jouw experimenten met deze morsecode voor alfabettraining of creatieve werkzaamheden blijven alleen van jou.\n\n2️⃣ FAQ:\nKan de Morse Code Vertaler direct naar het Engels converteren? Ja, onmiddellijk.\n\nIs er een morsecodeconverter voor letters en cijfers? Ja, alles is gedekt.\n\nSimuleert het een morsecode-machine? Ja, via de tikfunctie.\n\nKan ik geluid aanpassen? Ja, de snelheid kan worden veranderd en de afspeelkwaliteit kan als WAV worden geëxporteerd.\n\nIs er een morsecodegenerator inbegrepen? Ja, je kunt je eigen signalen maken en testen.\n\nBehandelt de extensie ongebruikelijke patronen? Ja, het decodeert zelfs zeldzame sequenties.\n\n3️⃣ Redenen om vandaag nog te installeren:\nOefen met de telegraafsleutel in zijn eigen modus\n\nSchakel tussen morsecode voor alfabet en volledige woorden\n\nVerken signalen zoals sos en code morse zonder verwarring\n\nGeniet van updates met meer talen en functies\n\nVertrouw op deze vertaler als een dagelijks leermiddel\n\nUiteindelijk is de Morse Code Vertaler meer dan een vertaler. Het is een manier om verbinding te maken met de geschiedenis terwijl je moderne tools gebruikt.\nOntwerp door Aleh: stariyleg@gmail.com\nPictogram - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"morse code icons\">Morse code-iconen gemaakt door Freepik - Flaticon</a>"
  }
}