{
  "appName": {
    "message": "Traducător de cod Morse"
  },
  "shortDesc": {
    "message": "Acesta este Traducător de cod Morse – generator de cod morse cu sunet și text. Învață alfabetul codului Morse și traduce în limba ta."
  },
  "storeDesc": {
    "message": "Dacă doriți suport pentru noi limbi în Traducător de cod Morse, scrieți pur și simplu dezvoltatorului prin e-mail. Feedback-ul utilizatorilor ghidează actualizările viitoare, iar ideile dumneavoastră pot modela ceea ce va apărea în continuare. Extensia funcționează deja cu semnale în engleză, rusă și internaționale, dar sunt planificate și altele.\n\nTraducător de cod Morse este conceput pentru persoanele care doresc o modalitate directă și fiabilă de a lucra cu puncte și linii online. Instrumentul face simplu să traduci codul Morse în engleză și înapoi. Totul se desfășoară în interiorul browserului, fără servere intermediare, astfel încât rezultatele apar instantaneu și rămân private.\n\nUna dintre cele mai practice caracteristici este că ambele câmpuri sunt sincronizate în timp real. Când tastați text simplu, câmpul de semnal se actualizează automat. Când lipiți sau introduceți puncte și linii în partea de model, câmpul de text răspunde imediat. Extensia menține întotdeauna ambele direcții aliniate.\n\nExistă, de asemenea, o simulare a cheii de telegraf. Acest buton special vă permite să atingeți ritmuri manual. Modul poate fi activat separat, transformând tastatura sau mouse-ul într-un instrument simplu de introducere. Fiecare atingere generează un model, iar traducerea apare în fereastra de text imediat. Se simte aproape ca și cum ați folosi o mașină istorică adaptată pentru browser.\n\nDe ce oamenii instalează acest traducător:\nConversie online fără software suplimentar\n\nSincronizare automată între ambele câmpuri\n\nO referință clară a alfabetului codului Morse în aplicație\n\nModul de cheie de telegraf pentru atingerea semnalelor\n\nActualizări care extind limbile și caracteristicile\n\nFrazele zilnice sunt mai distractive atunci când sunt vizualizate prin semnale. Puteți folosi converterul de cod Morse pentru a vedea cum arată „salut”, iar chiar și saluturile scurte pot căpăta un ton jucăuș. Unii oameni experimentează cu „te iubesc” în cod Morse pentru mesaje creative, în timp ce alții verifică „sos” în cod Morse sau „sos en code morse” pentru practică de urgență. Sistemul are o lungă tradiție în lumea radio, unde operatorii folosesc adesea coduri scurte și abrevieri:\n73 (--... ...--): înseamnă „cele mai bune urări” și este folosit pentru a încheia un contact politicos.\n\n88 (---.. ---..): reprezintă „săruturi”, adesea împărtășite între prieteni sau colegi.\n\nCQ (-.-. --.-): un apel general către toți operatorii, tradus ca „apel către tine”.\n\nGM (--. --): „bună dimineața”, GA (--. .-): „bună după-amiaza”, GE (--. .): „bună seara”, GN (--. -.): „noapte bună”.\n\nR (.-.): un semnal de confirmare care înseamnă „primit” sau „înțeles”.\n\nPSE (.--. ... .): prescurtare pentru „te rog”, folosit în cereri politicos.\n\nChiar și secvențele neobișnuite, cum ar fi ..---...._, _ _.., sau _. _. sunt decodificate fără întârziere, făcând fiecare linie de puncte și linii parte dintr-o limbă vie.\n▸ Cazuri comune de utilizare includ:\nProfesorii care explică ce este codul Morse în timpul orei\n\nStudenții care practică proiecte de la engleză la cod Morse\n\nPasionații care lucrează cu numere în cod Morse în timpul liber\n\nIstoricii care arată codul sos în Morse ca parte a culturii\n\nCreatorii care folosesc instrumente de creare a codului Morse pentru design\n\nExtensia funcționează, de asemenea, ca un decodor de cod Morse. Lipiți orice secvență, iar traducerea în text simplu apare imediat. Indiferent dacă testați _. _ sau secvențe mai lungi, cum ar fi //, instrumentul arată clar semnificația. Fără ghiciri, fără întârzieri, doar interacțiune fluidă. Pentru mulți învățăcei, aceasta devine cea mai simplă modalitate de a se antrena și de a converti codul Morse în engleză în timp real.\n1️⃣ Beneficii pe scurt:\nIntroducere ușoară în alfabetul Morse\n\nDecodificarea „nu” în cod Morse și alte fraze\n\nO șansă de a studia literele codului Morse în cuvinte\n\nCombinări creative, cum ar fi // pentru experimente\n\nSunetul adaugă o altă dimensiune. Traducătorul poate reda modelele pe care le creați. De asemenea, vă permite să schimbați viteza de redare, astfel încât punctele scurte și liniile mai lungi să se potrivească cu ritmul dumneavoastră. Puteți încetini pentru practică sau accelera pentru realism. Există chiar și o opțiune de a exporta semnalele și de a le salva într-un fișier WAV pentru ascultare ulterioară.\n➤ Cine se va bucura de el:\nStudenți care explorează codul sos Morse ca parte a proiectelor\n\nProfesori care pregătesc ilustrații clare\n\nFani ai radio-ului care decodifică sos en code morse pentru distracție\n\nDesigneri inspirați de ritmul semnalelor\n\nOricine dorește să traducă codul Morse fără efort\n\nConfidențialitatea este întotdeauna respectată. Extensia funcționează complet în interiorul browserului, fără informații trimise în afară. Experimentele dumneavoastră cu acest cod Morse pentru antrenamentul alfabetului sau lucrări creative rămân doar ale dumneavoastră.\n2️⃣ Întrebări frecvente:\nPoate Traducător de cod Morse să convertească în engleză imediat? Da, instantaneu.\n\nExistă un converter de cod Morse pentru litere și numere? Da, totul este acoperit.\n\nSimulează o mașină de cod Morse? Da, prin funcția de atingere.\n\nPot ajusta sunetul? Da, viteza poate fi schimbată, iar redarea poate fi exportată ca WAV.\n\nExistă un generator de cod Morse inclus? Da, puteți crea și testa propriile semnale.\n\nSe ocupă extensia de modele neobișnuite? Da, decodifică chiar și secvențe rare.\n\n3️⃣ Motive pentru a instala astăzi:\nPracticați cu cheia de telegraf în modul său propriu\n\nComutați între codul Morse pentru alfabet și cuvinte complete\n\nExplorați semnale precum sos en code morse fără confuzie\n\nBucurați-vă de actualizări cu mai multe limbi și caracteristici\n\nBazați-vă pe acest traducător ca pe un instrument de învățare zilnic\n\nÎn cele din urmă, Traducător de cod Morse este mai mult decât un traducător. Este o modalitate de a vă conecta cu istoria folosind instrumente moderne.\nDesign de Aleh: stariyleg@gmail.com\nIconiță - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"morse code icons\">Iconițele codului Morse create de Freepik - Flaticon</a>"
  }
}