{
  "appName": {
    "message": "Translator kodu Morse'a"
  },
  "shortDesc": {
    "message": "To jest Translator kodu Morse'a – generator kodu Morse'a z dźwiękiem i tekstem. Naucz się alfabetu kodu Morse'a i przetłumacz na swój język."
  },
  "storeDesc": {
    "message": "Jeśli chcesz wsparcia dla nowych języków w Translatorze kodu Morse'a, po prostu napisz do dewelopera e-mailem. Opinie użytkowników kierują przyszłymi aktualizacjami, a Twoje pomysły mogą kształtować to, co pojawi się następnie. Rozszerzenie już działa z językiem angielskim, rosyjskim i sygnałami międzynarodowymi, ale planowane są kolejne.\n\nTranslator kodu Morse'a jest zaprojektowany dla osób, które chcą mieć bezpośredni i niezawodny sposób pracy z kropkami i kreskami online. Narzędzie ułatwia tłumaczenie kodu Morse'a na angielski i z powrotem. Wszystko działa w przeglądarce, bez serwerów pośredniczących, więc wyniki pojawiają się natychmiast i pozostają prywatne.\n\nJedną z najbardziej praktycznych funkcji jest to, że oba pola są synchronizowane w czasie rzeczywistym. Kiedy wpisujesz tekst zwykły, pole sygnału aktualizuje się automatycznie. Kiedy wklejasz lub wpisujesz kropki i kreski w sekcji wzoru, pole tekstowe reaguje natychmiast. Rozszerzenie zawsze utrzymuje oba kierunki w synchronizacji.\n\nJest również symulacja klucza telegraficznego. Ten specjalny przycisk pozwala na ręczne wtapianie rytmów. Tryb można aktywować osobno, przekształcając klawiaturę lub mysz w proste narzędzie wejściowe. Każde wtapienie generuje wzór, a tłumaczenie pojawia się w oknie tekstowym od razu. To prawie jak używanie historycznej maszyny dostosowanej do przeglądarki.\n\nDlaczego ludzie instalują ten translator:\nKonwersja online bez dodatkowego oprogramowania\n\nAutomatyczna synchronizacja między oboma polami\n\nJasna referencja alfabetu kodu Morse'a wewnątrz aplikacji\n\nTryb klucza telegraficznego do wtapiania sygnałów\n\nAktualizacje, które rozszerzają języki i funkcje\n\nCodzienne frazy są bardziej zabawne, gdy są oglądane przez pryzmat sygnałów. Możesz użyć konwertera kodu Morse'a, aby zobaczyć, jak wygląda „cześć”, a nawet krótkie powitania mogą nabrać zabawnego tonu. Niektórzy eksperymentują z „kocham cię” w kodzie Morse'a dla kreatywnych wiadomości, podczas gdy inni sprawdzają „sos” w kodzie Morse'a lub „sos en code morse” do praktyki w sytuacjach awaryjnych. System ma długą tradycję w świecie radia, gdzie operatorzy często używają krótkich kodów i skrótów:\n73 (--... ...--): oznacza „najlepsze życzenia” i jest używane do grzecznego zakończenia kontaktu.\n\n88 (---.. ---..): oznacza „buziaki”, często dzielone między przyjaciół lub kolegów.\n\nCQ (-.-. --.-): ogólne wezwanie do wszystkich operatorów, tłumaczone jako „wezwanie do ciebie”.\n\nGM (--. --): „dzień dobry”, GA (--. .-): „dobry wieczór”, GE (--. .): „dobry wieczór”, GN (--. -.): „dobranoc”.\n\nR (.-.): sygnał potwierdzający oznaczający „otrzymano” lub „zrozumiano”.\n\nPSE (.--. ... .): skrót od „proszę”, używany w grzecznych prośbach.\n\nNawet nietypowe sekwencje, takie jak ..---...._, _ _.., czy _. _. są dekodowane bez opóźnień, co sprawia, że każda linia kropek i kresek staje się częścią żywego języka.\n▸ Typowe przypadki użycia obejmują:\nNauczycieli, którzy wyjaśniają, czym jest kod Morse'a podczas lekcji\n\nUczniów ćwiczących projekty z angielskiego na kod Morse'a\n\nHobbystów pracujących z liczbami w kodzie Morse'a w wolnym czasie\n\nHistoryków pokazujących kod sos w Morse'ie jako część kultury\n\nTwórców korzystających z narzędzi do tworzenia kodu Morse'a w projektach\n\nRozszerzenie działa również jako dekoder kodu Morse'a. Wklej dowolną sekwencję, a tłumaczenie na tekst zwykły pojawia się natychmiast. Niezależnie od tego, czy testujesz _. _ czy dłuższe sekwencje, takie jak //, narzędzie wyraźnie pokazuje znaczenie. Żadnego zgadywania, żadnych opóźnień, tylko płynna interakcja. Dla wielu uczniów staje się to najprostszym sposobem na trening i konwersję kodu Morse'a na angielski w czasie rzeczywistym.\n\n1️⃣ Korzyści w skrócie:\nŁatwe wprowadzenie do alfabetu Morse'a\n\nDekodowanie „nie” w kodzie Morse'a i innych fraz\n\nSzansa na naukę liter kodu Morse'a w słowach\n\nKreatywne kombinacje, takie jak // do eksperymentów\n\nDźwięk dodaje kolejny wymiar. Translator może odtwarzać wzory, które tworzysz. Umożliwia również zmianę prędkości odtwarzania, aby krótkie kropki i dłuższe kreski pasowały do Twojego tempa. Możesz spowolnić to dla praktyki lub przyspieszyć dla realizmu. Istnieje nawet opcja eksportu sygnałów i zapisania ich w pliku WAV do późniejszego odsłuchania.\n\n➤ Kto się tym zainteresuje:\nUczniowie badający kod sos w Morse'ie jako część projektów\n\nNauczyciele przygotowujący jasne ilustracje\n\nFani radia dekodujący sos en code morse dla zabawy\n\nProjektanci inspirowani rytmem sygnałów\n\nKażdy, kto chce tłumaczyć kod Morse'a bez wysiłku\n\nPrywatność jest zawsze szanowana. Rozszerzenie działa całkowicie w przeglądarce, bez wysyłania informacji. Twoje eksperymenty z tym kodem Morse'a do nauki alfabetu lub pracy kreatywnej pozostają tylko Twoje.\n\n2️⃣ FAQ:\nCzy Translator kodu Morse'a może od razu przetłumaczyć na angielski? Tak, natychmiast.\n\nCzy istnieje konwerter kodu Morse'a dla liter i cyfr? Tak, wszystko jest objęte.\n\nCzy symuluje maszynę kodu Morse'a? Tak, poprzez funkcję wtapiania.\n\nCzy mogę dostosować dźwięk? Tak, prędkość można zmieniać, a odtwarzanie można eksportować jako WAV.\n\nCzy w zestawie jest generator kodu Morse'a? Tak, możesz tworzyć i testować własne sygnały.\n\nCzy rozszerzenie obsługuje nietypowe wzory? Tak, dekoduje nawet rzadkie sekwencje.\n\n3️⃣ Powody, aby zainstalować dzisiaj:\nĆwiczenie z kluczem telegraficznym w jego własnym trybie\n\nPrzełączanie między kodem Morse'a dla alfabetu a pełnymi słowami\n\nEksploracja sygnałów, takich jak sos en code morse, bez zamieszania\n\nCieszenie się aktualizacjami z większą liczbą języków i funkcji\n\nPoleganie na tym translatorze jako codziennym narzędziu do nauki\n\nNa koniec, Translator kodu Morse'a to więcej niż tylko translator. To sposób na połączenie z historią, korzystając z nowoczesnych narzędzi.\nProjekt autorstwa Aleh: stariyleg@gmail.com\nIkona - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"ikony kodu Morse'a\">Ikony kodu Morse'a stworzone przez Freepik - Flaticon</a>"
  }
}