{
  "appName": {
    "message": "Morse kodo vertėjas"
  },
  "shortDesc": {
    "message": "Tai yra Morse kodo vertėjas – morse kodo generatorius su garsu ir tekstu. Išmokite morse kodo abėcėlę ir versti į savo kalbą."
  },
  "storeDesc": {
    "message": "Jei norite, kad \"Morse kodo vertėjas\" palaikytų naujas kalbas, tiesiog parašykite kūrėjui el. paštu. Vartotojų atsiliepimai padeda formuoti būsimus atnaujinimus, o jūsų idėjos gali nulemti, kas pasirodys kitame etape. Papildinys jau veikia su anglų, rusų ir tarptautiniais signalais, tačiau planuojama daugiau.\n\n\"Morse kodo vertėjas\" sukurtas žmonėms, kurie nori tiesioginio ir patikimo būdo dirbti su taškais ir brūkšneliais internete. Įrankis leidžia lengvai versti morzės kodą į anglų kalbą ir atgal. Viskas vyksta naršyklėje, be serverių tarp, todėl rezultatai pasirodo iš karto ir išlieka privatūs.\n\nViena iš praktiškiausių funkcijų yra ta, kad abu laukai sinchronizuojami realiu laiku. Kai rašote paprastą tekstą, signalų laukas atnaujinamas automatiškai. Kai įklijuojate arba įvedate taškus ir brūkšnelius į modelio pusę, teksto laukas reaguoja iš karto. Papildinys visada išlaiko abu kryptis suderintas.\n\nTaip pat yra telegrafo klavišo simuliacija. Šis specialus mygtukas leidžia jums ranka tapyti ritmus. Režimą galima aktyvuoti atskirai, paverčiant jūsų klaviatūrą ar pelę į paprastą įvesties įrankį. Kiekvienas paspaudimas generuoja modelį, o vertimas pasirodo teksto lange iš karto. Tai jaučiasi beveik kaip naudojant istorinį aparatą, pritaikytą naršyklei.\n\nKodėl žmonės įdiegia šį vertėją:\nInterneto konversija be papildomos programinės įrangos\n\nAutomatinis sinchronizavimas tarp abiejų laukų\n\nAiškus morzės kodo abėcėlės šaltinis programoje\n\nTelegrafo klavišo režimas signalams tapyti\n\nAtnaujinimai, kurie plečia kalbas ir funkcijas\n\nKasdieninės frazės yra smagesnės, kai jas žiūrima per signalus. Galite naudoti morzės kodo konverterį, kad pamatytumėte, kaip atrodo „labas“, o net ir trumpi pasveikinimai gali įgauti žaismingą toną. Kai kurie žmonės eksperimentuoja su „aš tave myliu“ morzės kode kūrybiniams pranešimams, o kiti tikrina „sos“ morzės kode arba „sos“ en kode morse avarijos praktikai. Sistema turi ilgą tradiciją radijo pasaulyje, kur operatoriai dažnai naudoja trumpus kodus ir santrumpas:\n73 (--... ...--): reiškia „geriausi linkėjimai“ ir naudojama mandagiai užbaigti kontaktą.\n\n88 (---.. ---..): reiškia „bučiniai“, dažnai dalijami tarp draugų ar kolegų.\n\nCQ (-.-. --.-): bendras kvietimas visiems operatoriams, išverstas kaip „kvietimas jums“.\n\nGM (--. --): „labas rytas“, GA (--. .-): „labas popiet“, GE (--. .): „labas vakaras“, GN (--. -.): „labanakt“.\n\nR (.-.): patvirtinimo signalas, reiškiantis „gauta“ arba „suprasta“.\n\nPSE (.--. ... .): trumpinys „prašome“, naudojamas mandagiuose prašymuose.\n\nNet ir neįprasti sekos, tokie kaip ..---...._, _ _.., arba _. _. yra iššifruojami be delsimo, todėl kiekviena taškų ir brūkšnelių linija tampa gyvos kalbos dalimi.\n▸ Dažniausiai naudojami atvejai apima:\nMokytojai, kurie paaiškina, kas yra morzės kodas per pamokas\n\nStudentai, praktikuojantys anglų kalbą morzės kodo projektuose\n\nHobiškai dirbantys su morzės kodo numeriais laisvalaikiu\n\nIstorikai, rodantys sos kodą morzės kaip kultūros dalį\n\nKūrėjai, naudojantys morzės kodo kūrimo įrankius dizainui\n\nPapildinys taip pat veikia kaip morzės kodo dekoderis. Įklijuokite bet kokią seką, ir vertimas į paprastą tekstą pasirodo iš karto. Nesvarbu, ar bandote _. _ ar ilgesnes sekas, tokias kaip //, įrankis aiškiai rodo prasmę. Nėra spėliojimo, nėra delsimo, tik sklandi sąveika. Daugeliui besimokančiųjų tai tampa paprasčiausiu būdu treniruotis ir konvertuoti morzės kodą į anglų kalbą realiu laiku.\n\n1️⃣ Privalumai akimirksniu:\nLengvas įvadas į morzės abėcėlę\n\nIššifravimas „ne“ morzės kode ir kitų frazių\n\nGalimybė studijuoti morzės kodo raides žodžiuose\n\nKūrybiniai deriniai, tokie kaip // eksperimentams\n\nGarso pridėjimas suteikia dar vieną dimensiją. Vertėjas gali atkurti modelius, kuriuos sukuriate. Jis taip pat leidžia keisti atkūrimo greitį, todėl trumpi taškai ir ilgesni brūkšneliai atitinka jūsų tempą. Galite sulėtinti jį praktikai arba pagreitinti realistiškumui. Yra net galimybė eksportuoti signalus ir išsaugoti juos WAV faile vėlesniam klausymui.\n\n➤ Kas tai mėgausis:\nStudentai, tyrinėjantys sos morzės kodą kaip projekto dalį\n\nMokytojai, rengiantys aiškias iliustracijas\n\nRadijo mėgėjai, dekoduojantys sos en kode morse dėl pramogų\n\nDizaineriai, įkvėpti signalų ritmo\n\nBet kas, kas nori versti morzės kodą be pastangų\n\nPrivatumas visada gerbiamas. Papildinys veikia visiškai naršyklėje, be jokios informacijos siunčiamos. Jūsų eksperimentai su šiuo morzės kodu abėcėlės mokymui ar kūrybiniam darbui lieka tik jūsų.\n\n2️⃣ DUK:\nAr \"Morse kodo vertėjas\" gali iš karto konvertuoti į anglų kalbą? Taip, iš karto.\n\nAr yra morzės kodo konverteris raidėms ir skaičiams? Taip, viskas apima.\n\nAr jis simuliuoja morzės kodo mašiną? Taip, per tapymo funkciją.\n\nAr galiu reguliuoti garsą? Taip, greitį galima keisti, o atkūrimą galima eksportuoti kaip WAV.\n\nAr yra įtrauktas morzės kodo generatorius? Taip, galite kurti ir testuoti savo signalus.\n\nAr papildinys tvarko neįprastas sekas? Taip, jis iššifruoja net ir retos sekas.\n\n3️⃣ Priežastys įdiegti šiandien:\nPraktikuokite su telegrafo klavišu savo režimu\n\nPerjunkite tarp morzės kodo abėcėlės ir visų žodžių\n\nTyrinėkite signalus, tokius kaip sos en kode morse, be painiavos\n\nMėgaukitės atnaujinimais su daugiau kalbų ir funkcijų\n\nPasitikėkite šiuo vertėju kaip kasdieniu mokymosi įrankiu\n\nGaliausiai, \"Morse kodo vertėjas\" yra daugiau nei vertėjas. Tai būdas susisiekti su istorija naudojant modernius įrankius.  \nDizainas: Aleh: stariyleg@gmail.com  \nIkona - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"morse code icons\">Morse kodo ikonų sukūrė Freepik - Flaticon</a>"
  }
}