{
  "appName": {
    "message": "Traducteur de code Morse"
  },
  "shortDesc": {
    "message": "Ceci est le Traducteur de code Morse – générateur de code morse avec son et texte. Apprenez l'alphabet morse et traduisez-le dans votre langue."
  },
  "storeDesc": {
    "message": "Si vous souhaitez un support pour de nouvelles langues dans le Traducteur de code Morse, il vous suffit d'écrire à l développeur par e-mail. Les retours des utilisateurs guident les futures mises à jour, et vos idées peuvent façonner ce qui apparaîtra ensuite. L'extension fonctionne déjà avec l'anglais, le russe et les signaux internationaux, mais d'autres sont prévues.  \nLe Traducteur de code Morse est conçu pour les personnes qui souhaitent un moyen direct et fiable de travailler avec des points et des traits en ligne. L'outil facilite la traduction du code morse en anglais et vice versa. Tout fonctionne dans le navigateur, sans serveurs intermédiaires, donc les résultats apparaissent instantanément et restent privés.  \nL'une des fonctionnalités les plus pratiques est que les deux champs sont synchronisés en temps réel. Lorsque vous tapez du texte en clair, le champ des signaux se met à jour automatiquement. Lorsque vous collez ou entrez des points et des traits dans le côté motif, le champ de texte répond immédiatement. L'extension maintient toujours les deux directions alignées.  \nIl y a aussi une simulation de clé télégraphique. Ce bouton spécial vous permet de taper des rythmes à la main. Le mode peut être activé séparément, transformant votre clavier ou votre souris en un simple outil d'entrée. Chaque tapotement génère un motif, et la traduction apparaît dans la fenêtre de texte instantanément. On a presque l'impression d'utiliser une machine historique adaptée au navigateur.  \nPourquoi les gens installent ce traducteur :  \nConversion en ligne sans logiciel supplémentaire  \n\nSynchronisation automatique entre les deux champs  \n\nUne référence claire de l'alphabet morse à l'intérieur de l'application  \n\nMode clé télégraphique pour taper des signaux  \n\nMises à jour qui élargissent les langues et les fonctionnalités  \n\nLes phrases quotidiennes sont plus amusantes lorsqu'elles sont vues à travers des signaux. Vous pouvez utiliser le convertisseur de code morse pour voir à quoi ressemble \"bonjour\", et même de courtes salutations peuvent prendre un ton ludique. Certaines personnes expérimentent avec \"je t'aime\" en code morse pour des messages créatifs, tandis que d'autres vérifient \"sos\" en code morse ou \"sos en code morse\" pour un entraînement d'urgence. Le système a une longue tradition dans le monde de la radio, où les opérateurs utilisent souvent des codes courts et des abréviations :  \n73 (--... ...--): signifie \"meilleures salutations\" et est utilisé pour terminer un contact poliment.  \n\n88 (---.. ---..): signifie \"bisous\", souvent partagés entre amis ou collègues.  \n\nCQ (-.-. --.-): un appel général à tous les opérateurs, traduit par \"appel à vous\".  \n\nGM (--. --): \"bonjour\", GA (--. .-): \"bon après-midi\", GE (--. .): \"bonsoir\", GN (--. -.): \"bonne nuit\".  \n\nR (.-.): un signal de confirmation signifiant \"reçu\" ou \"compris\".  \n\nPSE (.--. ... .): abréviation de \"s'il vous plaît\", utilisée dans des demandes polies.  \n\nMême des séquences inhabituelles telles que ..---...._, _ _.., ou _. _. sont décodées sans délai, faisant de chaque ligne de points et de traits une partie d'une langue vivante.  \n▸ Cas d'utilisation courants incluent :  \nDes enseignants qui expliquent ce qu'est le code morse pendant le cours  \n\nDes étudiants pratiquant des projets de l'anglais au code morse  \n\nDes amateurs travaillant avec des chiffres en code morse pendant leur temps libre  \n\nDes historiens montrant le code sos en morse comme partie de la culture  \n\nDes créateurs utilisant des outils de création de code morse pour le design  \n\nL'extension fonctionne également comme un décodeur de code morse. Collez n'importe quelle séquence, et la traduction en texte clair apparaît instantanément. Que vous testiez _. _ ou des séquences plus longues comme //, l'outil montre clairement la signification. Pas de devinette, pas de délais, seulement une interaction fluide. Pour de nombreux apprenants, cela devient le moyen le plus simple de s'entraîner et de convertir le morse en anglais en temps réel.  \n1️⃣ Avantages en un coup d'œil :  \nIntroduction facile à l'alphabet morse  \n\nDécodage de \"non\" en code morse et d'autres phrases  \n\nUne chance d'étudier les lettres du code morse dans des mots  \n\nCombinaisons créatives comme // pour des expériences  \n\nLe son ajoute une autre dimension. Le traducteur peut lire les motifs que vous créez. Il vous permet également de changer la vitesse de lecture, de sorte que les courts points et les longs traits correspondent à votre rythme. Vous pouvez ralentir pour vous entraîner ou accélérer pour plus de réalisme. Il y a même une option pour exporter des signaux et les enregistrer dans un fichier WAV pour une écoute ultérieure.  \n➤ Qui va l'apprécier :  \nDes étudiants explorant le code sos morse dans le cadre de projets  \n\nDes enseignants préparant des illustrations claires  \n\nDes fans de radio décodant \"sos en code morse\" pour le plaisir  \n\nDes designers inspirés par le rythme des signaux  \n\nQuiconque souhaite traduire le code morse sans effort  \n\nLa vie privée est toujours respectée. L'extension fonctionne complètement dans le navigateur, sans information envoyée ailleurs. Vos expériences avec ce code morse pour l'entraînement à l'alphabet ou le travail créatif vous appartiennent uniquement.  \n2️⃣ FAQ :  \nLe Traducteur de code Morse peut-il convertir en anglais immédiatement ? Oui, instantanément.  \n\nY a-t-il un convertisseur de code morse pour les lettres et les chiffres ? Oui, tout est couvert.  \n\nSimule-t-il une machine à code morse ? Oui, grâce à la fonction de tapotement.  \n\nPuis-je ajuster le son ? Oui, la vitesse peut être changée, et la lecture peut être exportée en WAV.  \n\nY a-t-il un générateur de code morse inclus ? Oui, vous pouvez créer et tester vos propres signaux.  \n\nL'extension gère-t-elle des motifs inhabituels ? Oui, elle décode même des séquences rares.  \n3️⃣ Raisons d'installer aujourd'hui :  \nPratique avec la clé télégraphique dans son propre mode  \n\nPasser du code morse pour l'alphabet aux mots complets  \n\nExplorer des signaux comme \"sos en code morse\" sans confusion  \n\nProfiter des mises à jour avec plus de langues et de fonctionnalités  \n\nCompter sur ce traducteur comme un outil d'apprentissage quotidien  \n\nEn fin de compte, le Traducteur de code Morse est plus qu'un traducteur. C'est un moyen de se connecter à l'histoire tout en utilisant des outils modernes.  \nDesign par Aleh : stariyleg@gmail.com  \nIcône - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"icônes de code morse\">Icônes de code morse créées par Freepik - Flaticon</a>"
  }
}