{
  "appName": {
    "message": "Morsekode-oversetter"
  },
  "shortDesc": {
    "message": "Dette er morsekodeoversetter – morsekodegenerator med lyd og tekst. Lær morsekodealfabetet og oversett det til ditt språk."
  },
  "storeDesc": {
    "message": "Hvis du ønsker støtte for nye språk i Morse Code Translator, kan du skrive til utvikleren via e-post. Tilbakemeldinger fra brukere veileder fremtidige oppdateringer, og ideene dine kan forme hva som vil vises videre. Utvidelsen fungerer allerede med engelske, russiske og internasjonale signaler, men flere er planlagt.\n Morse Code Translator er utviklet for folk som ønsker en direkte og pålitelig måte å jobbe med prikker og bindestreker på nett. Verktøyet gjør det enkelt å oversette morsekode til engelsk og tilbake igjen. Alt kjører i nettleseren, uten servere imellom, slik at resultatene vises umiddelbart og forblir private.\n En av de mest praktiske funksjonene er at begge feltene synkroniseres i sanntid. Når du skriver ren tekst, oppdateres signalfeltet automatisk. Når du limer inn eller skriver inn punktum og bindestreker på mønstersiden, svarer tekstfeltet umiddelbart. Utvidelsen holder alltid begge retninger justert.\n Det finnes også en simulering av telegraftaster. Denne spesielle knappen lar deg taste rytmer for hånd. Modusen kan aktiveres separat, noe som gjør tastaturet eller musen om til et enkelt inndataverktøy. Hvert trykk genererer et mønster, og oversettelsen vises i tekstvinduet med en gang. Det føles nesten som å bruke en historisk maskin tilpasset nettleseren.\n Hvorfor folk installerer denne oversetteren:\n Online konvertering uten ekstra programvare\n\n\n Automatisk synkronisering mellom begge feltene\n\n\n En tydelig referanse til morsekodealfabetet i appen\n\n\n Telegrafnøkkelmodus for avlytting av signaler\n\n\n Oppdateringer som utvider språk og funksjoner\n\n\n Daglige fraser er morsommere når de sees gjennom signaler. Du kan bruke morsekodekonvertereren for å se hvordan «hei» ser ut, og selv korte hilsener kan få en leken tone. Noen eksperimenterer med «jeg elsker deg» i morsekode for kreative meldinger, mens andre sjekker «sos» i morsekode eller «sos en code morse» for nødøvelse. Systemet har en lang tradisjon i radioverdenen, der operatører ofte bruker korte koder og forkortelser:\n 73 (--... ...--): betyr «de beste ønsker» og brukes for å avslutte en kontakt på en høflig måte.\n\n\n 88 (---.. ---..): står for «kyss», ofte delt mellom venner eller kolleger.\n\n\n CQ (-.-. --.-): et generelt kall til alle operatører, oversatt til «kall til deg».\n\n\n GM (--. --): «god morgen», GA (--. .-): «god ettermiddag», GE (--. .): «god kveld», GN (--. -.): «god natt».\n\n\n R (.-.): et bekreftelsessignal som betyr «mottatt» eller «forstått».\n\n\n PSE (.--. ... .): forkortelse for «vær så snill», brukt i høflige forespørsler.\n\n\n Selv uvanlige sekvenser som ..---...._, _ _.. eller _. _. dekodes uten forsinkelse, slik at hver linje med prikker og bindestreker blir en del av et levende språk.\n ▸ Vanlige brukstilfeller inkluderer:\n Lærere som forklarer hva morsekode er i timen\n\n\n Studenter øver på engelsk til morsekodeprosjekter\n\n\n Hobbyister som jobber med morsekodetall på fritiden\n\n\n Historikere viser SOS-kode i morse som en del av kulturen\n\n\n Designere som bruker verktøy for morsekodeutvikling til design\n\n\n Utvidelsen fungerer også som en morsekodedekoder. Lim inn en hvilken som helst sekvens, og oversettelsen til ren tekst vises umiddelbart. Enten du tester _, _ eller lengre sekvenser som //, viser verktøyet betydningen tydelig. Ingen gjetting, ingen forsinkelser, bare jevn interaksjon. For mange elever blir dette den enkleste måten å trene og konvertere morse til engelsk i sanntid.\n 1️⃣ Oversikt over fordeler:\n Enkel introduksjon til morsalfabetet\n\n\n Dekoding av nei i morsekode og andre fraser\n\n\n En mulighet til å studere morsekodebokstaver i ord\n\n\n Kreative kombinasjoner som // for eksperimenter\n\n\n Lyd gir en ny dimensjon. Oversetteren kan spille av mønstrene du lager. Den lar deg også endre avspillingshastigheten, slik at korte prikker og lengre streker matcher tempoet ditt. Du kan senke hastigheten for øving eller øke hastigheten for realistisk lyd. Det er til og med et alternativ for å eksportere signaler og lagre dem i en WAV-fil for senere lytting.\n ➤ Hvem vil like det:\n Studenter utforsker koden sos morse som en del av prosjekter\n\n\n Lærere forbereder tydelige illustrasjoner\n\n\n Radiofans dekoder sos i morse-kode for moro skyld\n\n\n Designere inspirert av signalenes rytme\n\n\n Alle som vil oversette morsekode uten anstrengelse\n\n\n Personvern respekteres alltid. Utvidelsen kjører fullstendig i nettleseren, uten at informasjon sendes bort. Dine eksperimenter med denne morsekoden for alfabettrening eller kreativt arbeid forblir dine.\n 2️⃣ Vanlige spørsmål:\n Kan morsekodeoversetteren konvertere til engelsk med en gang? Ja, umiddelbart.\n\n\n Finnes det en morsekodekonverterer for bokstaver og tall? Ja, alt er dekket.\n\n\n Simulerer den en morsekodemaskin? Ja, gjennom tappefunksjonen.\n\n\n Kan jeg justere lyden? Ja, hastigheten kan endres, og avspillingen kan eksporteres som WAV.\n\n\n Er det inkludert en morsekodegenerator? Ja, du kan lage og teste dine egne signaler.\n\n\n Håndterer utvidelsen uvanlige mønstre? Ja, den dekoder selv sjeldne sekvenser.\n\n\n 3️⃣ Grunner til å installere i dag:\n Øv med telegrafnøkkelen i sin egen modus\n\n\n Veksle mellom morsekode for alfabetet og fullstendige ord\n\n\n Utforsk signaler som sos og morsekode uten forvirring\n\n\n Nyt oppdateringer med flere språk og funksjoner\n\n\n Stol på denne oversetteren som et daglig læringsverktøy\n\n\n Til syvende og sist er Morse Code Translator mer enn bare en oversetter. Det er en måte å få kontakt med historien på, samtidig som man bruker moderne verktøy.\n Design av Aleh: stariyleg@gmail.com\n Ikon - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"morsekodeikoner\">Morsekodeikoner laget av Freepik - Flaticon</a>\n"
  }
}