{
  "appName": {
    "message": "モールス信号翻訳機"
  },
  "shortDesc": {
    "message": "これはモールス信号翻訳機です - 音声とテキストを使ったモールス信号ジェネレーターです。モールス信号のアルファベットを学び、あなたの言語に翻訳しましょう。"
  },
  "storeDesc": {
    "message": "新しい言語のサポートがモールス信号翻訳機に必要な場合は、開発者にメールでご連絡ください。ユーザーからのフィードバックは今後のアップデートの指針となり、あなたのアイデアが次に何が登場するかを形作ることができます。この拡張機能はすでに英語、ロシア語、国際信号に対応していますが、さらに多くの言語が計画されています。\n\nモールス信号翻訳機は、オンラインでドットとダッシュを直接かつ信頼性の高い方法で扱いたい人々のために設計されています。このツールは、モールス信号を英語に翻訳し、再び戻すのを簡単にします。すべてはブラウザ内で動作し、サーバーは介在しないため、結果は瞬時に表示され、プライベートに保たれます。\n\n最も実用的な機能の一つは、両方のフィールドがリアルタイムで同期されることです。プレーンテキストを入力すると、信号フィールドが自動的に更新されます。パターン側にドットとダッシュを貼り付けたり入力したりすると、テキストフィールドが即座に反応します。この拡張機能は常に両方向を整列させています。\n\nまた、電信キーのシミュレーションもあります。この特別なボタンを使うことで、手でリズムをタップできます。このモードは別々にアクティブにでき、キーボードやマウスをシンプルな入力ツールに変えます。各タップはパターンを生成し、翻訳はテキストウィンドウに即座に表示されます。ブラウザ用に適応された歴史的な機械を使用しているかのような感覚です。\n\nこの翻訳機をインストールする理由：\nオンラインでの変換が追加のソフトウェアなしで可能\n\n両方のフィールド間の自動同期\n\nアプリ内に明確なモールス信号アルファベットの参照\n\n信号をタップするための電信キー モード\n\n言語や機能を拡張するアップデート\n\n日常のフレーズは信号を通して見るとより楽しくなります。モールス信号コンバータを使って「こんにちは」がどのように見えるかを確認したり、短い挨拶でも遊び心を持たせることができます。ある人々は「愛してる」をモールス信号で表現することを試みたり、他の人々は緊急時の練習としてモールス信号のSOSを確認したりします。このシステムはラジオの世界で長い伝統を持ち、オペレーターはしばしば短いコードや略語を使用します：\n73 (--... ...--): 「最良の願い」を意味し、連絡を丁寧に終えるために使用されます。\n\n88 (---.. ---..): 「キス」を表し、友人や同僚の間でよく共有されます。\n\nCQ (-.-. --.-): すべてのオペレーターへの一般的な呼びかけで、「あなたに呼びかける」と訳されます。\n\nGM (--. --): 「おはよう」、GA (--. .-): 「こんにちは」、GE (--. .): 「こんばんは」、GN (--. -.): 「おやすみ」。\n\nR (.-.): 「受信」または「理解」を意味する確認信号です。\n\nPSE (.--. ... .): 「お願いします」の略で、丁寧なリクエストに使用されます。\n\n..---...._, _ _..、または_. _.のような珍しいシーケンスも遅延なくデコードされ、すべてのドットとダッシュの行が生きた言語の一部となります。\n\n▸ 一般的な使用例には以下が含まれます：\n授業中にモールス信号について説明する教師\n\nモールス信号プロジェクトを練習する学生\n\n余暇にモールス信号の数字に取り組むホビイスト\n\n文化の一部としてモールス信号のSOSコードを示す歴史家\n\nデザインのためにモールス信号作成ツールを使用するクリエイター\n\nこの拡張機能はモールス信号デコーダーとしても機能します。任意のシーケンスを貼り付けると、プレーンテキストへの翻訳が即座に表示されます。_. _や//のような長いシーケンスをテストしても、ツールは意味を明確に示します。推測なし、遅延なし、スムーズなインタラクションだけです。多くの学習者にとって、これはモールス信号をリアルタイムで英語に変換する最も簡単な方法となります。\n\n1️⃣ 一目でわかる利点：\nモールスアルファベットへの簡単な導入\n\nモールス信号での「いいえ」や他のフレーズのデコード\n\n単語の中のモールス信号の文字を学ぶ機会\n\n実験のための//のようなクリエイティブな組み合わせ\n\n音は別の次元を加えます。翻訳機は、あなたが作成したパターンを再生できます。また、再生速度を変更できるため、短いドットと長いダッシュがあなたのペースに合います。練習のために遅くしたり、リアリズムのために速くしたりできます。後で聴くために信号をエクスポートしてWAVファイルに保存するオプションもあります。\n\n➤ 誰が楽しむか：\nプロジェクトの一環としてモールス信号のSOSコードを探求する学生\n\n明確なイラストを準備する教師\n\n楽しみのためにモールス信号のSOSをデコードするラジオファン\n\n信号のリズムにインスパイアされたデザイナー\n\n手間なくモールス信号を翻訳したい人\n\nプライバシーは常に尊重されます。この拡張機能は完全にブラウザ内で動作し、情報は外部に送信されません。アルファベットのトレーニングやクリエイティブな作業のためのモールス信号に関するあなたの実験は、あなた自身のものとして保たれます。\n\n2️⃣ よくある質問：\nモールス信号翻訳機はすぐに英語に変換できますか？はい、瞬時に。\n\n文字や数字のためのモールス信号コンバータはありますか？はい、すべてがカバーされています。\n\nモールス信号機をシミュレートしますか？はい、タッピング機能を通じて。\n\n音を調整できますか？はい、速度を変更でき、再生をWAVとしてエクスポートできます。\n\nモールス信号ジェネレーターは含まれていますか？はい、自分の信号を作成してテストできます。\n\nこの拡張機能は珍しいパターンを処理しますか？はい、珍しいシーケンスもデコードします。\n\n3️⃣ 今日インストールする理由：\n独自のモードで電信キーを使って練習する\n\nアルファベット用のモールス信号と完全な単語の間で切り替える\n\n混乱なくモールス信号のSOSコードを探求する\n\nより多くの言語と機能を持つアップデートを楽しむ\n\n日常の学習ツールとしてこの翻訳機に頼る\n\n結局のところ、モールス信号翻訳機は単なる翻訳機以上のものです。現代のツールを使用しながら歴史とつながる方法です。\nデザイン：Aleh: stariyleg@gmail.com\nアイコン - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"morse code icons\">モールス信号アイコンはFreepik - Flaticonによって作成されました</a>"
  }
}