{
  "appName": {
    "message": "مترجم شفرة مورس"
  },
  "shortDesc": {
    "message": "هذا هو مترجم شفرة مورس - مولد شفرة مورس مع الصوت والنص. تعلم أبجدية شفرة مورس وترجم إلى لغتك."
  },
  "storeDesc": {
    "message": "إذا كنت ترغب في دعم لغات جديدة في مترجم شفرة مورس، فقط اكتب إلى المطور عبر البريد الإلكتروني. تعليقات المستخدمين توجه التحديثات المستقبلية، ويمكن أن تشكل أفكارك ما سيظهر بعد ذلك. الإضافة تعمل بالفعل مع الإنجليزية والروسية والإشارات الدولية، ولكن هناك المزيد مخطط له.\nمترجم شفرة مورس مصمم للأشخاص الذين يريدون طريقة مباشرة وموثوقة للعمل مع النقاط والشرطات عبر الإنترنت. الأداة تجعل من السهل ترجمة شفرة مورس إلى الإنجليزية والعكس. كل شيء يعمل داخل المتصفح، دون وجود خوادم في المنتصف، لذا تظهر النتائج على الفور وتبقى خاصة.\nواحدة من أكثر الميزات العملية هي أن كلا الحقلين متزامنان في الوقت الحقيقي. عندما تكتب نصًا عاديًا، يتم تحديث حقل الإشارة تلقائيًا. عندما تقوم بلصق أو إدخال النقاط والشرطات في جانب النمط، يستجيب حقل النص على الفور. الإضافة دائمًا تحافظ على توافق الاتجاهين.\nهناك أيضًا محاكاة لمفتاح التلغراف. هذا الزر الخاص يتيح لك النقر على الإيقاعات يدويًا. يمكن تفعيل الوضع بشكل منفصل، مما يحول لوحة المفاتيح أو الفأرة إلى أداة إدخال بسيطة. كل نقرة تولد نمطًا، وتظهر الترجمة في نافذة النص على الفور. يبدو الأمر وكأنك تستخدم آلة تاريخية تم تكييفها للمتصفح.\nلماذا يقوم الناس بتثبيت هذا المترجم:\nتحويل عبر الإنترنت دون برامج إضافية\n\nتزامن تلقائي بين كلا الحقلين\n\nمرجع واضح لأبجدية شفرة مورس داخل التطبيق\n\nوضع مفتاح التلغراف لنقر الإشارات\n\nتحديثات توسع اللغات والميزات\n\nالعبارات اليومية تكون أكثر متعة عند مشاهدتها من خلال الإشارات. يمكنك استخدام محول شفرة مورس لرؤية كيف يبدو \"مرحبا\"، وحتى التحيات القصيرة يمكن أن تأخذ طابعًا مرحًا. بعض الناس يجربون \"أحبك\" في شفرة مورس لرسائل إبداعية، بينما يتحقق آخرون من \"SOS\" في شفرة مورس أو \"SOS en code morse\" للتدريب الطارئ. النظام له تقليد طويل في عالم الراديو، حيث يستخدم المشغلون غالبًا رموزًا قصيرة واختصارات:\n73 (--... ...--): تعني \"أطيب التمنيات\" وتستخدم لإنهاء الاتصال بأدب.\n\n88 (---.. ---..): تعني \"قبلات\"، وغالبًا ما تُشارك بين الأصدقاء أو الزملاء.\n\nCQ (-.-. --.-): نداء عام لجميع المشغلين، يُترجم إلى \"نداء لك\".\n\nGM (--. --): \"صباح الخير\"، GA (--. .-): \"مساء الخير\"، GE (--. .): \"مساء الخير\"، GN (--. -.): \"تصبح على خير\".\n\nR (.-.): إشارة تأكيد تعني \"تم الاستلام\" أو \"فهمت\".\n\nPSE (.--. ... .): اختصار لـ \"من فضلك\"، يستخدم في الطلبات المهذبة.\n\nحتى التسلسلات غير المعتادة مثل ..---...._, _ _..، أو _. _. يتم فك تشفيرها دون تأخير، مما يجعل كل سطر من النقاط والشرطات جزءًا من لغة حية.\n▸ تشمل حالات الاستخدام الشائعة:\nالمعلمين الذين يشرحون ما هي شفرة مورس خلال الدرس\n\nالطلاب الذين يمارسون مشاريع الإنجليزية إلى شفرة مورس\n\nالهواة الذين يعملون مع أرقام شفرة مورس في أوقات فراغهم\n\nالمؤرخين الذين يظهرون شفرة \"SOS\" في مورس كجزء من الثقافة\n\nالمبدعين الذين يستخدمون أدوات إنشاء شفرة مورس للتصميم\n\nتعمل الإضافة أيضًا كمفكك شفرة مورس. ألصق أي تسلسل، وستظهر الترجمة إلى نص عادي على الفور. سواء كنت تختبر _. _ أو تسلسلات أطول مثل //، تظهر الأداة المعنى بوضوح. لا تخمين، لا تأخير، فقط تفاعل سلس. بالنسبة للعديد من المتعلمين، تصبح هذه الطريقة الأسهل للتدريب وتحويل شفرة مورس إلى الإنجليزية في الوقت الحقيقي.\n1️⃣ الفوائد في لمحة:\nمقدمة سهلة لأبجدية مورس\n\nفك تشفير \"لا\" في شفرة مورس وعبارات أخرى\n\nفرصة لدراسة حروف شفرة مورس في الكلمات\n\nتركيبات إبداعية مثل // للتجارب\n\nالصوت يضيف بعدًا آخر. يمكن للمترجم تشغيل الأنماط التي تنشئها. كما يسمح لك بتغيير سرعة التشغيل، بحيث تتناسب النقاط القصيرة والشرطات الأطول مع إيقاعك. يمكنك إبطاءه للتدريب أو تسريعه للواقعية. هناك حتى خيار لتصدير الإشارات وحفظها في ملف WAV للاستماع لاحقًا.\n➤ من سيستمتع بذلك:\nالطلاب الذين يستكشفون شفرة \"SOS\" كجزء من المشاريع\n\nالمعلمين الذين يعدون رسومات توضيحية واضحة\n\nمعجبو الراديو الذين يفككون شفرة \"SOS en code morse\" من أجل المتعة\n\nالمصممون الذين يستلهمون من إيقاع الإشارات\n\nأي شخص يريد ترجمة شفرة مورس دون جهد\n\nالخصوصية دائمًا محترمة. تعمل الإضافة بالكامل داخل المتصفح، دون إرسال أي معلومات بعيدًا. تظل تجاربك مع هذه الشفرة لتدريب الأبجدية أو العمل الإبداعي خاصة بك وحدك.\n2️⃣ الأسئلة الشائعة:\nهل يمكن لمترجم شفرة مورس تحويل النص إلى الإنجليزية على الفور؟ نعم، على الفور.\n\nهل هناك محول شفرة مورس للحروف والأرقام؟ نعم، كل شيء مشمول.\n\nهل يحاكي آلة شفرة مورس؟ نعم، من خلال ميزة النقر.\n\nهل يمكنني ضبط الصوت؟ نعم، يمكن تغيير السرعة، ويمكن تصدير التشغيل كملف WAV.\n\nهل هناك مولد شفرة مورس مضمّن؟ نعم، يمكنك إنشاء واختبار إشاراتك الخاصة.\n\nهل تتعامل الإضافة مع الأنماط غير المعتادة؟ نعم، تقوم بفك تشفير حتى التسلسلات النادرة.\n\n3️⃣ أسباب لتثبيت اليوم:\nالتدرب مع مفتاح التلغراف في وضعه الخاص\n\nالتبديل بين شفرة مورس للأبجدية والكلمات الكاملة\n\nاستكشاف الإشارات مثل \"SOS en code morse\" دون ارتباك\n\nالاستمتاع بالتحديثات مع المزيد من اللغات والميزات\n\nالاعتماد على هذا المترجم كأداة تعلم يومية\n\nفي النهاية، مترجم شفرة مورس هو أكثر من مجرد مترجم. إنه وسيلة للتواصل مع التاريخ أثناء استخدام أدوات حديثة.\nتصميم من أليه: stariyleg@gmail.com\nالأيقونة - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"morse code icons\">أيقونات شفرة مورس أنشأها فريبيك - فلاتيكون</a>"
  }
}