{
  "appName": {
    "message": "Prevajalnik Morsejeve kode"
  },
  "shortDesc": {
    "message": "To je Prevajalnik Morsejeve kode – generator morsejeve kode z zvokom in besedilom. Naučite se abecede morsejeve kode in jo prevedite v svoj jezik."
  },
  "storeDesc": {
    "message": "Če želite podporo za nove jezike v Prevajalnik Morsejeve kode, preprosto pišite razvijalcu po e-pošti. Mnenja uporabnikov usmerjajo prihodnje posodobitve, vaše ideje pa lahko oblikujejo, kaj se bo pojavilo naslednje. Razširitev že deluje z angleščino, ruščino in mednarodnimi signali, vendar so načrtovani še drugi jeziki.  \nPrevajalnik Morsejeve kode je zasnovan za ljudi, ki želijo neposreden in zanesljiv način dela z pikami in črtami na spletu. Orodje poenostavi prevajanje morsejeve kode v angleščino in nazaj. Vse deluje znotraj brskalnika, brez strežnikov vmes, tako da rezultati takoj pridejo na površje in ostanejo zasebni.  \nEna izmed najbolj praktičnih funkcij je, da sta oba polja sinhronizirana v realnem času. Ko vtipkate navadno besedilo, se polje signala samodejno posodobi. Ko prilepite ali vnesete pike in črte na stran vzorca, se polje besedila takoj odzove. Razširitev vedno ohranja usklajena oba smeri.  \nNa voljo je tudi simulacija telegrafskega ključa. Ta posebna gumb vam omogoča, da ritme tapkate ročno. Način se lahko aktivira ločeno, tako da vaš računalniški ali miški tipkovnica postane preprosto orodje za vnos. Vsak tap generira vzorec, prevod pa se takoj prikaže v besedilnem oknu. Zdi se skoraj, kot da uporabljate zgodovinsko napravo, prilagojeno za brskalnik.  \nZakaj ljudje nameščajo ta prevajalnik:  \nSpletna pretvorba brez dodatne programske opreme  \n\nSamodejna sinhronizacija med obema poljema  \n\nJasna referenca morsejeve abecede znotraj aplikacije  \n\nNačin telegrafskega ključa za tapkanje signalov  \n\nPosodobitve, ki širijo jezike in funkcije  \n\nDnevne fraze so bolj zabavne, ko jih gledate skozi signale. Uporabite lahko pretvornik morsejeve kode, da vidite, kako izgleda \"hello\", in celo kratki pozdravi lahko dobijo igriv ton. Nekateri ljudje eksperimentirajo z \"i love you\" v morsejevi kodi za ustvarjalna sporočila, medtem ko drugi preverjajo \"sos\" v morsejevi kodi ali \"sos en code morse\" za nujno prakso. Sistem ima dolgo tradicijo v svetu radia, kjer operaterji pogosto uporabljajo kratke kode in okrajšave:  \n73 (--... ...--): pomeni \"najboljše želje\" in se uporablja za vljuden zaključek stika.  \n\n88 (---.. ---..): pomeni \"poljubi\", pogosto deljeno med prijatelji ali sodelavci.  \n\nCQ (-.-. --.-): splošni klic vsem operaterjem, preveden kot \"klic k vam\".  \n\nGM (--. --): \"dobro jutro\", GA (--. .-): \"dobro popoldne\", GE (--. .): \"dobro večer\", GN (--. -.): \"lahko noč\".  \n\nR (.-.): potrdilni signal, ki pomeni \"prejeto\" ali \"razumljeno\".  \n\nPSE (.--. ... .): kratica za \"prosim\", uporabljena v vljudnih prošnjah.  \n\nTudi nenavadne sekvence, kot so ..---...._, _ _.., ali _. _. se dekodirajo brez zamude, kar pomeni, da vsaka vrstica pik in črt postane del živega jezika.  \n▸ Pogosti primeri uporabe vključujejo:  \nUčitelje, ki razlagajo, kaj je morsejeva koda med poukom  \n\nŠtudente, ki vadijo projekte od angleščine do morsejeve kode  \n\nHobi navdušence, ki delajo z morsejevimi številkami v prostem času  \n\nZgodovinarje, ki prikazujejo \"sos\" kodo v morseju kot del kulture  \n\nUstvarjalce, ki uporabljajo orodja za ustvarjanje morsejeve kode za oblikovanje  \n\nRazširitev deluje tudi kot dekoder morsejeve kode. Prilepite katero koli sekvenco in prevod v navadno besedilo se takoj prikaže. Ne glede na to, ali testirate _. _ ali daljše sekvence, kot je //, orodje jasno pokaže pomen. Brez ugibanja, brez zamud, le gladka interakcija. Za mnoge učence to postane najpreprostejši način za usposabljanje in pretvorbo morsejeve kode v angleščino v realnem času.  \n1️⃣ Prednosti na prvi pogled:  \nEnostavna uvod v morsejevo abecedo  \n\nDekodiranje \"no\" v morsejevi kodi in drugih fraz  \n\nPriložnost za študij črk morsejeve kode v besedah  \n\nKreativne kombinacije, kot je // za eksperimente  \n\nZvok dodaja še eno dimenzijo. Prevajalnik lahko predvaja vzorce, ki jih ustvarite. Omogoča vam tudi, da spremenite hitrost predvajanja, tako da kratke pike in daljše črte ustrezajo vašemu ritmu. Lahko ga upočasnite za vadbo ali pospešite za realističnost. Na voljo je celo možnost izvoza signalov in shranjevanja v datoteko WAV za kasnejše poslušanje.  \n➤ Kdo bo užival:  \nŠtudenti, ki raziskujejo \"sos\" morse kot del projektov  \n\nUčitelji, ki pripravljajo jasne ilustracije  \n\nRadijski navdušenci, ki dekodirajo \"sos en code morse\" za zabavo  \n\nOblikovalci, ki jih navdihuje ritem signalov  \n\nKdorkoli, ki želi brez truda prevajati morsejevo kodo  \n\nZasebnost je vedno spoštovana. Razširitev deluje popolnoma znotraj brskalnika, brez pošiljanja informacij. Vaši poskusi s to morsejevo kodo za usposabljanje abecede ali ustvarjalno delo ostanejo samo vaši.  \n2️⃣ Pogosta vprašanja:  \nAli Prevajalnik Morsejeve kode lahko takoj pretvori v angleščino? Da, takoj.  \n\nAli obstaja pretvornik morsejeve kode za črke in številke? Da, vse je zajeto.  \n\nAli simulira napravo za morsejevo kodo? Da, preko funkcije tapkanja.  \n\nAli lahko prilagodim zvok? Da, hitrost se lahko spremeni, predvajanje pa se lahko izvozi kot WAV.  \n\nAli je vključen generator morsejeve kode? Da, lahko ustvarite in preizkusite svoje signale.  \n\nAli razširitev obravnava nenavadne vzorce? Da, dekodira celo redke sekvence.  \n3️⃣ Razlogi za namestitev danes:  \nVadite s telegrafskim ključem v svojem načinu  \n\nPreklapljajte med morsejevo kodo za abecedo in celotne besede  \n\nRaziskujte signale, kot je \"sos en code morse\", brez zmede  \n\nUživajte v posodobitvah z več jeziki in funkcijami  \n\nZanesite se na ta prevajalnik kot na dnevno orodje za učenje  \n\nNa koncu je Prevajalnik Morsejeve kode več kot le prevajalnik. To je način povezovanja z zgodovino, medtem ko uporabljate sodobna orodja.  \nOblikovanje: Aleh: stariyleg@gmail.com  \nIkona - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"morse code icons\">Ikone morsejeve kode je ustvaril Freepik - Flaticon</a>"
  }
}