{
  "appName": {
    "message": "Překladač Morseovy abecedy"
  },
  "shortDesc": {
    "message": "Toto je Překladač Morseovy abecedy – generátor morseovky se zvukem a textem. Naučte se abecedu morseovky a přeložte ji do svého jazyka."
  },
  "storeDesc": {
    "message": "Pokud chcete podporu pro nové jazyky v Překladači Morseovy abecedy, jednoduše napište vývojáři e-mailem. Zpětná vazba od uživatelů řídí budoucí aktualizace a vaše nápady mohou ovlivnit, co se objeví příště. Rozšíření již funguje s angličtinou, ruštinou a mezinárodními signály, ale plánují se další jazyky.\nPřekladač Morseovy abecedy je navržen pro lidi, kteří chtějí přímý a spolehlivý způsob, jak pracovat s tečkami a čárkami online. Nástroj usnadňuje překlad morseovky do angličtiny a zpět. Vše běží uvnitř prohlížeče, bez serverů mezi tím, takže výsledky se objevují okamžitě a zůstávají soukromé.\nJednou z nejpraktičtějších funkcí je, že obě pole jsou synchronizována v reálném čase. Když píšete běžný text, pole signálu se automaticky aktualizuje. Když vložíte nebo zadáte tečky a čárky do vzorové strany, textové pole okamžitě reaguje. Rozšíření vždy udržuje obě směry v souladu.\nK dispozici je také simulace telegrafního klíče. Toto speciální tlačítko vám umožňuje klepat rytmy ručně. Režim lze aktivovat samostatně, čímž se vaše klávesnice nebo myš promění v jednoduchý vstupní nástroj. Každé klepnutí generuje vzor a překlad se okamžitě objeví v textovém okně. Je to téměř jako používání historického stroje přizpůsobeného prohlížeči.\nProč lidé instalují tento překladač:\nOnline konverze bez dalšího softwaru\n\nAutomatická synchronizace mezi oběma poli\n\nJasná reference morseovy abecedy uvnitř aplikace\n\nRežim telegrafního klíče pro klepání signálů\n\nAktualizace, které rozšiřují jazyky a funkce\n\nKaždodenní fráze jsou zábavnější, když jsou zobrazeny prostřednictvím signálů. Můžete použít překladač morseovy abecedy, abyste viděli, jak vypadá „ahoj“, a dokonce i krátké pozdravy mohou mít hravou atmosféru. Někteří lidé experimentují s „miluji tě“ v morseovce pro kreativní zprávy, zatímco jiní kontrolují „sos“ v morseovce nebo „sos en code morse“ pro nouzový trénink. Systém má dlouhou tradici ve světě rádia, kde operátoři často používají krátké kódy a zkratky:\n73 (--... ...--): znamená „nejlepší přání“ a používá se k zdvořilému ukončení kontaktu.\n\n88 (---.. ---..): znamená „polibky“, často sdílené mezi přáteli nebo kolegy.\n\nCQ (-.-. --.-): obecné volání pro všechny operátory, přeloženo jako „volání k vám“.\n\nGM (--. --): „dobré ráno“, GA (--. .-): „dobré odpoledne“, GE (--. .): „dobrý večer“, GN (--. -.): „dobrou noc“.\n\nR (.-.): potvrzovací signál znamenající „přijato“ nebo „pochopeno“.\n\nPSE (.--. ... .): zkratka pro „prosím“, používaná v zdvořilých žádostech.\n\nDokonce i neobvyklé sekvence jako ..---...._, _ _.., nebo _. _. jsou dekódovány bez prodlení, což činí každý řádek teček a čárek součástí živého jazyka.\n▸ Běžné případy použití zahrnují:\nUčitele, kteří vysvětlují, co je morseovka během hodiny\n\nStudenty, kteří cvičí projekty angličtiny na morseovku\n\nHobbyisty, kteří pracují s morseovými čísly ve svém volném čase\n\nHistoriky, kteří ukazují kód sos v morse jako součást kultury\n\nTvůrce, kteří používají nástroje pro vytváření morseovky pro design\n\nRozšíření také funguje jako dekodér morseovky. Vložte jakoukoli sekvenci a překlad do běžného textu se okamžitě objeví. Ať už testujete _. _ nebo delší sekvence jako //, nástroj jasně ukazuje význam. Žádné hádání, žádné prodlení, pouze plynulá interakce. Pro mnoho studentů se to stává nejjednodušším způsobem, jak trénovat a převádět morseovku do angličtiny v reálném čase.\n1️⃣ Výhody na první pohled:\nSnadné seznámení s morseovou abecedou\n\nDekódování „ne“ v morseovce a dalších frází\n\nPříležitost studovat písmena morseovy abecedy ve slovech\n\nKreativní kombinace jako // pro experimenty\n\nZvuk přidává další dimenzi. Překladač může přehrávat vzory, které vytváříte. Umožňuje také měnit rychlost přehrávání, takže krátké tečky a delší čárky odpovídají vašemu tempu. Můžete to zpomalit pro trénink nebo zrychlit pro realismus. Dokonce existuje možnost exportovat signály a uložit je do souboru WAV pro pozdější poslech.\n➤ Kdo si to užije:\nStudenti zkoumá kód sos morse jako součást projektů\n\nUčitelé připravující jasné ilustrace\n\nRádioví fanoušci dekódující sos en code morse pro zábavu\n\nDesignéři inspirovaní rytmem signálů\n\nKdokoli, kdo chce překládat morseovku bez námahy\n\nSoukromí je vždy respektováno. Rozšíření běží zcela uvnitř prohlížeče, bez odesílání informací pryč. Vaše experimenty s touto morseovkou pro trénink abecedy nebo kreativní práci zůstávají pouze vaše.\n2️⃣ Často kladené otázky:\nMůže Překladač Morseovy abecedy okamžitě převést do angličtiny? Ano, okamžitě.\n\nExistuje překladač morseovky pro písmena a čísla? Ano, vše je pokryto.\n\nSimuluje to stroj na morseovku? Ano, prostřednictvím funkce klepání.\n\nMohu upravit zvuk? Ano, rychlost lze měnit a přehrávání lze exportovat jako WAV.\n\nJe součástí rozšíření generátor morseovky? Ano, můžete vytvářet a testovat své vlastní signály.\n\nZvládá rozšíření neobvyklé vzory? Ano, dekóduje i vzácné sekvence.\n\n3️⃣ Důvody k instalaci dnes:\nCvičte s telegrafním klíčem v jeho vlastním režimu\n\nPřepínejte mezi morseovkou pro abecedu a celá slova\n\nProzkoumávejte signály jako sos en code morse bez zmatku\n\nUžijte si aktualizace s více jazyky a funkcemi\n\nSpolehněte se na tento překladač jako na každodenní nástroj pro učení\n\nNa závěr, Překladač Morseovy abecedy je víc než jen překladač. Je to způsob, jak se spojit s historií při používání moderních nástrojů.\nDesign od Aleh: stariyleg@gmail.com\nIkona - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"morse code icons\">Ikony morseovy abecedy vytvořil Freepik - Flaticon</a>"
  }
}