{
  "appName": {
    "message": "મોર્સ કોડ અનુવાદક"
  },
  "shortDesc": {
    "message": "આ મોર્સ કોડ ટ્રાન્સલેટર છે - ધ્વનિ અને ટેક્સ્ટ સાથે મોર્સ કોડ જનરેટર. મોર્સ કોડ મૂળાક્ષરો શીખો અને તમારી ભાષામાં અનુવાદ કરો."
  },
  "storeDesc": {
    "message": "જો તમને મોર્સ કોડ ટ્રાન્સલેટરમાં નવી ભાષાઓ માટે સપોર્ટ જોઈતો હોય, તો ફક્ત ડેવલપરને ઇમેઇલ દ્વારા લખો. વપરાશકર્તાઓ તરફથી પ્રતિસાદ ભવિષ્યના અપડેટ્સનું માર્ગદર્શન આપે છે, અને તમારા વિચારો આગળ શું દેખાશે તે આકાર આપી શકે છે. એક્સટેન્શન પહેલાથી જ અંગ્રેજી, રશિયન અને આંતરરાષ્ટ્રીય સિગ્નલો સાથે કાર્ય કરે છે, પરંતુ વધુ આયોજન કરવામાં આવ્યું છે.\n મોર્સ કોડ ટ્રાન્સલેટર એવા લોકો માટે રચાયેલ છે જેઓ ડોટ્સ અને ડેશ સાથે ઓનલાઈન કામ કરવાની સીધી અને વિશ્વસનીય રીત ઇચ્છે છે. આ ટૂલ મોર્સ કોડને અંગ્રેજીમાં અને ફરીથી અનુવાદિત કરવાનું સરળ બનાવે છે. બધું બ્રાઉઝરની અંદર ચાલે છે, વચ્ચે કોઈ સર્વર નથી, તેથી પરિણામો તરત જ દેખાય છે અને ખાનગી રહે છે.\n સૌથી વ્યવહારુ સુવિધાઓમાંની એક એ છે કે બંને ફીલ્ડ રીઅલ ટાઇમમાં સિંક્રનાઇઝ થાય છે. જ્યારે તમે સાદો ટેક્સ્ટ લખો છો, ત્યારે સિગ્નલ ફીલ્ડ આપમેળે અપડેટ થાય છે. જ્યારે તમે પેટર્ન બાજુમાં ડોટ્સ-એન્ડ-ડૅશ પેસ્ટ કરો છો અથવા દાખલ કરો છો, ત્યારે ટેક્સ્ટ ફીલ્ડ તરત જ પ્રતિક્રિયા આપે છે. એક્સટેન્શન હંમેશા બંને દિશાઓને સંરેખિત રાખે છે.\n ટેલિગ્રાફ કી સિમ્યુલેશન પણ છે. આ ખાસ બટન તમને હાથથી લયને ટેપ કરવાની મંજૂરી આપે છે. આ મોડને અલગથી સક્રિય કરી શકાય છે, જે તમારા કીબોર્ડ અથવા માઉસને એક સરળ ઇનપુટ ટૂલમાં ફેરવે છે. દરેક ટેપ એક પેટર્ન જનરેટ કરે છે, અને અનુવાદ તરત જ ટેક્સ્ટ વિંડોમાં દેખાય છે. તે લગભગ બ્રાઉઝર માટે અનુકૂળ ઐતિહાસિક મશીનનો ઉપયોગ કરવા જેવું લાગે છે.\n લોકો આ અનુવાદક શા માટે ઇન્સ્ટોલ કરે છે:\n વધારાના સોફ્ટવેર વિના ઓનલાઇન રૂપાંતર\n\n\n બંને ક્ષેત્રો વચ્ચે સ્વચાલિત સમન્વયન\n\n\n એપ્લિકેશનની અંદર સ્પષ્ટ મોર્સ કોડ મૂળાક્ષરોનો સંદર્ભ\n\n\n સિગ્નલો ટેપ કરવા માટે ટેલિગ્રાફ કી મોડ\n\n\n ભાષાઓ અને સુવિધાઓનો વિસ્તાર કરતા અપડેટ્સ\n\n\n સિગ્નલો દ્વારા જોવામાં આવે ત્યારે દૈનિક શબ્દસમૂહો વધુ મનોરંજક બને છે. &quot;હેલો&quot; કેવું દેખાય છે તે જોવા માટે તમે મોર્સ કોડ કન્વર્ટરનો ઉપયોગ કરી શકો છો, અને ટૂંકી શુભેચ્છાઓ પણ રમતિયાળ સ્વરમાં ફેરવાઈ શકે છે. કેટલાક લોકો સર્જનાત્મક સંદેશાઓ માટે મોર્સ કોડમાં &quot;આઇ લવ યુ&quot; નો પ્રયોગ કરે છે, જ્યારે અન્ય લોકો મોર્સ કોડમાં &quot;સોસ&quot; અથવા કટોકટી પ્રેક્ટિસ માટે &quot;સોસ એન કોડ મોર્સ&quot; નો ઉપયોગ કરે છે. રેડિયો વિશ્વમાં આ સિસ્ટમની લાંબી પરંપરા છે, જ્યાં ઓપરેટરો ઘણીવાર ટૂંકા કોડ અને સંક્ષેપનો ઉપયોગ કરે છે:\n ૭૩ (--... ...--): નો અર્થ &quot;શુભેચ્છાઓ&quot; થાય છે અને તેનો ઉપયોગ નમ્રતાપૂર્વક સંપર્ક સમાપ્ત કરવા માટે થાય છે.\n\n\n ૮૮ (---.. ---..): &quot;ચુંબનો&quot; માટે વપરાય છે, જે ઘણીવાર મિત્રો અથવા સાથીદારો વચ્ચે વહેંચાય છે.\n\n\n CQ (-.-. --.-): બધા ઓપરેટરો માટે એક સામાન્ય કોલ, જેનો અનુવાદ &quot;તમને કોલ&quot; તરીકે થાય છે.\n\n\n જીએમ (--. --): “શુભ સવાર,” જીએ (--. .-): “શુભ બપોર,” જીઇ (--. .): “શુભ સાંજ,” જીએન (--. -.): “શુભ રાત્રિ.”\n\n\n R (.-.): એક પુષ્ટિકરણ સંકેત જેનો અર્થ &quot;પ્રાપ્ત&quot; અથવા &quot;સમજાયેલ&quot; થાય છે.\n\n\n PSE (.--. ... .): &quot;કૃપા કરીને&quot; માટે ટૂંકું, નમ્ર વિનંતીઓમાં વપરાય છે.\n\n\n ..---...._, _ _.., અથવા _. _. જેવા અસામાન્ય ક્રમોને પણ વિલંબ કર્યા વિના ડીકોડ કરવામાં આવે છે, જે બિંદુઓ અને ડેશની દરેક પંક્તિને જીવંત ભાષાનો ભાગ બનાવે છે.\n ▸ સામાન્ય ઉપયોગના કિસ્સાઓમાં શામેલ છે:\n શિક્ષકો જે વર્ગ દરમિયાન મોર્સ કોડ શું છે તે સમજાવે છે\n\n\n અંગ્રેજીથી મોર્સ કોડ પ્રોજેક્ટનો અભ્યાસ કરતા વિદ્યાર્થીઓ\n\n\n પોતાના ફાજલ સમયમાં મોર્સ કોડ નંબરો સાથે કામ કરતા શોખીનો\n\n\n ઇતિહાસકારો સંસ્કૃતિના ભાગ રૂપે મોર્સમાં સોસ કોડ દર્શાવે છે.\n\n\n ડિઝાઇન માટે મોર્સ કોડ ક્રિએટર ટૂલ્સનો ઉપયોગ કરતા સર્જકો\n\n\n આ એક્સટેન્શન મોર્સ કોડ ડીકોડર તરીકે પણ કામ કરે છે. કોઈપણ ક્રમ પેસ્ટ કરો, અને સાદા ટેક્સ્ટમાં અનુવાદ તરત જ દેખાય છે. તમે _. _ અથવા // જેવા લાંબા ક્રમનું પરીક્ષણ કરો, આ સાધન અર્થ સ્પષ્ટ રીતે બતાવે છે. કોઈ અનુમાન નહીં, કોઈ વિલંબ નહીં, ફક્ત સરળ ક્રિયાપ્રતિક્રિયા નહીં. ઘણા શીખનારાઓ માટે આ તાલીમ આપવા અને વાસ્તવિક સમયમાં મોર્સને અંગ્રેજીમાં રૂપાંતરિત કરવાનો સૌથી સરળ રસ્તો બની જાય છે.\n 1️⃣ એક નજરમાં ફાયદા:\n મોર્સ મૂળાક્ષરોનો સરળ પરિચય\n\n\n મોર્સ કોડ અને અન્ય શબ્દસમૂહોમાં નાનું ડીકોડિંગ\n\n\n મોર્સ કોડ અક્ષરોને શબ્દોમાં શીખવાની તક\n\n\n પ્રયોગો માટે // જેવા સર્જનાત્મક સંયોજનો\n\n\n ધ્વનિ એક બીજું પરિમાણ ઉમેરે છે. અનુવાદક તમે બનાવેલા પેટર્નને પ્લે બેક કરી શકે છે. તે તમને પ્લેબેક સ્પીડ બદલવાની પણ મંજૂરી આપે છે, જેથી ટૂંકા બિંદુઓ અને લાંબા ડેશ તમારી ગતિ સાથે મેળ ખાય. તમે પ્રેક્ટિસ માટે તેને ધીમું કરી શકો છો અથવા વાસ્તવિકતા માટે તેને ઝડપી બનાવી શકો છો. સિગ્નલો નિકાસ કરવાનો અને પછીથી સાંભળવા માટે તેમને WAV ફાઇલમાં સાચવવાનો વિકલ્પ પણ છે.\n ➤ કોને આનંદ થશે:\n પ્રોજેક્ટ્સના ભાગ રૂપે કોડ સોસ મોર્સનું અન્વેષણ કરતા વિદ્યાર્થીઓ\n\n\n સ્પષ્ટ ચિત્રો તૈયાર કરતા શિક્ષકો\n\n\n મનોરંજન માટે રેડિયો ચાહકો એસઓએસ એન કોડ મોર્સ ડીકોડ કરી રહ્યા છે\n\n\n સિગ્નલોની લયથી પ્રેરિત ડિઝાઇનર્સ\n\n\n કોઈપણ જે મોર્સ કોડનો અનુવાદ વિના પ્રયાસ કરવા માંગે છે\n\n\n ગોપનીયતાનો હંમેશા આદર કરવામાં આવે છે. આ એક્સટેન્શન સંપૂર્ણપણે બ્રાઉઝરની અંદર ચાલે છે, કોઈ માહિતી મોકલવામાં આવતી નથી. મૂળાક્ષર તાલીમ અથવા સર્જનાત્મક કાર્ય માટે આ મોર્સ કોડ સાથેના તમારા પ્રયોગો ફક્ત તમારા માટે જ રહે છે.\n 2️⃣ વારંવાર પૂછાતા પ્રશ્નો:\n શું મોર્સ કોડ ટ્રાન્સલેટર તરત જ અંગ્રેજીમાં કન્વર્ટ થઈ શકે છે? હા, તરત જ.\n\n\n શું અક્ષરો અને સંખ્યાઓ માટે મોર્સ કોડ કન્વર્ટર છે? હા, બધું આવરી લેવામાં આવ્યું છે.\n\n\n શું તે મોર્સ કોડ મશીનનું અનુકરણ કરે છે? હા, ટેપિંગ સુવિધા દ્વારા.\n\n\n શું હું અવાજને સમાયોજિત કરી શકું? હા, ઝડપ બદલી શકાય છે, અને પ્લેબેકને WAV તરીકે નિકાસ કરી શકાય છે.\n\n\n શું મોર્સ કોડ જનરેટર શામેલ છે? હા, તમે તમારા પોતાના સિગ્નલો બનાવી અને ચકાસી શકો છો.\n\n\n શું એક્સટેન્શન અસામાન્ય પેટર્નને હેન્ડલ કરે છે? હા, તે દુર્લભ સિક્વન્સને પણ ડીકોડ કરે છે.\n\n\n 3️⃣ આજે જ ઇન્સ્ટોલ કરવાના કારણો:\n ટેલિગ્રાફ કીને તેના પોતાના મોડમાં પ્રેક્ટિસ કરો\n\n\n મૂળાક્ષરો અને સંપૂર્ણ શબ્દો માટે મોર્સ કોડ વચ્ચે સ્વિચ કરો\n\n\n કોઈ મૂંઝવણ વિના sos en કોડ મોર્સ જેવા સિગ્નલોનું અન્વેષણ કરો\n\n\n વધુ ભાષાઓ અને સુવિધાઓ સાથે અપડેટ્સનો આનંદ માણો\n\n\n દૈનિક શિક્ષણ સાધન તરીકે આ અનુવાદક પર આધાર રાખો\n\n\n અંતે, મોર્સ કોડ ટ્રાન્સલેટર ફક્ત અનુવાદક જ નથી. તે આધુનિક સાધનોનો ઉપયોગ કરીને ઇતિહાસ સાથે જોડાવાનો એક માર્ગ છે.\n ડિઝાઇન: અલેહ: stariyleg@gmail.com\n આઇકન - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"મોર્સ કોડ ચિહ્નો\">ફ્રીપિક - ફ્લેટિકોન દ્વારા બનાવેલ મોર્સ કોડ આઇકન</a>\n"
  }
}