{
  "appName": {
    "message": "Mfasiri wa Msimbo wa Morse"
  },
  "shortDesc": {
    "message": "Hii ni Mfasiri wa Msimbo wa Morse – jenereta ya msimbo wa morse yenye sauti na maandiko. Jifunze alfabeti ya msimbo wa morse na tafsiri kwa lugha yako."
  },
  "storeDesc": {
    "message": "Ikiwa unataka msaada wa lugha mpya katika Mfasiri wa Msimbo wa Morse, andika tu kwa mendelezo kupitia barua pepe. Maoni kutoka kwa watumiaji yanasaidia sasisho za baadaye, na mawazo yako yanaweza kuunda kile kitakachotokea baadaye. Mendelezo hili tayari linafanya kazi na Kiingereza, Kirusi, na ishara za Kimataifa, lakini zaidi zinapangwa.\n\nMfasiri wa Msimbo wa Morse umeundwa kwa watu wanaotaka njia ya moja kwa moja na ya kuaminika ya kufanya kazi na alama na mistari mtandaoni. Chombo hiki kinafanya iwe rahisi kutafsiri msimbo wa morse kwenda kiingereza na kurudi tena. Kila kitu kinafanyika ndani ya kivinjari, bila seva kati, hivyo matokeo yanaonekana mara moja na kubaki kuwa ya faragha.\n\nMoja ya vipengele vya vitendo zaidi ni kwamba maeneo yote mawili yanapatana kwa wakati halisi. Unapandika maandiko ya kawaida, uwanja wa ishara unasasishwa kiotomatiki. Unapokata au kuingiza alama na mistari upande wa muundo, uwanja wa maandiko unajibu mara moja. Mendelezo hili kila wakati linaweka mwelekeo wote sawa.\n\nPia kuna simulating ya funguo za telegraph. Kitufe hiki maalum kinakuruhusu kugonga midundo kwa mkono. Hali hii inaweza kuanzishwa pekee, ikigeuza kibodi yako au panya kuwa chombo rahisi cha kuingiza. Kila kugonga kunazalisha muundo, na tafsiri inaonekana kwenye dirisha la maandiko mara moja. Inahisi kama kutumia mashine ya kihistoria iliyobadilishwa kwa kivinjari.\n\nKwa nini watu wanaweka mfasiri huu:\nKubadilisha mtandaoni bila programu za ziada\n\nSawa kiotomatiki kati ya maeneo yote mawili\n\nKumbukumbu wazi ya alfabeti ya msimbo wa morse ndani ya programu\n\nHali ya funguo za telegraph kwa kugonga ishara\n\nSasisho zinazopanua lugha na vipengele\n\nMisemo ya kila siku inakuwa ya kufurahisha zaidi inapoitazama kupitia ishara. Unaweza kutumia mfasiri wa msimbo wa morse kuona jinsi \"hello\" inavyoonekana, na hata salamu fupi zinaweza kuchukua sauti ya kuchekesha. Watu wengine wanajaribu \"nakupenda\" kwa msimbo wa morse kwa ujumbe wa ubunifu, wakati wengine wanakagua \"sos\" kwa msimbo wa morse au \"sos en code morse\" kwa mazoezi ya dharura. Mfumo huu una historia ndefu katika ulimwengu wa redio, ambapo waendeshaji mara nyingi hutumia misimbo fupi na vifupisho:\n73 (--... ...--): inamaanisha \"heri bora\" na inatumika kumaliza mawasiliano kwa adabu.\n\n88 (---.. ---..): inasimama kwa \"mabusu,\" mara nyingi inashirikiwa kati ya marafiki au wenzake.\n\nCQ (-.-. --.-): wito wa jumla kwa waendeshaji wote, unatafsiriwa kama \"wito kwako.\"\n\nGM (--. --): \"habari za asubuhi,\" GA (--. .-): \"habari za mchana,\" GE (--. .): \"habari za jioni,\" GN (--. -.): \"habari za usiku.\"\n\nR (.-.): ishara ya uthibitisho inamaanisha \"imepokelewa\" au \"imeeleweka.\"\n\nPSE (.--. ... .): kifupi cha \"tafadhali,\" kinachotumika katika maombi ya adabu.\n\nHata mfuatano usio wa kawaida kama ..---...._, _ _.., au _. _. unatafsiriwa bila kuchelewa, na kufanya kila mstari wa alama na mistari kuwa sehemu ya lugha hai.\n▸ Matumizi ya kawaida ni pamoja na:\nWalimu wanaofafanua nini ni msimbo wa morse wakati wa darasa\n\nWanafunzi wanaofanya mazoezi ya miradi ya kiingereza hadi msimbo wa morse\n\nWapenzi wanaofanya kazi na nambari za msimbo wa morse katika muda wao wa ziada\n\nWahistoria wanaoonyesha msimbo wa sos kwa msimbo wa morse kama sehemu ya utamaduni\n\nWaumbaji wanaotumia zana za kuunda msimbo wa morse kwa ajili ya kubuni\n\nMendelezo hili pia linafanya kazi kama dekoda ya msimbo wa morse. Kataa mfuatano wowote, na tafsiri ya maandiko ya kawaida inaonekana mara moja. Iwe unajaribu _. _ au mfuatano mrefu kama //, chombo kinaonyesha maana wazi. Hakuna kukisia, hakuna kuchelewa, ni mwingiliano laini tu. Kwa wanafunzi wengi hii inakuwa njia rahisi zaidi ya kujifunza na kubadilisha msimbo wa morse kuwa kiingereza kwa wakati halisi.\n\n1️⃣ Faida kwa muonekano:\nUtangulizi rahisi kwa alfabeti ya msimbo wa morse\n\nUtafutaji wa \"hapana\" katika msimbo wa morse na misemo mingine\n\nFursa ya kujifunza herufi za msimbo wa morse katika maneno\n\nMchanganyiko wa ubunifu kama // kwa majaribio\n\nSauti inaongeza kipimo kingine. Mfasiri anaweza kucheza tena mifumo unayounda. Pia inakuwezesha kubadilisha kasi ya kucheza, hivyo alama fupi na mistari mirefu inafanana na kasi yako. Unaweza kuichelewesha kwa mazoezi au kuikimbiza kwa uhalisia. Kuna hata chaguo la kusafirisha ishara na kuziokoa katika faili ya WAV kwa ajili ya kusikiliza baadaye.\n\n➤ Nani atafurahia:\nWanafunzi wanaochunguza msimbo wa sos kwa sehemu ya miradi\n\nWalimu wanaotayarisha michoro wazi\n\nMashabiki wa redio wanaodecode msimbo wa sos kwa furaha\n\n wabunifu wanaohamasishwa na rhythm ya ishara\n\nMtu yeyote anayetaka kutafsiri msimbo wa morse bila juhudi\n\nFaragha kila wakati inaheshimiwa. Mendelezo linafanya kazi kabisa ndani ya kivinjari, bila taarifa yoyote kutumwa mbali. Majaribio yako na msimbo huu wa morse kwa mafunzo ya alfabeti au kazi za ubunifu yanabaki kuwa yako pekee.\n\n2️⃣ Maswali Yanayoulizwa Mara kwa Mara:\nJe, Mfasiri wa Msimbo wa Morse unaweza kubadilisha kuwa kiingereza mara moja? Ndio, mara moja.\n\nJe, kuna mfasiri wa msimbo wa morse kwa herufi na nambari? Ndio, kila kitu kimefunikwa.\n\nJe, inasimulia mashine ya msimbo wa morse? Ndio, kupitia kipengele cha kugonga.\n\nJe, naweza kubadilisha sauti? Ndio, kasi inaweza kubadilishwa, na kucheza kunaweza kusafirishwa kama WAV.\n\nJe, kuna jenereta ya msimbo wa morse iliyojumuishwa? Ndio, unaweza kuunda na kujaribu ishara zako mwenyewe.\n\nJe, mendelezo linaweza kushughulikia mifumo isiyo ya kawaida? Ndio, inatafsiri hata mfuatano nadra.\n\n3️⃣ Sababu za kufunga leo:\nFanya mazoezi na funguo za telegraph katika hali yake mwenyewe\n\nBadilisha kati ya msimbo wa morse kwa alfabeti na maneno kamili\n\nChunguza ishara kama sos kwa msimbo wa morse bila mkanganyiko\n\nFurahia sasisho zenye lugha na vipengele zaidi\n\nTegemea mfasiri huu kama chombo cha kujifunza kila siku\n\nMwisho, Mfasiri wa Msimbo wa Morse ni zaidi ya mfasiri. Ni njia ya kuungana na historia wakati wa kutumia zana za kisasa.\nUbunifu na Aleh: stariyleg@gmail.com\nIkoni - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"morse code icons\">Ikooni za msimbo wa morse ziliundwa na Freepik - Flaticon</a>"
  }
}