{
  "appName": {
    "message": "Penterjemah Kod Morse"
  },
  "shortDesc": {
    "message": "Ini adalah Penterjemah Kod Morse – penjana kod morse dengan bunyi & teks. Pelajari abjad kod morse dan terjemahkan ke dalam bahasa anda."
  },
  "storeDesc": {
    "message": "Jika anda ingin sokongan untuk bahasa baru dalam Penterjemah Kod Morse, hanya tulis kepada pemaju melalui emel. Maklum balas daripada pengguna membimbing kemas kini masa depan, dan idea anda boleh membentuk apa yang akan muncul seterusnya. Penterjemah Kod Morse sudah berfungsi dengan bahasa Inggeris, Rusia, dan isyarat Antarabangsa, tetapi lebih banyak dirancang.\n\nPenterjemah Kod Morse direka untuk orang yang ingin cara yang langsung dan boleh dipercayai untuk bekerja dengan titik dan garis dalam talian. Alat ini memudahkan untuk menterjemah kod morse ke dalam bahasa inggeris dan sebaliknya. Segala-galanya berjalan di dalam pelayar, tanpa pelayan di antara, jadi hasilnya muncul dengan serta-merta dan kekal peribadi.\n\nSalah satu ciri yang paling praktikal adalah bahawa kedua-dua medan diselaraskan dalam masa nyata. Apabila anda menaip teks biasa, medan isyarat dikemas kini secara automatik. Apabila anda menampal atau memasukkan titik dan garis ke dalam sisi corak, medan teks memberi respons dengan segera. Penterjemah sentiasa memastikan kedua-dua arah selaras.\n\nTerdapat juga simulasi kunci telegraf. Butang khas ini membolehkan anda mengetuk irama dengan tangan. Mod ini boleh diaktifkan secara berasingan, menjadikan papan kekunci atau tetikus anda sebagai alat input yang mudah. Setiap ketukan menghasilkan corak, dan terjemahan muncul di tetingkap teks sekaligus. Ia terasa hampir seperti menggunakan mesin bersejarah yang disesuaikan untuk pelayar.\n\nMengapa orang memasang penterjemah ini:\nPenukaran dalam talian tanpa perisian tambahan\n\nPenyegerakan automatik antara kedua-dua medan\n\nRujukan abjad kod morse yang jelas di dalam aplikasi\n\nMod kunci telegraf untuk mengetuk isyarat\n\nKemas kini yang memperluas bahasa dan ciri\n\nFrasa harian menjadi lebih menyeronokkan apabila dilihat melalui isyarat. Anda boleh menggunakan penukar kod morse untuk melihat bagaimana “hello” kelihatan, dan bahkan ucapan ringkas boleh mengambil nada yang ceria. Sesetengah orang bereksperimen dengan \"i love you\" dalam kod morse untuk mesej kreatif, sementara yang lain memeriksa \"sos\" dalam kod morse atau \"sos en code morse\" untuk latihan kecemasan. Sistem ini mempunyai tradisi yang panjang dalam dunia radio, di mana pengendali sering menggunakan kod pendek dan singkatan:\n73 (--... ...--): bermaksud “ucapan terbaik” dan digunakan untuk mengakhiri hubungan dengan sopan.\n\n88 (---.. ---..): mewakili “ciuman,” sering dikongsi antara rakan atau rakan sekerja.\n\nCQ (-.-. --.-): panggilan umum kepada semua pengendali, diterjemahkan sebagai “panggilan kepada anda.”\n\nGM (--. --): “selamat pagi,” GA (--. .-): “selamat petang,” GE (--. .): “selamat malam,” GN (--. -.): “selamat malam.”\n\nR (.-.): isyarat pengesahan yang bermaksud “diterima” atau “difahami.”\n\nPSE (.--. ... .): singkatan untuk “sila,” digunakan dalam permintaan yang sopan.\n\nBahkan urutan yang tidak biasa seperti ..---...._, _ _.., atau _. _. diterjemahkan tanpa kelewatan, menjadikan setiap baris titik dan garis sebagai sebahagian daripada bahasa hidup.\n▸ Kes penggunaan biasa termasuk:\nGuru yang menerangkan apa itu kod morse semasa kelas\n\nPelajar yang berlatih projek kod morse ke dalam bahasa inggeris\n\nPenggemar yang bekerja dengan nombor kod morse dalam masa lapang mereka\n\nSejarawan yang menunjukkan kod sos dalam morse sebagai sebahagian daripada budaya\n\nPencipta yang menggunakan alat pencipta kod morse untuk reka bentuk\n\nPenterjemah ini juga berfungsi sebagai penyahkod kod morse. Tampal sebarang urutan, dan terjemahan ke teks biasa muncul sekaligus. Sama ada anda menguji _. _ atau urutan yang lebih panjang seperti //, alat ini menunjukkan makna dengan jelas. Tiada tekaan, tiada kelewatan, hanya interaksi yang lancar. Bagi banyak pelajar, ini menjadi cara paling mudah untuk berlatih dan menukar morse ke dalam bahasa inggeris dalam masa nyata.\n\n1️⃣ Manfaat secara ringkas:\nPengenalan mudah kepada abjad morse\n\nPenyahkodan \"no\" dalam kod morse dan frasa lain\n\nPeluang untuk mempelajari huruf kod morse dalam perkataan\n\nGabungan kreatif seperti // untuk eksperimen\n\nBunyi menambah dimensi lain. Penterjemah boleh memainkan corak yang anda cipta. Ia juga membolehkan anda mengubah kelajuan main balik, jadi titik pendek dan garis yang lebih panjang sepadan dengan rentak anda. Anda boleh memperlahankannya untuk latihan atau mempercepatkannya untuk realisme. Terdapat juga pilihan untuk mengeksport isyarat dan menyimpannya dalam fail WAV untuk pendengaran kemudian.\n\n➤ Siapa yang akan menikmatinya:\nPelajar yang meneroka kod sos morse sebagai sebahagian daripada projek\n\nGuru yang menyediakan ilustrasi yang jelas\n\nPeminat radio yang menyahkod sos en code morse untuk keseronokan\n\nPereka yang terinspirasi oleh irama isyarat\n\nSesiapa yang ingin menterjemah kod morse tanpa usaha\n\nPrivasi sentiasa dihormati. Penterjemah ini berjalan sepenuhnya di dalam pelayar, tanpa maklumat dihantar keluar. Eksperimen anda dengan kod morse ini untuk latihan abjad atau kerja kreatif kekal milik anda sahaja.\n\n2️⃣ Soalan Lazim:\nBolehkah Penterjemah Kod Morse menukar ke bahasa inggeris dengan segera? Ya, serta-merta.\n\nAdakah terdapat penukar kod morse untuk huruf dan nombor? Ya, semuanya diliputi.\n\nAdakah ia mensimulasikan mesin kod morse? Ya, melalui ciri mengetuk.\n\nBolehkah saya menyesuaikan bunyi? Ya, kelajuan boleh diubah, dan main balik boleh dieksport sebagai WAV.\n\nAdakah terdapat penjana kod morse yang disertakan? Ya, anda boleh mencipta dan menguji isyarat anda sendiri.\n\nAdakah penterjemah ini mengendalikan corak yang tidak biasa? Ya, ia menyahkod bahkan urutan yang jarang.\n\n3️⃣ Sebab untuk memasang hari ini:\nBerlatih dengan kunci telegraf dalam modnya sendiri\n\nBeralih antara kod morse untuk abjad dan perkataan lengkap\n\nMeneroka isyarat seperti sos en code morse tanpa kekeliruan\n\nNikmati kemas kini dengan lebih banyak bahasa dan ciri\n\nBergantung pada penterjemah ini sebagai alat pembelajaran harian\n\nAkhirnya, Penterjemah Kod Morse lebih daripada sekadar penterjemah. Ia adalah cara untuk berhubung dengan sejarah sambil menggunakan alat moden.  \nReka bentuk oleh Aleh: stariyleg@gmail.com  \nIkon - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"ikon kod morse\">Ikon kod morse dibuat oleh Freepik - Flaticon</a>"
  }
}