{
  "appName": {
    "message": "Morse-koodin kääntäjä"
  },
  "shortDesc": {
    "message": "Tämä on Morse-koodin kääntäjä – morse-koodigeneraattori äänellä ja tekstillä. Opettele morse-koodin aakkoset ja käännä omaan kieleesi."
  },
  "storeDesc": {
    "message": "Jos haluat tukea uusia kieliä Morse-koodin kääntäjässä, kirjoita vain kehittäjälle sähköpostitse. Käyttäjien palaute ohjaa tulevia päivityksiä, ja ideasi voivat muokata sitä, mitä seuraavaksi ilmestyy. Laajennus toimii jo englannin, venäjän ja kansainvälisten signaalien kanssa, mutta lisää on suunnitteilla.  \nMorse-koodin kääntäjä on suunniteltu ihmisille, jotka haluavat suoran ja luotettavan tavan työskennellä pisteiden ja viivojen kanssa verkossa. Työkalu tekee morsekoodin kääntämisestä englanniksi ja takaisin helppoa. Kaikki toimii selaimessa, ilman palvelimia välissä, joten tulokset ilmestyvät heti ja pysyvät yksityisinä.  \nYksi käytännöllisimmistä ominaisuuksista on, että molemmat kentät synkronoidaan reaaliajassa. Kun kirjoitat tavallista tekstiä, signaalikenttä päivittyy automaattisesti. Kun liität tai syötät pisteitä ja viivoja kaavion puolelle, tekstikenttä reagoi heti. Laajennus pitää aina molemmat suunnat synkronoituna.  \nSiellä on myös telegrafiavainsimulaatio. Tämä erityinen painike antaa sinun napauttaa rytmejä käsin. Tämä tila voidaan aktivoida erikseen, jolloin näppäimistösi tai hiiren muuttuu yksinkertaiseksi syöttötyökaluksi. Jokainen napautus tuottaa kaavan, ja käännös ilmestyy tekstiruudulle heti. Se tuntuu melkein siltä kuin käyttäisi historiallista konetta, joka on mukautettu selaimeen.  \nMiksi ihmiset asentavat tämän kääntäjän:  \nVerkkomuunnos ilman ylimääräistä ohjelmistoa  \nAutomaattinen synkronointi molempien kenttien välillä  \nSelkeä morsekoodialfabetin viite sovelluksessa  \nTelegrafiavainmoodi signaalien naputtamiseen  \nPäivitykset, jotka laajentavat kieliä ja ominaisuuksia  \nPäivittäiset lauseet ovat hauskempia, kun niitä katsotaan signaalien kautta. Voit käyttää morsekoodin muunninta nähdäksesi, miltä \"hello\" näyttää, ja jopa lyhyet tervehdykset voivat saada leikkisän sävyn. Jotkut ihmiset kokeilevat \"i love you\" morsekoodina luovissa viesteissä, kun taas toiset tarkistavat \"sos\" morsekoodina tai \"sos en code morse\" hätätilanteiden harjoittelua varten. Järjestelmällä on pitkä perinne radiomaailmassa, jossa operaattorit käyttävät usein lyhyitä koodeja ja lyhenteitä:  \n73 (--... ...--): tarkoittaa \"parhaat toivotukset\" ja sitä käytetään kontaktin päättämiseen kohteliaasti.  \n88 (---.. ---..): tarkoittaa \"suukkoja\", joita jaetaan usein ystävien tai kollegoiden kesken.  \nCQ (-.-. --.-): yleinen kutsu kaikille operaattoreille, käännettynä \"kutsu sinulle\".  \nGM (--. --): \"hyvää huomenta\", GA (--. .-): \"hyvää iltapäivää\", GE (--. .): \"hyvää iltaa\", GN (--. -.): \"hyvää yötä\".  \nR (.-.): vahvistussignaali, joka tarkoittaa \"vastaanotettu\" tai \"ymmärretty\".  \nPSE (.--. ... .): lyhenne sanasta \"ole hyvä\", jota käytetään kohteliaissa pyyntöissä.  \nJopa epätavalliset sekvenssit, kuten ..---...._, _ _.. tai _. _. dekoodataan viipymättä, jolloin jokainen pisteiden ja viivojen rivi on osa elävää kieltä.  \n▸ Yleisiä käyttötapauksia ovat:  \nOpettajat, jotka selittävät, mitä morsekoodi on tunnilla  \nOpiskelijat, jotka harjoittelevat englannista morsekoodiin projekteissa  \nHarrastajat, jotka työskentelevät morsekoodin numeroiden parissa vapaa-ajallaan  \nHistoriantutkijat, jotka näyttävät sos-koodia morsekoodina osana kulttuuria  \nLuojat, jotka käyttävät morsekoodin luontityökaluja suunnittelussa  \nLaajennus toimii myös morsekoodin dekooderina. Liitä mikä tahansa sekvenssi, ja käännös tavalliseksi tekstiksi ilmestyy heti. Olitpa testaamassa _. _ tai pidempiä sekvenssejä, kuten //, työkalu näyttää merkityksen selkeästi. Ei arvailua, ei viivytyksiä, vain sujuva vuorovaikutus. Monille oppijoille tämä tulee yksinkertaisimmaksi tavaksi harjoitella ja muuntaa morsea englanniksi reaaliajassa.  \n1️⃣ Hyödyt lyhyesti:  \nHelppo johdanto morse-alfabettiin  \nDekoodaus \"no\" morsekoodina ja muista lauseista  \nMahdollisuus opiskella morsekoodin kirjaimia sanoissa  \nLuovat yhdistelmät, kuten // kokeiluja varten  \nÄäni tuo toisen ulottuvuuden. Kääntäjä voi toistaa luomiasi kaavoja. Se myös mahdollistaa toistonopeuden muuttamisen, jotta lyhyet pisteet ja pidemmät viivat vastaavat omaa tahtiasi. Voit hidastaa sitä harjoittelua varten tai nopeuttaa realismia varten. On jopa mahdollisuus viedä signaaleja ja tallentaa ne WAV-tiedostona myöhempää kuuntelua varten.  \n➤ Kuka nauttii siitä:  \nOpiskelijat, jotka tutkivat sos-morse-koodia osana projekteja  \nOpettajat, jotka valmistavat selkeitä havainnollistuksia  \nRadiotaiteilijat, jotka dekoodaavat sos en code morse huvin vuoksi  \nSuunnittelijat, joita inspiroi signaalien rytmi  \nKuka tahansa, joka haluaa kääntää morsekoodia vaivatta  \nYksityisyyttä kunnioitetaan aina. Laajennus toimii täysin selaimessa, ilman tietojen lähettämistä ulos. Kokeilusi tämän morsekoodin kanssa aakkostreenauksessa tai luovassa työssä pysyvät vain sinun.  \n2️⃣ UKK:  \nVoiko Morse-koodin kääntäjä muuntaa englanniksi heti? Kyllä, heti.  \nOnko olemassa morsekoodin muunninta kirjaimille ja numeroille? Kyllä, kaikki on katettu.  \nSimuloiko se morsekoodikonetta? Kyllä, naputtamisominaisuuden kautta.  \nVoinko säätää ääntä? Kyllä, nopeutta voidaan muuttaa, ja toisto voidaan viedä WAV-muotoon.  \nOnko mukana morsekoodigeneraattori? Kyllä, voit luoda ja testata omia signaalejasi.  \nKäsitteleekö laajennus epätavallisia kaavoja? Kyllä, se dekoodaa jopa harvinaisia sekvenssejä.  \n3️⃣ Syitä asentaa tänään:  \nHarjoittele telegrafiavainmoodissa  \nVaihda morsekoodin aakkosten ja kokonaisien sanojen välillä  \nTutki signaaleja, kuten sos en code morse, ilman hämmennystä  \nNauti päivityksistä, joissa on lisää kieliä ja ominaisuuksia  \nLuota tähän kääntäjään päivittäisen oppimistyökaluna  \nLopuksi, Morse-koodin kääntäjä on enemmän kuin vain kääntäjä. Se on tapa yhdistää historia nykyaikaisilla työkaluilla.  \nSuunnittelu: Aleh: stariyleg@gmail.com  \nIkoni - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"morse code icons\">Morse-koodikuvakkeet on luonut Freepik - Flaticon</a>"
  }
}