{
  "appName": {
    "message": "Penerjemah Kode Morse"
  },
  "shortDesc": {
    "message": "Ini adalah Penerjemah Kode Morse – generator kode morse dengan suara & teks. Pelajari alfabet kode morse dan terjemahkan ke bahasa Anda."
  },
  "storeDesc": {
    "message": "Jika Anda ingin dukungan untuk bahasa baru di Penerjemah Kode Morse, cukup tulis kepada pengembang melalui email. Umpan balik dari pengguna memandu pembaruan di masa depan, dan ide-ide Anda dapat membentuk apa yang akan muncul selanjutnya. Ekstensi ini sudah berfungsi dengan sinyal bahasa Inggris, Rusia, dan Internasional, tetapi lebih banyak yang direncanakan.\nPenerjemah Kode Morse dirancang untuk orang-orang yang ingin cara langsung dan dapat diandalkan untuk bekerja dengan titik dan garis secara online. Alat ini membuatnya sederhana untuk menerjemahkan kode morse ke bahasa Inggris dan sebaliknya. Semuanya berjalan di dalam browser, tanpa server di antara, sehingga hasilnya muncul secara instan dan tetap pribadi.\nSalah satu fitur yang paling praktis adalah bahwa kedua bidang disinkronkan secara real-time. Ketika Anda mengetik teks biasa, bidang sinyal diperbarui secara otomatis. Ketika Anda menempelkan atau memasukkan titik dan garis ke sisi pola, bidang teks merespons segera. Ekstensi ini selalu menjaga kedua arah tetap selaras.\nAda juga simulasi kunci telegraf. Tombol khusus ini memungkinkan Anda mengetuk ritme dengan tangan. Mode ini dapat diaktifkan secara terpisah, mengubah keyboard atau mouse Anda menjadi alat input sederhana. Setiap ketukan menghasilkan pola, dan terjemahan muncul di jendela teks sekaligus. Rasanya hampir seperti menggunakan mesin bersejarah yang diadaptasi untuk browser.\nMengapa orang menginstal penerjemah ini:\nKonversi online tanpa perangkat lunak tambahan\n\nSinkronisasi otomatis antara kedua bidang\n\nReferensi alfabet kode morse yang jelas di dalam aplikasi\n\nMode kunci telegraf untuk mengetuk sinyal\n\nPembaruan yang memperluas bahasa dan fitur\n\nFrasa sehari-hari menjadi lebih menyenangkan ketika dilihat melalui sinyal. Anda dapat menggunakan konverter kode morse untuk melihat bagaimana “halo” terlihat, dan bahkan salam singkat dapat mengambil nada yang menyenangkan. Beberapa orang bereksperimen dengan \"saya mencintaimu\" dalam kode morse untuk pesan kreatif, sementara yang lain memeriksa sos dalam kode morse atau sos en code morse untuk latihan darurat. Sistem ini memiliki tradisi panjang di dunia radio, di mana operator sering menggunakan kode pendek dan singkatan:\n73 (--... ...--): berarti “saluran terbaik” dan digunakan untuk mengakhiri kontak dengan sopan.\n\n88 (---.. ---..): berarti “ciuman,” sering dibagikan antara teman atau rekan.\n\nCQ (-.-. --.-): panggilan umum untuk semua operator, diterjemahkan sebagai “panggilan untuk Anda.”\n\nGM (--. --): “selamat pagi,” GA (--. .-): “selamat siang,” GE (--. .): “selamat malam,” GN (--. -.): “selamat malam.”\n\nR (.-.): sinyal konfirmasi yang berarti “diterima” atau “dipahami.”\n\nPSE (.--. ... .): singkatan dari “tolong,” digunakan dalam permintaan sopan.\n\nBahkan urutan yang tidak biasa seperti ..---...._, _ _.., atau _. _. didekode tanpa penundaan, menjadikan setiap baris titik dan garis bagian dari bahasa yang hidup.\n▸ Kasus penggunaan umum termasuk:\nGuru yang menjelaskan apa itu kode morse selama kelas\n\nSiswa yang berlatih proyek kode morse ke bahasa Inggris\n\nHobi yang bekerja dengan angka kode morse di waktu luang mereka\n\nSejarawan yang menunjukkan kode sos dalam morse sebagai bagian dari budaya\n\nKreator yang menggunakan alat pembuat kode morse untuk desain\n\nEkstensi ini juga berfungsi sebagai dekoder kode morse. Tempelkan urutan apa pun, dan terjemahan ke teks biasa muncul sekaligus. Apakah Anda menguji _. _ atau urutan yang lebih panjang seperti //, alat ini menunjukkan makna dengan jelas. Tidak ada tebak-tebakan, tidak ada penundaan, hanya interaksi yang lancar. Bagi banyak pelajar, ini menjadi cara termudah untuk berlatih dan mengonversi morse ke bahasa Inggris secara real-time.\n1️⃣ Manfaat sekilas:\nPengenalan yang mudah ke alfabet morse\n\nDekode tidak dalam kode morse dan frasa lainnya\n\nKesempatan untuk mempelajari huruf kode morse dalam kata-kata\n\nKombinasi kreatif seperti // untuk eksperimen\n\nSuara menambah dimensi lain. Penerjemah dapat memutar pola yang Anda buat. Ini juga memungkinkan Anda mengubah kecepatan pemutaran, sehingga titik pendek dan garis yang lebih panjang sesuai dengan ritme Anda. Anda dapat memperlambatnya untuk berlatih atau mempercepatnya untuk realisme. Ada bahkan opsi untuk mengekspor sinyal dan menyimpannya dalam file WAV untuk didengarkan nanti.\n➤ Siapa yang akan menikmati ini:\nSiswa yang menjelajahi kode sos morse sebagai bagian dari proyek\n\nGuru yang menyiapkan ilustrasi yang jelas\n\nPenggemar radio yang mendekode sos en code morse untuk bersenang-senang\n\nDesainer yang terinspirasi oleh ritme sinyal\n\nSiapa pun yang ingin menerjemahkan kode morse tanpa usaha\n\nPrivasi selalu dihormati. Ekstensi ini berjalan sepenuhnya di dalam browser, tanpa informasi yang dikirim keluar. Eksperimen Anda dengan kode morse untuk pelatihan alfabet atau pekerjaan kreatif tetap milik Anda sendiri.\n2️⃣ FAQ:\nApakah Penerjemah Kode Morse dapat mengonversi ke bahasa Inggris segera? Ya, instan.\n\nApakah ada konverter kode morse untuk huruf dan angka? Ya, semuanya tercakup.\n\nApakah ini mensimulasikan mesin kode morse? Ya, melalui fitur mengetuk.\n\nBisakah saya mengatur suara? Ya, kecepatan dapat diubah, dan pemutaran dapat diekspor sebagai WAV.\n\nApakah ada generator kode morse yang disertakan? Ya, Anda dapat membuat dan menguji sinyal Anda sendiri.\n\nApakah ekstensi ini menangani pola yang tidak biasa? Ya, ia mendekode bahkan urutan yang jarang.\n\n3️⃣ Alasan untuk menginstal hari ini:\nBerlatih dengan kunci telegraf dalam mode sendiri\n\nBeralih antara kode morse untuk alfabet dan kata-kata lengkap\n\nJelajahi sinyal seperti sos en code morse tanpa kebingungan\n\nNikmati pembaruan dengan lebih banyak bahasa dan fitur\n\nAndalkan penerjemah ini sebagai alat pembelajaran harian\n\nPada akhirnya, Penerjemah Kode Morse lebih dari sekadar penerjemah. Ini adalah cara untuk terhubung dengan sejarah sambil menggunakan alat modern.\nDesain oleh Aleh: stariyleg@gmail.com\nIkon - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"ikon kode morse\">Ikon kode morse dibuat oleh Freepik - Flaticon</a>"
  }
}