{
  "appName": {
    "message": "Prekladač Morseovej abecedy"
  },
  "shortDesc": {
    "message": "Toto je Prekladač Morseovej abecedy – generátor morseovej abecedy so zvukom a textom. Naučte sa morseovú abecedu a preložte ju do svojho jazyka."
  },
  "storeDesc": {
    "message": "Ak chcete podporu pre nové jazyky v Prekladači Morseovej abecedy, jednoducho napíšte vývojárovi e-mailom. Spätná väzba od používateľov usmerňuje budúce aktualizácie a vaše nápady môžu ovplyvniť to, čo sa objaví ďalej. Rozšírenie už funguje s angličtinou, ruštinou a medzinárodnými signálmi, ale plánujú sa aj ďalšie jazyky.\nPrekladač Morseovej abecedy je navrhnutý pre ľudí, ktorí chcú priamy a spoľahlivý spôsob, ako pracovať s bodkami a čiarami online. Nástroj uľahčuje preklad morseovej abecedy do angličtiny a späť. Všetko prebieha v prehliadači, bez serverov medzi tým, takže výsledky sa objavujú okamžite a zostávajú súkromné.\nJednou z najpraktickejších funkcií je, že obe polia sú synchronizované v reálnom čase. Keď píšete obyčajný text, pole signálu sa automaticky aktualizuje. Keď vložíte alebo zadáte bodky a čiary do vzorovej strany, textové pole okamžite reaguje. Rozšírenie vždy udržuje obe smerovania v súlade.\nK dispozícii je aj simulácia telegrafného kľúča. Toto špeciálne tlačidlo vám umožňuje klepať rytmy ručne. Mód môže byť aktivovaný samostatne, čím sa vaša klávesnica alebo myš premení na jednoduchý vstupný nástroj. Každé klepnutie generuje vzor a preklad sa okamžite objaví v textovom okne. Je to takmer ako používanie historického stroja prispôsobeného pre prehliadač.\nPrečo si ľudia inštalujú tento prekladač:\nOnline konverzia bez dodatočného softvéru\n\nAutomatická synchronizácia medzi oboma poľami\n\nJasná referencia morseovej abecedy v aplikácii\n\nTelegrafný kľúč pre klepanie signálov\n\nAktualizácie, ktoré rozširujú jazyky a funkcie\n\nDenné frázy sú zábavnejšie, keď sa na ne pozeráte cez signály. Môžete použiť konvertor morseovej abecedy, aby ste videli, ako vyzerá „ahoj“, a dokonca aj krátke pozdravy môžu nadobudnúť hravý tón. Niektorí ľudia experimentujú s „milujem ťa“ v morseovej abecede pre kreatívne správy, zatiaľ čo iní kontrolujú „sos“ v morseovej abecede alebo „sos en code morse“ pre núdzovú prax. Systém má dlhú tradíciu vo svete rádia, kde operátori často používajú krátke kódy a skratky:\n73 (--... ...--): znamená „najlepšie priania“ a používa sa na zdvorilé ukončenie kontaktu.\n\n88 (---.. ---..): znamená „bozky“, často zdieľané medzi priateľmi alebo kolegami.\n\nCQ (-.-. --.-): všeobecné volanie pre všetkých operátorov, preložené ako „volanie k vám“.\n\nGM (--. --): „dobré ráno“, GA (--. .-): „dobré popoludnie“, GE (--. .): „dobrý večer“, GN (--. -.): „dobrú noc“.\n\nR (.-.): potvrdenie signálu znamenajúce „prijaté“ alebo „pochopené“.\n\nPSE (.--. ... .): skratka pre „prosím“, používaná v zdvorilých požiadavkách.\n\nAj nezvyčajné sekvencie ako ..---...._, _ _.., alebo _. _. sú dekódované bez oneskorenia, čo robí každý riadok bodiek a čiar súčasťou živého jazyka.\n▸ Bežné prípady použitia zahŕňajú:\nUčiteľov, ktorí vysvetľujú, čo je morseova abeceda počas hodiny\n\nŠtudentov, ktorí cvičia projekty z angličtiny do morseovej abecedy\n\nHobbyistov, ktorí pracujú s morseovými číslami vo voľnom čase\n\nHistorikov, ktorí ukazujú „sos“ kód v morse ako súčasť kultúry\n\nTvorcov, ktorí používajú nástroje na vytváranie morseovej abecedy na dizajn\n\nRozšírenie funguje aj ako dekodér morseovej abecedy. Vložte akúkoľvek sekvenciu a preklad do obyčajného textu sa okamžite objaví. Či už testujete _. _ alebo dlhšie sekvencie ako //, nástroj jasne ukazuje význam. Žiadne hádanie, žiadne oneskorenia, len plynulá interakcia. Pre mnohých študentov sa to stáva najjednoduchším spôsobom, ako trénovať a konvertovať morse do angličtiny v reálnom čase.\n1️⃣ Výhody na prvý pohľad:\nJednoduché zavedenie do morseovej abecedy\n\nDekódovanie „nie“ v morseovej abecede a iných fráz\n\nPríležitosť študovať písmená morseovej abecedy v slovách\n\nKreatívne kombinácie ako // pre experimenty\n\nZvuk pridáva ďalší rozmer. Prekladač môže prehrávať vzory, ktoré vytvárate. Umožňuje vám tiež zmeniť rýchlosť prehrávania, takže krátke bodky a dlhšie čiary zodpovedajú vášmu tempu. Môžete to spomaliť na cvičenie alebo zrýchliť pre realistickosť. Existuje dokonca možnosť exportovať signály a uložiť ich do súboru WAV na neskoršie počúvanie.\n➤ Kto si to užije:\nŠtudenti skúmajúci kód „sos morse“ ako súčasť projektov\n\nUčitelia pripravujúci jasné ilustrácie\n\nRádioví fanúšikovia dekódujúci „sos en code morse“ pre zábavu\n\nDizajnéri inšpirovaní rytmom signálov\n\nKtokoľvek, kto chce prekladať morseovú abecedu bez námahy\n\nSúkromie je vždy rešpektované. Rozšírenie funguje úplne v prehliadači, bez odosielania informácií. Vaše experimenty s touto morseovou abecedou na tréning abecedy alebo kreatívnu prácu zostávajú len vaše.\n2️⃣ Často kladené otázky:\nMôže Prekladač Morseovej abecedy okamžite preložiť do angličtiny? Áno, okamžite.\n\nExistuje konvertor morseovej abecedy pre písmená a čísla? Áno, všetko je pokryté.\n\nSimuluje to stroj na morseovú abecedu? Áno, prostredníctvom funkcie klepania.\n\nMôžem upraviť zvuk? Áno, rýchlosť sa dá zmeniť a prehrávanie sa dá exportovať ako WAV.\n\nJe súčasťou aj generátor morseovej abecedy? Áno, môžete vytvárať a testovať svoje vlastné signály.\n\nZvláda rozšírenie nezvyčajné vzory? Áno, dekóduje aj zriedkavé sekvencie.\n\n3️⃣ Dôvody na inštaláciu dnes:\nCvičte s telegrafným kľúčom v jeho vlastnom móde\n\nPrepínajte medzi morseovou abecedou pre abecedu a celé slová\n\nPreskúmajte signály ako „sos en code morse“ bez zmätku\n\nUžite si aktualizácie s viac jazykmi a funkciami\n\nSpoliehajte sa na tento prekladač ako na každodenný učebný nástroj\n\nNa konci je Prekladač Morseovej abecedy viac než len prekladač. Je to spôsob, ako sa spojiť s históriou pri používaní moderných nástrojov.\nDizajn od Aleh: stariyleg@gmail.com\nIkona - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"morse code icons\">Ikony morseovej abecedy vytvorené Freepik - Flaticon</a>"
  }
}