{
  "appName": {
    "message": "የሞርስ ኮድ ተርጓሚ"
  },
  "shortDesc": {
    "message": "ይህ የሞርስ ኮድ ተርጓሚ ነው - የሞርስ ኮድ ጄኔሬተር ከድምጽ እና ጽሑፍ ጋር። የሞርስ ኮድ ፊደል ተማር እና ወደ ቋንቋህ ተርጉም።"
  },
  "storeDesc": {
    "message": "በሞርስ ኮድ ተርጓሚ ውስጥ ለአዳዲስ ቋንቋዎች ድጋፍ ከፈለጉ፣ በቀላሉ ለገንቢው በኢሜል ይጻፉ። የተጠቃሚዎች ግብረመልስ የወደፊት ዝማኔዎችን ይመራል፣ እና የእርስዎ ሃሳቦች ቀጥሎ ምን እንደሚከሰት ሊቀርጹ ይችላሉ። ቅጥያው አስቀድሞ ከእንግሊዝኛ፣ ሩሲያኛ እና አለምአቀፍ ምልክቶች ጋር ይሰራል፣ ነገር ግን ብዙ ታቅዷል።\n የሞርስ ኮድ ተርጓሚ የተቀየሰው በመስመር ላይ ከነጥቦች እና ሰረዝ ጋር ለመስራት ቀጥተኛ እና አስተማማኝ መንገድ ለሚፈልጉ ሰዎች ነው። መሣሪያው የሞርስ ኮድን ወደ እንግሊዝኛ ለመተርጎም እና እንደገና ለመመለስ ቀላል ያደርገዋል። ሁሉም ነገር በአሳሹ ውስጥ ነው የሚሰራው፣ በመካከላቸው ምንም አገልጋይ የለም፣ ስለዚህ ውጤቶቹ በቅጽበት ይታያሉ እና የግል እንደሆኑ ይቆያሉ።\n በጣም ተግባራዊ ከሆኑ ባህሪያት አንዱ ሁለቱም መስኮች በእውነተኛ ጊዜ የተመሳሰሉ መሆናቸው ነው. ግልጽ ጽሑፍ ሲተይቡ የምልክት መስኩ በራስ-ሰር ይዘምናል። በስርዓተ-ጥለት ጎን ላይ ነጥቦችን እና ሰረዞችን ሲለጥፉ ወይም ሲያስገቡ የጽሑፍ መስኩ ወዲያውኑ ምላሽ ይሰጣል። ቅጥያው ሁል ጊዜ ሁለቱን አቅጣጫዎች ያቆያል.\n የቴሌግራፍ ቁልፍ ማስመሰልም አለ። ይህ ልዩ አዝራር ሪትሞችን በእጅ እንዲነኩ ያስችልዎታል። ሁነታው በተናጥል ሊነቃ ይችላል, የእርስዎን የቁልፍ ሰሌዳ ወይም አይጥ ወደ ቀላል የግቤት መሣሪያ ይለውጣል. እያንዳንዱ መታ ማድረግ ስርዓተ-ጥለት ያመነጫል, እና ትርጉሙ በአንድ ጊዜ በጽሑፍ መስኮቱ ውስጥ ይታያል. ለአሳሹ የተስተካከለ ታሪካዊ ማሽን ለመጠቀም ያህል ይሰማዋል።\n ሰዎች ለምን ይህን ተርጓሚ እንደሚጭኑት፡-\n ያለ ተጨማሪ ሶፍትዌር የመስመር ላይ ልወጣ\n\n\n በሁለቱም መስኮች መካከል በራስ-ሰር ማመሳሰል\n\n\n በመተግበሪያው ውስጥ ግልጽ የሆነ የሞርስ ኮድ ፊደል ማጣቀሻ\n\n\n ምልክቶችን ለመንካት የቴሌግራፍ ቁልፍ ሁነታ\n\n\n ቋንቋዎችን እና ባህሪያትን የሚያሰፋ ዝማኔዎች\n\n\n ዕለታዊ ሀረጎች በምልክቶች ሲታዩ የበለጠ አስደሳች ናቸው። “ሄሎ” እንዴት እንደሚመስል ለማየት የሞርስ ኮድ መቀየሪያውን መጠቀም ይችላሉ፣ እና አጭር ሰላምታ እንኳን ተጫዋች ቃና ሊይዝ ይችላል። አንዳንድ ሰዎች ለፈጠራ መልእክቶች በሞርስ ኮድ እወድሃለሁ፣ ሌሎች ደግሞ sos in mors code ወይም sos en code ሞርስ ለድንገተኛ ልምምድ ይፈትሹ። ስርዓቱ በሬዲዮ አለም ውስጥ ረጅም ባህል አለው፣ ኦፕሬተሮች ብዙ ጊዜ አጫጭር ኮዶችን እና አህጽሮተ ቃላትን ይጠቀማሉ።\n 73 (--... ...--)፡ ማለት “መልካም ምኞት” ማለት ሲሆን ግንኙነትን በትህትና ለመጨረስ ይጠቅማል።\n\n\n 88 (---... ---..): &quot;መሳም&quot; ማለት ነው, ብዙውን ጊዜ በጓደኞች ወይም በባልደረባዎች መካከል ይጋራሉ.\n\n\n CQ (-.-. --.-)፡ አጠቃላይ ጥሪ ለሁሉም ኦፕሬተሮች፣ “ወደ እርስዎ ጥሪ” ተተርጉሟል።\n\n\n ጂኤም (--. --): “ደህና አደር”፣ GA (--.-)፡ “ደህና ከሰአት”፣ GE (--. .): “ደህና አደሩ፣” ጂኤን (--. -.): “ደህና አደሩ።\n\n\n አር (.-.): የማረጋገጫ ምልክት ትርጉሙ &quot;ተቀበል&quot; ወይም &quot;ተረዳ&quot; ማለት ነው።\n\n\n PSE (.--. ... .): አጭር ለ “እባክዎ” ፣ በአክብሮት ጥያቄዎች ውስጥ ጥቅም ላይ ይውላል።\n\n\n እንደ ...---....._፣ _ _... ወይም _ የመሳሰሉ ያልተለመዱ ቅደም ተከተሎች እንኳን። _ ሳይዘገዩ ዲኮድ ይደረጋሉ፣ እያንዳንዱን የነጥብ እና የጭረት መስመር የሕያው ቋንቋ አካል በማድረግ።\n ▸ የተለመዱ የአጠቃቀም ጉዳዮች የሚከተሉትን ያካትታሉ:\n በክፍል ጊዜ ሞርስ ኮድ ምን እንደሆነ የሚያብራሩ አስተማሪዎች\n\n\n ከእንግሊዝኛ እስከ የሞርስ ኮድ ፕሮጀክቶችን የሚለማመዱ ተማሪዎች\n\n\n በትርፍ ጊዜያቸው ከሞርስ ኮድ ቁጥሮች ጋር የሚሰሩ ሆቢስቶች\n\n\n የታሪክ ተመራማሪዎች የሶስ ኮድ በሞርስ ውስጥ እንደ ባህል አካል ያሳያሉ\n\n\n ፈጣሪዎች የሞርስ ኮድ ፈጣሪ መሳሪያዎችን ለንድፍ ይጠቀማሉ\n\n\n ቅጥያው እንደ ሞርስ ኮድ ዲኮደርም ይሰራል። ማንኛውንም ቅደም ተከተል ለጥፍ፣ እና ወደ ግልጽ ጽሁፍ ትርጉሙ በአንድ ጊዜ ይታያል። ብትፈትኑም _. _ ወይም ረዘም ያሉ ቅደም ተከተሎች እንደ //፣ መሳሪያው ትርጉሙን በግልፅ ያሳያል። ምንም መገመት ፣ ምንም መዘግየት የለም ፣ ለስላሳ መስተጋብር ብቻ። ለብዙ ተማሪዎች ይህ ለማሰልጠን እና ሞርስን በእውነተኛ ጊዜ ወደ እንግሊዝኛ ለመቀየር ቀላሉ መንገድ ይሆናል።\n 1️⃣ ጥቅሞች በጨረፍታ፡-\n የሞርስ ፊደላት ቀላል መግቢያ\n\n\n በሞርስ ኮድ እና በሌሎች ሀረጎች ውስጥ የኖ መፍታት\n\n\n የሞርስ ኮድ ፊደላትን በቃላት የማጥናት እድል\n\n\n እንደ // ለሙከራዎች ያሉ የፈጠራ ጥምረት\n\n\n ድምፅ ሌላ ልኬት ይጨምራል። ተርጓሚው እርስዎ የሚፈጥሯቸውን ቅጦች መልሶ ማጫወት ይችላል። እንዲሁም የመልሶ ማጫወት ፍጥነት እንዲቀይሩ ያስችልዎታል፣ ስለዚህ አጫጭር ነጥቦች እና ረዣዥም ሰረዞች ከእርስዎ ፍጥነት ጋር ይጣጣማሉ። ለልምምድ ፍጥነት መቀነስ ወይም ለትክክለኛነት ማፋጠን ይችላሉ. ምልክቶችን ወደ ውጭ ለመላክ እና በኋላ ለማዳመጥ በ WAV ፋይል ውስጥ ለማስቀመጥ አንድ አማራጭ እንኳን አለ።\n ➤ ማን ይደሰትበታል፡-\n እንደ የፕሮጀክቶች አካል ኮድ ሶስ ሞርስን የሚፈትሹ ተማሪዎች\n\n\n ግልጽ ምሳሌዎችን በማዘጋጀት ላይ ያሉ አስተማሪዎች\n\n\n የሬዲዮ አድናቂዎች ለመዝናናት sos en ኮድ ሞርስ መፍታት\n\n\n ንድፍ አውጪዎች በምልክቶቹ ምት ተመስጧዊ ናቸው።\n\n\n የሞርስ ኮድን ያለ ጥረት መተርጎም የሚፈልግ ማንኛውም ሰው\n\n\n ግላዊነት ሁል ጊዜ የተከበረ ነው። ቅጥያው ሙሉ በሙሉ በአሳሹ ውስጥ ይሰራል፣ ምንም መረጃ ሳይላክ። በዚህ የሞርስ ኮድ ለፊደል ትምህርት ወይም ለፈጠራ ስራ ያደረጓቸው ሙከራዎች የእርስዎ ብቻ እንደሆኑ ይቆያሉ።\n 2️⃣ የሚጠየቁ ጥያቄዎች፡-\n የሞርስ ኮድ ተርጓሚ ወዲያውኑ ወደ እንግሊዝኛ ሊቀየር ይችላል? አዎ፣ በቅጽበት።\n\n\n ለፊደሎች እና ቁጥሮች የሞርስ ኮድ መቀየሪያ አለ? አዎ, ሁሉም ነገር የተሸፈነ ነው.\n\n\n የሞርስ ኮድ ማሽንን ያስመስላል? አዎ፣ በመንካት ባህሪው በኩል።\n\n\n ድምጽ ማስተካከል እችላለሁ? አዎ ፍጥነት መቀየር ይቻላል እና መልሶ ማጫወት እንደ WAV ወደ ውጭ መላክ ይቻላል.\n\n\n የሞርስ ኮድ ጀነሬተር ተካትቷል? አዎ, የራስዎን ምልክቶች መፍጠር እና መሞከር ይችላሉ.\n\n\n ቅጥያው ያልተለመዱ ቅጦችን ይይዛል? አዎ፣ ብርቅዬ ቅደም ተከተሎችን እንኳን ይፈታል።\n\n\n 3️⃣ ዛሬ ለመጫን ምክንያቶች፡-\n በቴሌግራፍ ቁልፍ በራሱ ሁነታ ይለማመዱ\n\n\n በሞርስ ኮድ ለፊደል እና ሙሉ ቃላት መካከል ይቀያይሩ\n\n\n እንደ ሶስ en ኮድ ሞርስ ያለ ግራ መጋባት ያሉ ምልክቶችን ያስሱ\n\n\n በብዙ ቋንቋዎች እና ባህሪያት ዝማኔዎችን ይደሰቱ\n\n\n በዚህ ተርጓሚ እንደ ዕለታዊ የመማሪያ መሳሪያ ይመኑ\n\n\n በመጨረሻ የሞርስ ኮድ ተርጓሚ ከተርጓሚ በላይ ነው። ዘመናዊ መሳሪያዎችን እየተጠቀሙ ከታሪክ ጋር የሚገናኙበት መንገድ ነው.\n ንድፍ በአለህ፡ stariyleg@gmail.com\n አዶ - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"የሞርስ ኮድ አዶዎች\">በ Freepik - Flaticon የተፈጠሩ የሞርስ ኮድ አዶዎች</a>\n"
  }
}