{
  "appName": {
    "message": "Перекладач Морзе"
  },
  "shortDesc": {
    "message": "Це Перекладач Морзе – генератор коду Морзе зі звуком та текстом. Вивчайте алфавіт коду Морзе та перекладайте на вашу мову."
  },
  "storeDesc": {
    "message": "Якщо ви хочете підтримку нових мов у Перекладачі Морзе, просто напишіть розробнику електронною поштою. Відгуки від користувачів сприяють майбутнім оновленням, а ваші ідеї можуть вплинути на те, що з'явиться далі. Розширення вже працює з англійською, російською та міжнародними сигналами, але планується додати більше мов.\n\nПерекладач Морзе призначений для людей, які хочуть мати прямий і надійний спосіб роботи з крапками та тире онлайн. Інструмент спрощує переклад коду Морзе на англійську та назад. Все працює в браузері, без серверів між ними, тому результати з'являються миттєво і залишаються приватними.\n\nОднією з найпрактичніших функцій є те, що обидва поля синхронізуються в реальному часі. Коли ви вводите звичайний текст, поле сигналу оновлюється автоматично. Коли ви вставляєте або вводите крапки та тире в бічному полі, текстове поле реагує миттєво. Розширення завжди підтримує обидва напрямки в синхронізації.\n\nТакож є симуляція телеграфного ключа. Ця спеціальна кнопка дозволяє вам вручну відтворювати ритми. Режим можна активувати окремо, перетворюючи вашу клавіатуру або мишу на простий інструмент введення. Кожен дотик генерує шаблон, а переклад з'являється у текстовому вікні одразу. Це відчувається майже так, ніби ви використовуєте історичну машину, адаптовану для браузера.\n\nЧому люди встановлюють цей перекладач:\nОнлайн-конверсія без додаткового програмного забезпечення\n\nАвтоматична синхронізація між обома полями\n\nЧітка довідка по алфавіту коду Морзе всередині програми\n\nРежим телеграфного ключа для відтворення сигналів\n\nОновлення, які розширюють мови та функції\n\nЩоденні фрази стають більш веселими, коли їх переглядати через сигнали. Ви можете використовувати конвертер коду Морзе, щоб побачити, як виглядає \"привіт\", і навіть короткі вітання можуть набути ігрового відтінку. Деякі люди експериментують з \"я тебе люблю\" у коді Морзе для креативних повідомлень, в той час як інші перевіряють \"сос\" у коді Морзе або \"сос\" у коді Морзе для практики в надзвичайних ситуаціях. Система має довгу традицію в радіо-світі, де оператори часто використовують короткі коди та абревіатури:\n73 (--... ...--): означає \"найкращі побажання\" і використовується для ввічливого завершення контакту.\n\n88 (---.. ---..): означає \"поцілунки\", часто обмінюються між друзями або колегами.\n\nCQ (-.-. --.-): загальний заклик до всіх операторів, перекладається як \"дзвінок до вас\".\n\nGM (--. --): \"доброго ранку\", GA (--. .-): \"доброго дня\", GE (--. .): \"доброго вечора\", GN (--. -.): \"доброго ночі\".\n\nR (.-.): сигнал підтвердження, що означає \"отримано\" або \"зрозуміло\".\n\nPSE (.--. ... .): скорочення від \"будь ласка\", використовується в ввічливих запитах.\n\nНавіть незвичайні послідовності, такі як ..---...._, _ _.., або _. _. декодуються без затримок, роблячи кожен рядок крапок і тире частиною живої мови.\n▸ Загальні випадки використання включають:\nВчителі, які пояснюють, що таке код Морзе під час уроку\n\nСтуденти, які практикують проекти з англійської на код Морзе\n\nХобісти, які працюють з числами коду Морзе у вільний час\n\nІсторики, які демонструють код \"сос\" у Морзе як частину культури\n\nТворці, які використовують інструменти для створення коду Морзе для дизайну\n\nРозширення також працює як декодер коду Морзе. Вставте будь-яку послідовність, і переклад на звичайний текст з'явиться одразу. Чи тестуєте ви _. _ або довші послідовності, такі як //, інструмент чітко показує значення. Ніяких здогадок, ніяких затримок, лише плавна взаємодія. Для багатьох учнів це стає найпростішим способом тренуватися і конвертувати код Морзе в англійську в реальному часі.\n\n1️⃣ Переваги на перший погляд:\nЛегке введення в алфавіт Морзе\n\nДекодування \"ні\" в коді Морзе та інших фраз\n\nМожливість вивчати літери коду Морзе в словах\n\nКреативні комбінації, такі як // для експериментів\n\nЗвук додає ще один вимір. Перекладач може відтворювати шаблони, які ви створюєте. Він також дозволяє змінювати швидкість відтворення, щоб короткі крапки та довгі тире відповідали вашому ритму. Ви можете сповільнити його для практики або прискорити для реалістичності. Є навіть можливість експортувати сигнали та зберігати їх у WAV-файлі для подальшого прослуховування.\n\n➤ Хто отримає задоволення:\nСтуденти, які досліджують код \"сос\" у Морзе як частину проектів\n\nВчителі, які готують чіткі ілюстрації\n\nФанати радіо, які декодують \"сос\" у коді Морзе для задоволення\n\nДизайнери, натхненні ритмом сигналів\n\nБудь-хто, хто хоче перекладати код Морзе без зусиль\n\nКонфіденційність завжди поважаються. Розширення працює повністю в браузері, без відправлення інформації. Ваші експерименти з цим кодом Морзе для навчання алфавіту або креативної роботи залишаються тільки вашими.\n\n2️⃣ Питання та відповіді:\nЧи може Перекладач Морзе миттєво конвертувати в англійську? Так, миттєво.\n\nЧи є конвертер коду Морзе для літер і цифр? Так, все охоплено.\n\nЧи симулює він машину коду Морзе? Так, через функцію натискання.\n\nЧи можу я налаштувати звук? Так, швидкість можна змінити, а відтворення можна експортувати як WAV.\n\nЧи є в комплекті генератор коду Морзе? Так, ви можете створювати та тестувати свої власні сигнали.\n\nЧи обробляє розширення незвичайні шаблони? Так, воно декодує навіть рідкісні послідовності.\n\n3️⃣ Причини встановити сьогодні:\nПрактика з телеграфним ключем у власному режимі\n\nПеремикання між кодом Морзе для алфавіту та повними словами\n\nДослідження сигналів, таких як \"сос\" у коді Морзе, без плутанини\n\nОтримуйте оновлення з новими мовами та функціями\n\nПокладайтеся на цей перекладач як на щоденний навчальний інструмент\n\nВ кінці, Перекладач Морзе - це більше, ніж просто перекладач. Це спосіб зв'язатися з історією, використовуючи сучасні інструменти.\nДизайн від Алеха: stariyleg@gmail.com\nІконка - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"morse code icons\">Іконки коду Морзе створені Freepik - Flaticon</a>"
  }
}