{
  "appName": {
    "message": "Traductor de Código Morse"
  },
  "shortDesc": {
    "message": "Este es el Traductor de Código Morse: generador de código morse con sonido y texto. Aprende el alfabeto en código morse y tradúcelo a tu idioma."
  },
  "storeDesc": {
    "message": "Si deseas soporte para nuevos idiomas en el Traductor de Código Morse, simplemente escribe al desarrollador por correo electrónico. Los comentarios de los usuarios guían futuras actualizaciones, y tus ideas pueden dar forma a lo que aparecerá a continuación. La extensión ya funciona con inglés, ruso y señales internacionales, pero se planean más.\n\nEl Traductor de Código Morse está diseñado para personas que quieren una forma directa y confiable de trabajar con puntos y rayas en línea. La herramienta facilita la traducción de código morse a inglés y viceversa. Todo se ejecuta dentro del navegador, sin servidores intermedios, por lo que los resultados aparecen al instante y permanecen privados.\n\nUna de las características más prácticas es que ambos campos están sincronizados en tiempo real. Cuando escribes texto simple, el campo de señal se actualiza automáticamente. Cuando pegas o introduces puntos y rayas en el lado del patrón, el campo de texto responde de inmediato. La extensión siempre mantiene ambas direcciones alineadas.\n\nTambién hay una simulación de tecla de telégrafo. Este botón especial te permite marcar ritmos a mano. El modo se puede activar por separado, convirtiendo tu teclado o mouse en una herramienta de entrada simple. Cada toque genera un patrón, y la traducción aparece en la ventana de texto de inmediato. Se siente casi como usar una máquina histórica adaptada para el navegador.\n\nPor qué la gente instala este traductor:\nConversión en línea sin software adicional\n\nSincronización automática entre ambos campos\n\nUna referencia clara del alfabeto en código morse dentro de la aplicación\n\nModo de tecla de telégrafo para marcar señales\n\nActualizaciones que amplían idiomas y características\n\nLas frases diarias son más divertidas cuando se ven a través de señales. Puedes usar el convertidor de código morse para ver cómo se ve “hola”, e incluso los saludos cortos pueden adquirir un tono juguetón. Algunas personas experimentan con \"te amo\" en código morse para mensajes creativos, mientras que otros revisan \"sos\" en código morse o \"sos en código morse\" para practicar en emergencias. El sistema tiene una larga tradición en el mundo de la radio, donde los operadores a menudo utilizan códigos cortos y abreviaturas:\n73 (--... ...--): significa “mejores deseos” y se usa para finalizar un contacto de manera cortés.\n\n88 (---.. ---..): representa “besos”, a menudo compartidos entre amigos o colegas.\n\nCQ (-.-. --.-): una llamada general a todos los operadores, traducida como “llamada para ti”.\n\nGM (--. --): “buenos días”, GA (--. .-): “buenas tardes”, GE (--. .): “buenas noches”, GN (--. -.): “buenas noches”.\n\nR (.-.): una señal de confirmación que significa “recibido” o “entendido”.\n\nPSE (.--. ... .): abreviatura de “por favor”, utilizada en solicitudes corteses.\n\nIncluso secuencias inusuales como ..---...._, _ _.., o _. _. se decodifican sin demora, haciendo que cada línea de puntos y rayas sea parte de un lenguaje vivo.\n▸ Casos de uso comunes incluyen:\nMaestros que explican qué es el código morse durante la clase\n\nEstudiantes practicando proyectos de inglés a código morse\n\nAficionados trabajando con números en código morse en su tiempo libre\n\nHistoriadores mostrando el código sos en morse como parte de la cultura\n\nCreadores utilizando herramientas de creación de código morse para diseño\n\nLa extensión también funciona como un decodificador de código morse. Pega cualquier secuencia, y la traducción a texto simple aparece de inmediato. Ya sea que pruebes _. _ o secuencias más largas como //, la herramienta muestra el significado claramente. Sin adivinaciones, sin demoras, solo interacción fluida. Para muchos aprendices, esta se convierte en la forma más sencilla de entrenar y convertir morse a inglés en tiempo real.\n\n1️⃣ Beneficios a simple vista:\nFácil introducción al alfabeto morse\n\nDecodificación de \"no\" en código morse y otras frases\n\nUna oportunidad para estudiar letras en código morse en palabras\n\nCombinaciones creativas como // para experimentos\n\nEl sonido añade otra dimensión. El traductor puede reproducir los patrones que creas. También te permite cambiar la velocidad de reproducción, por lo que los puntos cortos y las rayas más largas coinciden con tu ritmo. Puedes ralentizarlo para practicar o acelerarlo para mayor realismo. Incluso hay una opción para exportar señales y guardarlas en un archivo WAV para escucharlas más tarde.\n\n➤ A quién le gustará:\nEstudiantes explorando el código sos morse como parte de proyectos\n\nMaestros preparando ilustraciones claras\n\nFanáticos de la radio decodificando \"sos en código morse\" por diversión\n\nDiseñadores inspirados por el ritmo de las señales\n\nCualquiera que quiera traducir código morse sin esfuerzo\n\nLa privacidad siempre se respeta. La extensión se ejecuta completamente dentro del navegador, sin información enviada. Tus experimentos con este código morse para entrenamiento del alfabeto o trabajo creativo permanecen solo contigo.\n\n2️⃣ Preguntas frecuentes:\n¿Puede el Traductor de Código Morse convertir a inglés de inmediato? Sí, instantáneamente.\n\n¿Hay un convertidor de código morse para letras y números? Sí, todo está cubierto.\n\n¿Simula una máquina de código morse? Sí, a través de la función de toque.\n\n¿Puedo ajustar el sonido? Sí, se puede cambiar la velocidad, y la reproducción se puede exportar como WAV.\n\n¿Hay un generador de código morse incluido? Sí, puedes crear y probar tus propias señales.\n\n¿La extensión maneja patrones inusuales? Sí, decodifica incluso secuencias raras.\n\n3️⃣ Razones para instalar hoy:\nPractica con la tecla de telégrafo en su propio modo\n\nCambia entre código morse para el alfabeto y palabras completas\n\nExplora señales como \"sos en código morse\" sin confusión\n\nDisfruta de actualizaciones con más idiomas y características\n\nConfía en este traductor como una herramienta de aprendizaje diaria\n\nAl final, el Traductor de Código Morse es más que un traductor. Es una forma de conectar con la historia mientras usas herramientas modernas.  \nDiseño de Aleh: stariyleg@gmail.com  \nIcono - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"morse code icons\">Iconos de código morse creados por Freepik - Flaticon</a>"
  }
}