{
  "appName": {
    "message": "Bộ dịch mã Morse"
  },
  "shortDesc": {
    "message": "Đây là Bộ dịch mã Morse – bộ phát mã morse với âm thanh và văn bản. Học bảng chữ cái mã morse và dịch sang ngôn ngữ của bạn."
  },
  "storeDesc": {
    "message": "Nếu bạn muốn hỗ trợ cho các ngôn ngữ mới trong Bộ dịch mã Morse, chỉ cần viết email cho nhà phát triển. Phản hồi từ người dùng hướng dẫn các bản cập nhật trong tương lai, và ý tưởng của bạn có thể định hình những gì sẽ xuất hiện tiếp theo. Bộ mở rộng này đã hoạt động với tiếng Anh, tiếng Nga và các tín hiệu quốc tế, nhưng còn nhiều ngôn ngữ khác đang được lên kế hoạch.\n\nBộ dịch mã Morse được thiết kế cho những người muốn có một cách trực tiếp và đáng tin cậy để làm việc với các dấu chấm và dấu gạch trực tuyến. Công cụ này giúp việc dịch mã Morse sang tiếng Anh và ngược lại trở nên đơn giản. Mọi thứ chạy bên trong trình duyệt, không có máy chủ ở giữa, vì vậy kết quả xuất hiện ngay lập tức và vẫn giữ được tính riêng tư.\n\nMột trong những tính năng thực tiễn nhất là cả hai trường đều được đồng bộ hóa theo thời gian thực. Khi bạn gõ văn bản thông thường, trường tín hiệu sẽ tự động cập nhật. Khi bạn dán hoặc nhập các dấu chấm và dấu gạch vào bên mẫu, trường văn bản sẽ phản hồi ngay lập tức. Bộ mở rộng luôn giữ cho cả hai hướng được căn chỉnh.\n\nCũng có một mô phỏng phím điện báo. Nút đặc biệt này cho phép bạn gõ nhịp bằng tay. Chế độ này có thể được kích hoạt riêng biệt, biến bàn phím hoặc chuột của bạn thành một công cụ nhập liệu đơn giản. Mỗi lần gõ tạo ra một mẫu, và bản dịch xuất hiện trong cửa sổ văn bản ngay lập tức. Nó cảm giác gần như như đang sử dụng một máy móc lịch sử được điều chỉnh cho trình duyệt.\n\nTại sao mọi người cài đặt bộ dịch này:\nChuyển đổi trực tuyến mà không cần phần mềm bổ sung\n\nĐồng bộ tự động giữa cả hai trường\n\nMột tài liệu tham khảo bảng chữ cái mã Morse rõ ràng bên trong ứng dụng\n\nChế độ phím điện báo để gõ tín hiệu\n\nCập nhật mở rộng ngôn ngữ và tính năng\n\nCác cụm từ hàng ngày trở nên thú vị hơn khi được xem qua các tín hiệu. Bạn có thể sử dụng bộ chuyển đổi mã Morse để xem “xin chào” trông như thế nào, và ngay cả những lời chào ngắn cũng có thể mang một tông vui tươi. Một số người thử nghiệm với \"tôi yêu bạn\" trong mã Morse cho những thông điệp sáng tạo, trong khi những người khác kiểm tra \"sos\" trong mã Morse hoặc \"sos en code morse\" để thực hành khẩn cấp. Hệ thống này có một truyền thống lâu dài trong thế giới radio, nơi các điều hành viên thường sử dụng các mã ngắn và viết tắt:\n73 (--... ...--): có nghĩa là “chúc tốt đẹp” và được sử dụng để kết thúc một cuộc liên lạc một cách lịch sự.\n\n88 (---.. ---..): đại diện cho “hôn,” thường được chia sẻ giữa bạn bè hoặc đồng nghiệp.\n\nCQ (-.-. --.-): một cuộc gọi chung đến tất cả các điều hành viên, được dịch là “gọi đến bạn.”\n\nGM (--. --): “chào buổi sáng,” GA (--. .-): “chào buổi chiều,” GE (--. .): “chào buổi tối,” GN (--. -.): “chúc ngủ ngon.”\n\nR (.-.): một tín hiệu xác nhận có nghĩa là “đã nhận” hoặc “đã hiểu.”\n\nPSE (.--. ... .): viết tắt cho “xin vui lòng,” được sử dụng trong các yêu cầu lịch sự.\n\nNgay cả những chuỗi không bình thường như ..---...._, _ _.., hoặc _. _. cũng được giải mã mà không bị chậm trễ, khiến mỗi dòng dấu chấm và dấu gạch trở thành một phần của một ngôn ngữ sống động.\n▸ Các trường hợp sử dụng phổ biến bao gồm:\nGiáo viên giải thích mã Morse trong lớp học\n\nHọc sinh thực hành các dự án từ tiếng Anh sang mã Morse\n\nNgười đam mê làm việc với các số mã Morse trong thời gian rảnh\n\nNhà sử học trình bày mã sos trong mã Morse như một phần của văn hóa\n\nNhà sáng tạo sử dụng công cụ tạo mã Morse cho thiết kế\n\nBộ mở rộng cũng hoạt động như một bộ giải mã mã Morse. Dán bất kỳ chuỗi nào, và bản dịch sang văn bản thông thường xuất hiện ngay lập tức. Dù bạn thử nghiệm với _. _ hay các chuỗi dài hơn như //, công cụ sẽ hiển thị ý nghĩa một cách rõ ràng. Không cần đoán, không có độ trễ, chỉ có sự tương tác mượt mà. Đối với nhiều người học, đây trở thành cách đơn giản nhất để luyện tập và chuyển đổi mã Morse sang tiếng Anh theo thời gian thực.\n1️⃣ Lợi ích tóm tắt:\nGiới thiệu dễ dàng về bảng chữ cái mã Morse\n\nGiải mã \"không\" trong mã Morse và các cụm từ khác\n\nCơ hội để nghiên cứu các chữ cái mã Morse trong từ\n\nCác kết hợp sáng tạo như // cho các thí nghiệm\n\nÂm thanh thêm một chiều kích khác. Bộ dịch có thể phát lại các mẫu bạn tạo ra. Nó cũng cho phép bạn thay đổi tốc độ phát lại, vì vậy các dấu chấm ngắn và các dấu gạch dài hơn phù hợp với nhịp độ của bạn. Bạn có thể làm chậm lại để luyện tập hoặc tăng tốc để thực tế hơn. Còn có tùy chọn xuất tín hiệu và lưu chúng trong tệp WAV để nghe sau.\n\n➤ Ai sẽ thích nó:\nHọc sinh khám phá mã sos morse như một phần của các dự án\n\nGiáo viên chuẩn bị các minh họa rõ ràng\n\nNgười hâm mộ radio giải mã sos en code morse để giải trí\n\nNhà thiết kế được truyền cảm hứng từ nhịp điệu của các tín hiệu\n\nBất kỳ ai muốn dịch mã Morse mà không cần nỗ lực\n\nQuyền riêng tư luôn được tôn trọng. Bộ mở rộng chạy hoàn toàn bên trong trình duyệt, không có thông tin nào được gửi đi. Những thử nghiệm của bạn với mã Morse cho việc luyện tập bảng chữ cái hoặc công việc sáng tạo vẫn chỉ thuộc về bạn.\n\n2️⃣ Câu hỏi thường gặp:\nBộ dịch mã Morse có thể chuyển đổi sang tiếng Anh ngay lập tức không? Có, ngay lập tức.\n\nCó bộ chuyển đổi mã Morse cho chữ cái và số không? Có, mọi thứ đều được bao phủ.\n\nNó có mô phỏng một máy mã Morse không? Có, thông qua tính năng gõ.\n\nTôi có thể điều chỉnh âm thanh không? Có, tốc độ có thể được thay đổi, và phát lại có thể được xuất dưới dạng WAV.\n\nCó bộ tạo mã Morse nào được bao gồm không? Có, bạn có thể tạo và thử nghiệm các tín hiệu của riêng mình.\n\nBộ mở rộng có xử lý các mẫu không bình thường không? Có, nó giải mã ngay cả những chuỗi hiếm.\n\n3️⃣ Lý do để cài đặt hôm nay:\nLuyện tập với phím điện báo trong chế độ riêng của nó\n\nChuyển đổi giữa mã Morse cho bảng chữ cái và từ hoàn chỉnh\n\nKhám phá các tín hiệu như sos en code morse mà không bị nhầm lẫn\n\nTận hưởng các bản cập nhật với nhiều ngôn ngữ và tính năng hơn\n\nDựa vào bộ dịch này như một công cụ học tập hàng ngày\n\nCuối cùng, Bộ dịch mã Morse không chỉ là một bộ dịch. Nó là một cách để kết nối với lịch sử trong khi sử dụng các công cụ hiện đại.\nThiết kế bởi Aleh: stariyleg@gmail.com\nBiểu tượng - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"morse code icons\">Biểu tượng mã Morse được tạo bởi Freepik - Flaticon</a>"
  }
}