{
  "appName": {
    "message": "Tagasalin ng Morse Code"
  },
  "shortDesc": {
    "message": "Ito ang Tagasalin ng Morse Code – tagagawa ng morse code na may tunog at teksto. Matutunan ang alpabeto ng morse code at isalin ito sa iyong wika."
  },
  "storeDesc": {
    "message": "Kung nais mo ng suporta para sa mga bagong wika sa Tagasalin ng Morse Code, mag-email lamang sa developer. Ang mga puna mula sa mga gumagamit ay nagbibigay ng gabay sa mga susunod na update, at ang iyong mga ideya ay maaaring humubog sa mga susunod na tampok. Ang extension ay kasalukuyang gumagana sa Ingles, Ruso, at Pandaigdigang mga signal, ngunit may mga karagdagang wika na nakaplano.\n\nAng Tagasalin ng Morse Code ay dinisenyo para sa mga tao na nais ng isang tuwirang at maaasahang paraan upang magtrabaho sa mga tuldok at gitling online. Pinadali ng tool ang pagsasalin ng morse code sa Ingles at pabalik. Lahat ay tumatakbo sa loob ng browser, nang walang mga server sa pagitan, kaya ang mga resulta ay lumalabas kaagad at nananatiling pribado.\n\nIsa sa mga pinaka-praktikal na tampok ay ang parehong mga larangan ay naka-synchronize sa real time. Kapag nag-type ka ng plain text, ang signal field ay nag-a-update nang awtomatiko. Kapag nag-paste o naglagay ka ng mga tuldok at gitling sa pattern side, ang text field ay tumutugon kaagad. Palaging pinapanatili ng extension ang parehong direksyon na naka-align.\n\nMayroon ding simulation ng telegraph key. Ang espesyal na button na ito ay nagpapahintulot sa iyo na tapikin ang mga ritmo sa pamamagitan ng kamay. Ang mode ay maaaring i-activate nang hiwalay, na ginagawang isang simpleng input tool ang iyong keyboard o mouse. Bawat tap ay bumubuo ng isang pattern, at ang pagsasalin ay lumalabas sa text window kaagad. Parang gumagamit ng isang makasaysayang makina na naangkop para sa browser.\n\nBakit nag-i-install ang mga tao ng tagasalin na ito:\nOnline na conversion nang walang karagdagang software\n\nAwtomatikong sync sa pagitan ng parehong mga larangan\n\nIsang malinaw na sanggunian ng morse code alphabet sa loob ng app\n\nTelegraph key mode para sa pagtapik ng mga signal\n\nMga update na nagpapalawak ng mga wika at tampok\n\nMas masaya ang mga pang-araw-araw na parirala kapag tiningnan sa pamamagitan ng mga signal. Maaari mong gamitin ang morse code converter upang makita kung paano ang hitsura ng “hello,” at kahit ang mga maiikli at simpleng pagbati ay maaaring magkaroon ng masayang tono. Ang ilang mga tao ay nag-eeksperimento sa \"i love you\" sa morse code para sa mga malikhaing mensahe, habang ang iba ay nagche-check ng \"sos\" sa morse code o \"sos en code morse\" para sa pagsasanay sa emerhensiya. Ang sistema ay may mahabang tradisyon sa mundo ng radyo, kung saan madalas na gumagamit ang mga operator ng mga maiikli at pinaikling code:\n73 (--... ...--): nangangahulugang “best wishes” at ginagamit upang tapusin ang isang contact nang magalang.\n\n88 (---.. ---..): kumakatawan sa “kisses,” kadalasang ibinabahagi sa pagitan ng mga kaibigan o kasamahan.\n\nCQ (-.-. --.-): isang pangkalahatang tawag sa lahat ng mga operator, isinasalin bilang “call to you.”\n\nGM (--. --): “good morning,” GA (--. .-): “good afternoon,” GE (--. .): “good evening,” GN (--. -.): “good night.”\n\nR (.-.): isang confirmation signal na nangangahulugang “received” o “understood.”\n\nPSE (.--. ... .): pinaikli para sa “please,” ginagamit sa magagalang na kahilingan.\n\nKahit ang mga hindi pangkaraniwang pagkakasunod-sunod tulad ng ..---...._, _ _.., o _. _. ay na-decode nang walang pagkaantala, na ginagawang bahagi ng isang buhay na wika ang bawat linya ng mga tuldok at gitling.\n▸ Karaniwang mga kaso ng paggamit ay kinabibilangan ng:\nMga guro na nagpapaliwanag kung ano ang morse code sa panahon ng klase\n\nMga estudyanteng nagsasanay ng mga proyekto mula Ingles patungong morse code\n\nMga hobbyist na nagtatrabaho sa mga numero ng morse code sa kanilang libreng oras\n\nMga historyador na nagpapakita ng sos code sa morse bilang bahagi ng kultura\n\nMga creator na gumagamit ng mga tool ng morse code para sa disenyo\n\nAng extension ay gumagana rin bilang isang morse code decoder. I-paste ang anumang pagkakasunod-sunod, at ang pagsasalin sa plain text ay lumalabas kaagad. Kung susubukan mo ang _. _ o mas mahahabang pagkakasunod-sunod tulad ng //, malinaw na ipinapakita ng tool ang kahulugan. Walang hula, walang pagkaantala, tanging maayos na interaksyon. Para sa maraming mga mag-aaral, ito ang nagiging pinakamadaling paraan upang magsanay at i-convert ang morse sa Ingles sa real time.\n1️⃣ Mga benepisyo sa isang sulyap:\nMadaling pagpapakilala sa morse alphabet\n\nPag-decode ng \"no\" sa morse code at iba pang mga parirala\n\nIsang pagkakataon upang pag-aralan ang mga titik ng morse code sa mga salita\n\nMalikhain na kumbinasyon tulad ng // para sa mga eksperimento\n\nAng tunog ay nagdadagdag ng isa pang dimensyon. Maaaring i-playback ng tagasalin ang mga pattern na iyong nilikha. Pinapayagan din nitong baguhin ang bilis ng playback, kaya ang mga maiikli at mahahabang gitling ay tumutugma sa iyong bilis. Maaari mong pabagalin ito para sa pagsasanay o pabilisin ito para sa realism. Mayroon ding opsyon na i-export ang mga signal at i-save ang mga ito sa isang WAV file para sa pakikinig sa hinaharap.\n➤ Sino ang mag-eenjoy dito:\nMga estudyanteng nag-eeksplora ng sos morse code bilang bahagi ng mga proyekto\n\nMga guro na naghahanda ng malinaw na mga ilustrasyon\n\nMga tagahanga ng radyo na nag-decode ng sos en code morse para sa kasiyahan\n\nMga designer na naiinspire ng ritmo ng mga signal\n\nSinumang nais na isalin ang morse code nang walang hirap\n\nLaging iginagalang ang privacy. Ang extension ay tumatakbo nang buo sa loob ng browser, nang walang impormasyong ipinapadala sa labas. Ang iyong mga eksperimento sa morse code para sa pagsasanay ng alphabet o malikhaing trabaho ay nananatiling iyo lamang.\n2️⃣ FAQ:\nMaaari bang i-convert ng Tagasalin ng Morse Code ang sa Ingles kaagad? Oo, kaagad.\n\nMayroon bang morse code converter para sa mga titik at numero? Oo, lahat ay sakop.\n\nNagsasagawa ba ito ng simulation ng morse code machine? Oo, sa pamamagitan ng tampok na pagtapik.\n\nMaaari ko bang ayusin ang tunog? Oo, ang bilis ay maaaring baguhin, at ang playback ay maaaring i-export bilang WAV.\n\nMayroon bang kasama na morse code generator? Oo, maaari kang lumikha at subukan ang iyong sariling mga signal.\n\nNakaharap ba ng extension ang mga hindi pangkaraniwang pattern? Oo, na-decode nito kahit ang mga bihirang pagkakasunod-sunod.\n\n3️⃣ Mga dahilan upang mag-install ngayon:\nMagsanay gamit ang telegraph key sa sarili nitong mode\n\nLumipat sa pagitan ng morse code para sa alphabet at kumpletong mga salita\n\nTuklasin ang mga signal tulad ng sos en code morse nang walang kalituhan\n\nMag-enjoy sa mga update na may higit pang mga wika at tampok\n\nUmasa sa tagasalin na ito bilang isang pang-araw-araw na tool sa pag-aaral\n\nSa huli, ang Tagasalin ng Morse Code ay higit pa sa isang tagasalin. Ito ay isang paraan upang kumonekta sa kasaysayan habang gumagamit ng mga modernong tool."
  }
}