{
  "appName": {
    "message": "Morseov kod prevodilac"
  },
  "shortDesc": {
    "message": "Ovo je Morseov kod prevodilac – generator morseovog koda sa zvukom i tekstom. Naučite abecedu morseovog koda i prevedite na svoj jezik."
  },
  "storeDesc": {
    "message": "Ako želite podršku za nove jezike u Morseov kod prevodilac, jednostavno pišite developeru putem e-pošte. Povratne informacije korisnika usmeravaju buduće ažuriranja, a vaše ideje mogu oblikovati ono što će se sledeće pojaviti. Ekstenzija već radi sa engleskim, ruskim i međunarodnim signalima, ali su planirani i drugi jezici.  \nMorseov kod prevodilac je dizajniran za ljude koji žele direktan i pouzdan način za rad sa tačkama i crtama online. Alat olakšava prevođenje morseovog koda na engleski i obrnuto. Sve se odvija unutar pretraživača, bez posredničkih servera, tako da rezultati pojavljuju odmah i ostaju privatni.  \nJedna od najpraktičnijih funkcija je da su oba polja sinhronizovana u realnom vremenu. Kada kucate običan tekst, polje signala se automatski ažurira. Kada nalepite ili unesete tačke i crte u stranu obrasca, polje teksta odmah reaguje. Ekstenzija uvek održava usklađenost u oba pravca.  \nTakođe postoji simulacija telegrafskog ključa. Ova posebna dugmad vam omogućava da tapkate ritmove ručno. Mod može biti aktiviran posebno, pretvarajući vašu tastaturu ili miša u jednostavan alat za unos. Svaki tap generiše obrazac, a prevod se odmah pojavljuje u prozoru za tekst. Oseća se gotovo kao korišćenje istorijske mašine prilagođene pretraživaču.  \nZašto ljudi instaliraju ovaj prevodilac:  \nOnline konverzija bez dodatnog softvera  \n\nAutomatska sinhronizacija između oba polja  \n\nJasna referenca na morseov alfabet unutar aplikacije  \n\nTelegrafski ključ za tapkanje signala  \n\nAžuriranja koja proširuju jezike i funkcije  \n\nSvake fraze su zabavnije kada se gledaju kroz signale. Možete koristiti konverter morseovog koda da vidite kako izgleda \"zdravo\", a čak i kratki pozdravi mogu dobiti razigran ton. Neki ljudi eksperimentišu sa \"volim te\" u morseovom kodu za kreativne poruke, dok drugi proveravaju \"sos\" u morseovom kodu ili \"sos en code morse\" za vežbu u hitnim situacijama. Sistem ima dugu tradiciju u svetu radija, gde operateri često koriste kratke kodove i skraćenice:  \n73 (--... ...--): znači \"najbolje želje\" i koristi se za ljubazno završavanje kontakta.  \n\n88 (---.. ---..): označava \"poljupce\", često deljene između prijatelja ili kolega.  \n\nCQ (-.-. --.-): opšti poziv svim operaterima, preveden kao \"poziv za vas.\"  \n\nGM (--. --): \"dobro jutro,\" GA (--. .-): \"dobar dan,\" GE (--. .): \"dobro veče,\" GN (--. -.): \"laku noć.\"  \n\nR (.-.): signal potvrde koji znači \"primalo\" ili \"razumem.\"  \n\nPSE (.--. ... .): skraćeno za \"molim,\" koristi se u ljubaznim zahtevima.  \n\nČak i neobične sekvence kao što su ..---...._, _ _.., ili _. _. se dekodiraju bez odlaganja, čineći svaku liniju tačaka i crta delom živog jezika.  \n▸ Uobičajeni slučajevi korišćenja uključuju:  \nNastavnike koji objašnjavaju šta je morseov kod tokom časa  \n\nStudente koji vežbaju projekte od engleskog do morseovog koda  \n\nHobiiste koji rade sa brojevima u morseovom kodu u slobodno vreme  \n\nIstoričare koji prikazuju sos kod u morseu kao deo kulture  \n\nKreatore koji koriste alate za kreiranje morseovog koda za dizajn  \n\nEkstenzija takođe funkcioniše kao dekoder morseovog koda. Nalepite bilo koju sekvencu, a prevod na običan tekst pojavljuje se odmah. Bilo da testirate _. _ ili duže sekvence poput //, alat jasno pokazuje značenje. Nema pogađanja, nema odlaganja, samo glatka interakcija. Za mnoge učenike ovo postaje najjednostavniji način za vežbanje i konverziju morseovog koda na engleski u realnom vremenu.  \n1️⃣ Prednosti na prvi pogled:  \nLako uvođenje u morseov alfabet  \n\nDekodiranje \"ne\" u morseovom kodu i drugih fraza  \n\nPrilika za proučavanje slova morseovog koda u rečima  \n\nKreativne kombinacije poput // za eksperimente  \n\nZvuk dodaje još jednu dimenziju. Prevodilac može reprodukovati obrasce koje kreirate. Takođe vam omogućava da promenite brzinu reprodukcije, tako da kratke tačke i duže crte odgovaraju vašem ritmu. Možete usporiti za vežbu ili ubrzati za realističnost. Postoji čak i opcija za eksportovanje signala i čuvanje u WAV datoteci za kasnije slušanje.  \n➤ Ko će uživati:  \nStudente koji istražuju kod sos morse kao deo projekata  \n\nNastavnike koji pripremaju jasne ilustracije  \n\nLjubitelje radija koji dekodiraju sos en code morse iz zabave  \n\nDizajnere inspirisane ritmom signala  \n\nBilo koga ko želi da prevodi morseov kod bez napora  \n\nPrivatnost se uvek poštuje. Ekstenzija radi potpuno unutar pretraživača, bez slanja informacija. Vaši eksperimenti sa ovim morseovim kodom za obuku abecede ili kreativni rad ostaju samo vaši.  \n2️⃣ Često postavljana pitanja:  \nMože li Morseov kod prevodilac odmah konvertovati na engleski? Da, odmah.  \n\nDa li postoji konverter morseovog koda za slova i brojeve? Da, sve je pokriveno.  \n\nDa li simulira mašinu za morseov kod? Da, kroz funkciju tapkanja.  \n\nMogu li prilagoditi zvuk? Da, brzina se može promeniti, a reprodukcija se može eksportovati kao WAV.  \n\nDa li je uključen generator morseovog koda? Da, možete kreirati i testirati svoje signale.  \n\nDa li ekstenzija obrađuje neobične obrasce? Da, dekodira čak i retke sekvence.  \n3️⃣ Razlozi za instalaciju danas:  \nVežbajte sa telegrafskim ključem u svom režimu  \n\nPrebacujte se između morseovog koda za abecedu i potpune reči  \n\nIstražujte signale poput sos en code morse bez zabune  \n\nUživajte u ažuriranjima sa više jezika i funkcija  \n\nOslonite se na ovog prevodioca kao alat za svakodnevno učenje  \n\nNa kraju, Morseov kod prevodilac je više od prevodioca. To je način povezivanja sa istorijom dok koristite moderne alate.  \nDizajn od Aleh: stariyleg@gmail.com  \nIkona - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"morse code icons\">Ikone morseovog koda kreirao Freepik - Flaticon</a>"
  }
}