{
  "appName": {
    "message": "Traduttore in codice Morse"
  },
  "shortDesc": {
    "message": "Questo è il Traduttore in codice Morse – generatore di codice morse con suono e testo. Impara l'alfabeto in codice morse e traduci nella tua lingua."
  },
  "storeDesc": {
    "message": "Se desideri supporto per nuove lingue nel Traduttore in codice Morse, scrivi semplicemente all'autore via email. Il feedback degli utenti guida i futuri aggiornamenti e le tue idee possono plasmare ciò che apparirà in seguito. L'estensione funziona già con l'inglese, il russo e segnali internazionali, ma sono previsti ulteriori aggiornamenti.\n\nIl Traduttore in codice Morse è progettato per le persone che desiderano un modo diretto e affidabile per lavorare con punti e linee online. Lo strumento semplifica la traduzione del codice Morse in inglese e viceversa. Tutto funziona all'interno del browser, senza server intermedi, quindi i risultati appaiono istantaneamente e rimangono privati.\n\nUna delle caratteristiche più pratiche è che entrambi i campi sono sincronizzati in tempo reale. Quando digiti testo normale, il campo del segnale si aggiorna automaticamente. Quando incolli o inserisci punti e linee nel lato del modello, il campo del testo risponde immediatamente. L'estensione mantiene sempre allineate entrambe le direzioni.\n\nC'è anche una simulazione della chiave telegrafica. Questo pulsante speciale ti consente di battere ritmi a mano. La modalità può essere attivata separatamente, trasformando la tua tastiera o il tuo mouse in uno strumento di input semplice. Ogni battuta genera un modello e la traduzione appare nella finestra di testo all'istante. Sembra quasi di usare una macchina storica adattata per il browser.\n\nPerché le persone installano questo traduttore:\nConversione online senza software aggiuntivo\n\nSincronizzazione automatica tra entrambi i campi\n\nUn chiaro riferimento all'alfabeto del codice Morse all'interno dell'app\n\nModalità chiave telegrafica per battere segnali\n\nAggiornamenti che espandono lingue e funzionalità\n\nLe frasi quotidiane sono più divertenti quando vengono viste attraverso i segnali. Puoi usare il convertitore di codice Morse per vedere come appare \"ciao\", e anche brevi saluti possono assumere un tono giocoso. Alcune persone sperimentano con \"ti amo\" in codice Morse per messaggi creativi, mentre altre controllano \"sos\" in codice Morse o \"sos en code morse\" per esercitazioni di emergenza. Il sistema ha una lunga tradizione nel mondo della radio, dove gli operatori usano spesso codici brevi e abbreviazioni:\n73 (--... ...--): significa \"migliori auguri\" ed è usato per concludere un contatto in modo cortese.\n\n88 (---.. ---..): sta per \"baci\", spesso condivisi tra amici o colleghi.\n\nCQ (-.-. --.-): una chiamata generale a tutti gli operatori, tradotta come \"chiamata a te\".\n\nGM (--. --): \"buongiorno\", GA (--. .-): \"buon pomeriggio\", GE (--. .): \"buona sera\", GN (--. -.): \"buona notte\".\n\nR (.-.): un segnale di conferma che significa \"ricevuto\" o \"compreso\".\n\nPSE (.--. ... .): abbreviazione di \"per favore\", usata in richieste cortesi.\n\nAnche sequenze insolite come ..---...._, _ _.., o _. _. vengono decodificate senza ritardi, rendendo ogni linea di punti e linee parte di una lingua viva.\n▸ I casi d'uso comuni includono:\nInsegnanti che spiegano cos'è il codice Morse durante la lezione\n\nStudenti che praticano progetti da inglese a codice Morse\n\nAppassionati che lavorano con numeri in codice Morse nel loro tempo libero\n\nStorici che mostrano il codice sos in Morse come parte della cultura\n\nCreatori che utilizzano strumenti per la creazione di codice Morse per il design\n\nL'estensione funziona anche come decodificatore di codice Morse. Incolla qualsiasi sequenza e la traduzione in testo normale appare all'istante. Che tu stia testando _. _ o sequenze più lunghe come //, lo strumento mostra chiaramente il significato. Niente indovinamenti, nessun ritardo, solo interazione fluida. Per molti studenti questo diventa il modo più semplice per allenarsi e convertire il Morse in inglese in tempo reale.\n1️⃣ Vantaggi a colpo d'occhio:\nFacile introduzione all'alfabeto Morse\n\nDecodifica di \"no\" in codice Morse e altre frasi\n\nUn'opportunità per studiare le lettere del codice Morse nelle parole\n\nCombinazioni creative come // per esperimenti\n\nIl suono aggiunge un'altra dimensione. Il traduttore può riprodurre i modelli che crei. Ti consente anche di cambiare la velocità di riproduzione, in modo che i punti brevi e le linee più lunghe corrispondano al tuo ritmo. Puoi rallentarlo per esercitarti o accelerarlo per realismo. C'è anche un'opzione per esportare i segnali e salvarli in un file WAV per ascoltarli in seguito.\n➤ Chi lo apprezzerà:\nStudenti che esplorano il codice sos Morse come parte di progetti\n\nInsegnanti che preparano illustrazioni chiare\n\nAppassionati di radio che decodificano \"sos en code morse\" per divertimento\n\nDesigner ispirati dal ritmo dei segnali\n\nChiunque voglia tradurre il codice Morse senza sforzo\n\nLa privacy è sempre rispettata. L'estensione funziona completamente all'interno del browser, senza informazioni inviate altrove. I tuoi esperimenti con questo codice Morse per l'allenamento dell'alfabeto o il lavoro creativo rimangono solo tuoi.\n2️⃣ FAQ:\nIl Traduttore in codice Morse può convertire in inglese immediatamente? Sì, istantaneamente.\n\nC'è un convertitore di codice Morse per lettere e numeri? Sì, tutto è coperto.\n\nSimula una macchina per codice Morse? Sì, attraverso la funzione di battitura.\n\nPosso regolare il suono? Sì, la velocità può essere cambiata e la riproduzione può essere esportata come WAV.\n\nC'è un generatore di codice Morse incluso? Sì, puoi creare e testare i tuoi segnali.\n\nL'estensione gestisce schemi insoliti? Sì, decodifica anche sequenze rare.\n\n3️⃣ Motivi per installare oggi:\nPratica con la chiave telegrafica nella sua modalità\n\nPassa tra codice Morse per l'alfabeto e parole complete\n\nEsplora segnali come \"sos en code morse\" senza confusione\n\nGoditi aggiornamenti con più lingue e funzionalità\n\nFai affidamento su questo traduttore come strumento di apprendimento quotidiano\n\nAlla fine, il Traduttore in codice Morse è più di un semplice traduttore. È un modo per connettersi con la storia utilizzando strumenti moderni.\nDesign di Aleh: stariyleg@gmail.com\nIcona - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"icona codice morse\">Icone codice Morse create da Freepik - Flaticon</a>"
  }
}