{
  "appName": {
    "message": "เครื่องแปลรหัสมอร์ส"
  },
  "shortDesc": {
    "message": "นี่คือเครื่องแปลรหัสมอร์ส – เครื่องสร้างรหัสมอร์สพร้อมเสียงและข้อความ เรียนรู้ตัวอักษรรหัสมอร์สและแปลเป็นภาษาของคุณ"
  },
  "storeDesc": {
    "message": "หากคุณต้องการการสนับสนุนภาษาใหม่ๆ ใน Morse Code Translator เพียงส่งอีเมลถึงนักพัฒนาซอฟต์แวร์ ความคิดเห็นจากผู้ใช้จะเป็นแนวทางในการอัปเดตในอนาคต และไอเดียของคุณสามารถกำหนดสิ่งที่จะเกิดขึ้นต่อไปได้ ส่วนขยายนี้รองรับสัญญาณภาษาอังกฤษ รัสเซีย และสัญญาณสากลอยู่แล้ว แต่มีแผนที่จะรองรับสัญญาณอื่นๆ เพิ่มเติม\n เครื่องมือแปลรหัสมอร์ส (Morse Code Translator) ออกแบบมาสำหรับผู้ที่ต้องการวิธีการแปลรหัสจุดและเส้นประออนไลน์ที่ตรงไปตรงมาและเชื่อถือได้ เครื่องมือนี้ช่วยให้การแปลรหัสมอร์สเป็นภาษาอังกฤษและกลับไปกลับมาเป็นเรื่องง่าย ทุกอย่างทำงานภายในเบราว์เซอร์ โดยไม่มีเซิร์ฟเวอร์แทรกแซง ผลลัพธ์จึงปรากฏขึ้นทันทีและยังคงเป็นส่วนตัว\n หนึ่งในคุณสมบัติที่ใช้งานได้จริงที่สุดคือฟิลด์ทั้งสองจะซิงโครไนซ์กันแบบเรียลไทม์ เมื่อคุณพิมพ์ข้อความธรรมดา ฟิลด์สัญญาณจะอัปเดตโดยอัตโนมัติ เมื่อคุณวางหรือใส่จุดและขีดลงในด้านรูปแบบ ฟิลด์ข้อความจะตอบสนองทันที ส่วนขยายจะรักษาให้ทั้งสองทิศทางตรงกันเสมอ\n นอกจากนี้ยังมีการจำลองปุ่มโทรเลขอีกด้วย ปุ่มพิเศษนี้ช่วยให้คุณแตะจังหวะด้วยมือได้ โหมดนี้สามารถเปิดใช้งานแยกต่างหาก เปลี่ยนแป้นพิมพ์หรือเมาส์ของคุณให้กลายเป็นเครื่องมือป้อนข้อมูลง่ายๆ การแตะแต่ละครั้งจะสร้างรูปแบบ และการแปลจะปรากฏในหน้าต่างข้อความทันที ให้ความรู้สึกเหมือนได้ใช้เครื่องรุ่นเก่าที่ปรับให้เหมาะกับเบราว์เซอร์\n เหตุใดผู้คนจึงติดตั้งโปรแกรมแปลนี้:\n การแปลงออนไลน์โดยไม่ต้องใช้ซอฟต์แวร์เพิ่มเติม\n\n\n การซิงค์อัตโนมัติระหว่างทั้งสองฟิลด์\n\n\n การอ้างอิงตัวอักษรรหัสมอร์สที่ชัดเจนภายในแอป\n\n\n โหมดคีย์โทรเลขสำหรับการดักสัญญาณ\n\n\n อัปเดตที่ขยายภาษาและคุณสมบัติ\n\n\n วลีประจำวันจะสนุกยิ่งขึ้นเมื่อมองผ่านสัญญาณ คุณสามารถใช้ตัวแปลงรหัสมอร์สเพื่อดูว่า &quot;สวัสดี&quot; เป็นอย่างไร และแม้แต่คำทักทายสั้นๆ ก็สามารถเปลี่ยนเป็นน้ำเสียงที่สนุกสนานได้ บางคนลองใช้คำว่า &quot;ฉันรักเธอ&quot; ในรหัสมอร์สเพื่อส่งข้อความที่สร้างสรรค์ ในขณะที่บางคนใช้คำว่า &quot;sos&quot; ในรหัสมอร์ส หรือ &quot;sos ในรหัสมอร์ส&quot; สำหรับการฝึกซ้อมฉุกเฉิน ระบบนี้มีประวัติยาวนานในวงการวิทยุ โดยผู้ปฏิบัติงานมักใช้รหัสสั้นและตัวย่อ:\n 73 (--... ...--): แปลว่า “ขอให้โชคดี” และใช้เพื่อสิ้นสุดการติดต่ออย่างสุภาพ\n\n\n 88 (---.. ---..): ย่อมาจาก “kisses” ซึ่งมักจะแบ่งปันกันระหว่างเพื่อนหรือเพื่อนร่วมงาน\n\n\n CQ (-.-. --.-): การโทรทั่วไปถึงตัวดำเนินการทั้งหมด แปลว่า &quot;โทรหาคุณ&quot;\n\n\n GM (--. --): “สวัสดีตอนเช้า” GA (--. .-): “สวัสดีตอนบ่าย” GE (--. .): “สวัสดีตอนเย็น” GN (--. -.): “ราตรีสวัสดิ์”\n\n\n R (.-.): สัญญาณยืนยันที่แปลว่า “ได้รับ” หรือ “เข้าใจแล้ว”\n\n\n PSE (.--. ... .) ย่อมาจาก “please” ใช้ในการขอร้องอย่างสุภาพ\n\n\n แม้แต่ลำดับที่ผิดปกติ เช่น ..---...._, _ _.., หรือ _. _. ก็สามารถถอดรหัสได้โดยไม่ชักช้า ทำให้ทุกบรรทัดที่มีจุดและเส้นประเป็นส่วนหนึ่งของภาษาที่มีชีวิต\n ▸ กรณีการใช้งานทั่วไป ได้แก่:\n ครูที่อธิบายรหัสมอร์สในชั้นเรียน\n\n\n นักเรียนฝึกภาษาอังกฤษกับโครงการรหัสมอร์ส\n\n\n ผู้ที่ชื่นชอบงานอดิเรกที่ทำงานกับหมายเลขรหัสมอร์สในเวลาว่าง\n\n\n นักประวัติศาสตร์แสดงรหัส SOS ในรูปแบบมอร์สเป็นส่วนหนึ่งของวัฒนธรรม\n\n\n ผู้สร้างใช้เครื่องมือสร้างรหัสมอร์สเพื่อการออกแบบ\n\n\n ส่วนขยายนี้ยังทำหน้าที่เป็นตัวถอดรหัสรหัสมอร์สได้อีกด้วย เพียงวางลำดับใดๆ ก็ได้ ระบบจะแปลเป็นข้อความธรรมดาทันที ไม่ว่าคุณจะทดสอบ _, _ หรือลำดับที่ยาวกว่าเช่น // เครื่องมือจะแสดงความหมายได้อย่างชัดเจน ไม่ต้องเดา ไม่ต้องหน่วงเวลา มีเพียงการโต้ตอบที่ราบรื่น สำหรับผู้เรียนหลายคน นี่เป็นวิธีที่ง่ายที่สุดในการฝึกและแปลงรหัสมอร์สเป็นภาษาอังกฤษแบบเรียลไทม์\n 1️⃣ ประโยชน์โดยสังเขป:\n การแนะนำตัวอักษรมอร์สอย่างง่าย\n\n\n การถอดรหัสคำว่า &quot;ไม่&quot; ในรหัสมอร์สและวลีอื่นๆ\n\n\n โอกาสเรียนรู้ตัวอักษรรหัสมอร์สในคำศัพท์\n\n\n การผสมผสานที่สร้างสรรค์ เช่น // สำหรับการทดลอง\n\n\n เสียงช่วยเพิ่มมิติใหม่ให้กับคุณ ตัวแปลสามารถเล่นรูปแบบที่คุณสร้างขึ้นได้ นอกจากนี้ยังช่วยให้คุณเปลี่ยนความเร็วในการเล่นได้ เพื่อให้จุดสั้นและเส้นประยาวสอดคล้องกับจังหวะของคุณ คุณสามารถลดความเร็วลงเพื่อฝึกฝน หรือเพิ่มความเร็วเพื่อความสมจริง นอกจากนี้ยังมีตัวเลือกในการส่งออกสัญญาณและบันทึกเป็นไฟล์ WAV เพื่อฟังในภายหลังอีกด้วย\n ➤ ใครจะสนุกไปกับมัน:\n นักศึกษาสำรวจโค้ด SOS มอร์ส เป็นส่วนหนึ่งของโครงการ\n\n\n ครูเตรียมภาพประกอบที่ชัดเจน\n\n\n แฟนวิทยุถอดรหัสสัญญาณ SOS และรหัสมอร์สเพื่อความสนุกสนาน\n\n\n นักออกแบบได้รับแรงบันดาลใจจากจังหวะของสัญญาณ\n\n\n ใครก็ตามที่ต้องการแปลรหัสมอร์สแบบไม่ต้องใช้ความพยายาม\n\n\n ความเป็นส่วนตัวได้รับการเคารพเสมอ ส่วนขยายนี้ทำงานภายในเบราว์เซอร์อย่างสมบูรณ์ โดยไม่มีข้อมูลส่งออกไป การทดลองของคุณกับรหัสมอร์สนี้เพื่อฝึกฝนตัวอักษรหรืองานสร้างสรรค์ยังคงเป็นของคุณ\n 2️⃣ คำถามที่พบบ่อย:\n เครื่องแปลรหัส Morse สามารถแปลงเป็นภาษาอังกฤษได้ทันทีหรือไม่? ใช่ ทันที\n\n\n มีตัวแปลงรหัสมอร์สสำหรับตัวอักษรและตัวเลขไหม? ใช่ครับ ครอบคลุมทุกอย่างเลย\n\n\n มันจำลองเครื่องรหัสมอร์สหรือเปล่าครับ? ใช่ครับ ผ่านฟีเจอร์การแตะครับ\n\n\n ฉันสามารถปรับเสียงได้ไหม? ได้ สามารถเปลี่ยนความเร็วได้ และส่งออกเป็น WAV ได้\n\n\n มีเครื่องสร้างรหัสมอร์สรวมอยู่ด้วยไหม? ใช่ คุณสามารถสร้างและทดสอบสัญญาณของคุณเองได้\n\n\n ส่วนขยายนี้จัดการกับรูปแบบที่ไม่ธรรมดาได้หรือไม่? ใช่แล้ว มันถอดรหัสได้แม้กระทั่งลำดับที่หายาก\n\n\n 3️⃣ เหตุผลที่ควรติดตั้งวันนี้:\n ฝึกฝนการใช้ปุ่มโทรเลขในโหมดของตัวเอง\n\n\n สลับระหว่างรหัสมอร์สสำหรับตัวอักษรและคำที่สมบูรณ์\n\n\n สำรวจสัญญาณเช่น SOS และรหัสมอร์สโดยไม่สับสน\n\n\n เพลิดเพลินกับการอัปเดตด้วยภาษาและคุณสมบัติเพิ่มเติม\n\n\n อาศัยเครื่องมือแปลนี้เป็นเครื่องมือการเรียนรู้รายวัน\n\n\n ท้ายที่สุดแล้ว Morse Code Translator ไม่ได้เป็นเพียงแค่เครื่องมือแปลเท่านั้น แต่ยังเป็นช่องทางในการเชื่อมโยงกับประวัติศาสตร์ควบคู่ไปกับการใช้เครื่องมือที่ทันสมัย\n ออกแบบโดย Aleh: stariyleg@gmail.com\n ไอคอน - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"ไอคอนรหัสมอร์ส\">ไอคอนรหัส Morse สร้างโดย Freepik - Flaticon</a>\n"
  }
}