{
  "appName": {
    "message": "Morse'i koodi tõlkija"
  },
  "shortDesc": {
    "message": "See on Morse'i koodi tõlkija – morse'i koodi generaator heliga ja tekstiga. Õpi morse'i koodi tähestikku ja tõlgi oma keelde."
  },
  "storeDesc": {
    "message": "Kui soovite Morse'i koodi tõlkija jaoks uusi keeli toetada, kirjutage lihtsalt arendajale e-posti teel. Kasutajate tagasiside suunab tulevasi uuendusi ja teie ideed võivad kujundada seda, mis järgmiseks ilmub. Tõlkija töötab juba inglise, vene ja rahvusvaheliste signaalidega, kuid rohkem on plaanis.\n\nMorse'i koodi tõlkija on mõeldud inimestele, kes soovivad veebis punktide ja kriipsudega töötamiseks otsest ja usaldusväärset viisi. Tööriist muudab morse koodi tõlkimise inglise keelde ja tagasi lihtsaks. Kõik töötab brauseris, ilma serveriteta, nii et tulemused ilmuvad koheselt ja jäävad privaatsuseks.\n\nÜks praktilisemaid funktsioone on see, et mõlemad väljad sünkroniseeritakse reaalajas. Kui kirjutate tavalist teksti, uuendatakse signaaliväli automaatselt. Kui kleepite või sisestate punktid ja kriipsud mustri küljele, reageerib tekstiväli kohe. Tõlkija hoiab alati mõlemad suunad joondatuna.\n\nSeal on ka telegraafivõtme simulatsioon. See eriline nupp võimaldab teil rütme käsitsi klõpsata. Režiimi saab eraldi aktiveerida, muutes teie klaviatuuri või hiire lihtsaks sisendvahendiks. Iga klõps genereerib mustri ja tõlge ilmub tekstiaknasse kohe. See tundub peaaegu nagu ajaloolise masina kasutamine, mis on kohandatud brauserile.\n\nMiks inimesed installivad selle tõlkija:\nVeebipõhine konversioon ilma lisatarkvarata\n\nAutomaatne sünkroonimine mõlema välja vahel\n\nSelge morse'i koodi tähestiku viide rakenduses\n\nTelegraafivõtme režiim signaalide klõpsamiseks\n\nUuendused, mis laiendavad keeli ja funktsioone\n\nIgapäevased fraasid on lõbusamad, kui neid vaadata signaalide kaudu. Saate kasutada morse'i koodi konverterit, et näha, kuidas \"tere\" välja näeb, ja isegi lühikesed tervitused võivad omandada mängulise tooni. Mõned inimesed katsetavad \"ma armastan sind\" morse'i koodis loovate sõnumite jaoks, samas kui teised kontrollivad \"sos\" morse'i koodis või \"sos\" en \"code morse\" hädaolukordade harjutamiseks. Süsteemil on pikk traditsioon raadiomaailmas, kus operaatorid kasutavad sageli lühikoode ja lühendeid:\n73 (--... ...--): tähendab \"parimaid soove\" ja seda kasutatakse kontakti viisakaks lõpetamiseks.\n\n88 (---.. ---..): tähistab \"suudlusi\", mida jagatakse sageli sõprade või kolleegide vahel.\n\nCQ (-.-. --.-): üldine kutse kõigile operaatoritele, tõlgituna kui \"kutse teile\".\n\nGM (--. --): \"head hommikut\", GA (--. .-): \"head pärastlõunat\", GE (--. .): \"head õhtut\", GN (--. -.): \"head ööd\".\n\nR (.-.): kinnitussignaal, mis tähendab \"vastu võetud\" või \"mõistetud\".\n\nPSE (.--. ... .): lühend sõnast \"palun\", mida kasutatakse viisakates palvustes.\n\nIsegi ebatavalised järjestused nagu ..---...._, _ _.. või _. _. dekodeeritakse viivitamatult, muutes iga punkti ja kriipsu elava keele osaks.\n▸ Tavalised kasutusjuhtumid hõlmavad:\nÕpetajad, kes selgitavad, mis on morse'i kood klassis\n\nÕpilased, kes harjutavad inglise keelt morse'i koodi projektides\n\nHobiharrastajad, kes töötavad morse'i koodi numbritega oma vabal ajal\n\nAjaloolased, kes näitavad sos koodi morse'i osana kultuurist\n\nLoovad inimesed, kes kasutavad morse'i koodi loomise tööriistu disainiks\n\nTõlkija töötab ka morse'i koodi dekooderina. Kleepige ükskõik milline järjestus ja tõlge tavalisse teksti ilmub kohe. Ükskõik, kas testite _. _ või pikemaid järjestusi nagu //, tööriist näitab tähendust selgelt. Pole oletusi, pole viivitusi, ainult sujuv interaktsioon. Paljudele õppijatele muutub see kõige lihtsamaks viisiks harjutamiseks ja morse'i inglise keelde reaalajas konverteerimiseks.\n\n1️⃣ Eelised lühidalt:\nLihtne sissejuhatus morse'i tähestikku\n\nDekodeerimine \"ei\" morse'i koodis ja teistes fraasides\n\nVõimalus uurida morse'i koodi tähti sõnades\n\nLoovad kombinatsioonid nagu // katsetamiseks\n\nHeli lisab teise mõõtme. Tõlkija suudab mängida tagasi mustreid, mida te loote. Samuti võimaldab see muuta taasesituse kiirus, nii et lühikesed punktid ja pikemad kriipsud vastavad teie tempole. Saate seda aeglustada harjutamiseks või kiirendada realismi jaoks. On isegi võimalus eksportida signaale ja salvestada need WAV-failina hilisemaks kuulamiseks.\n\n➤ Kes sellest naudib:\nÕpilased, kes uurivad sos morse'i koodi osana projektidest\n\nÕpetajad, kes valmistavad ette selgeid illustreerimisi\n\nRaadiofännid, kes dekodeerivad sos en code morse'i lõbuks\n\nDisainerid, keda inspireerivad signaalide rütmid\n\nIgaüks, kes soovib morse'i koodi tõlkida vaevata\n\nPrivaatsust austatakse alati. Tõlkija töötab täielikult brauseris, ilma et teavet saadetaks. Teie katsetused selle morse'i koodiga tähestiku harjutamiseks või loovaks tööks jäävad ainult teie omaks.\n\n2️⃣ KKK:\nKas Morse'i koodi tõlkija suudab kohe inglise keelde konverteerida? Jah, koheselt.\n\nKas on olemas morse'i koodi konverter tähed ja numbrid jaoks? Jah, kõik on kaetud.\n\nKas see simuleerib morse'i koodi masinat? Jah, klõpsamise funktsiooni kaudu.\n\nKas ma saan heli reguleerida? Jah, kiirus võib muutuda ja taasesitust saab eksportida WAV-na.\n\nKas seal on kaasas morse'i koodi generaator? Jah, saate luua ja testida oma signaale.\n\nKas tõlkija suudab käsitleda ebatavalisi mustreid? Jah, see dekodeerib isegi haruldasi järjestusi.\n\n3️⃣ Põhjused, miks täna installida:\nHarjutage telegraafivõtmega oma režiimis\n\nVahetage morse'i koodi tähestiku ja täisteksti vahel\n\nUurige signaale nagu sos en code morse ilma segaduseta\n\nNaudi uuendusi rohkemate keelte ja funktsioonidega\n\nToetuge sellele tõlkijale igapäevase õppevahendina\n\nLõpuks on Morse'i koodi tõlkija rohkem kui lihtsalt tõlkija. See on viis ajaloo ühendamiseks, kasutades kaasaegseid tööriistu.\nDisain: Aleh: stariyleg@gmail.com\nIkoon - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"morse code icons\">Morse'i koodi ikoonid on loonud Freepik - Flaticon</a>"
  }
}