{
  "appName": {
    "message": "మోర్స్ కోడ్ అనువాదకుడు"
  },
  "shortDesc": {
    "message": "ఇది మోర్స్ కోడ్ ట్రాన్స్‌లేటర్ - ధ్వని &amp; వచనంతో కూడిన మోర్స్ కోడ్ జనరేటర్. మోర్స్ కోడ్ వర్ణమాల నేర్చుకోండి మరియు మీ భాషలోకి అనువదించండి."
  },
  "storeDesc": {
    "message": "మోర్స్ కోడ్ ట్రాన్స్‌లేటర్‌లో కొత్త భాషలకు మద్దతు కావాలంటే, డెవలపర్‌కు ఇమెయిల్ ద్వారా వ్రాయండి. వినియోగదారుల నుండి వచ్చే అభిప్రాయం భవిష్యత్ నవీకరణలకు మార్గనిర్దేశం చేస్తుంది మరియు మీ ఆలోచనలు తదుపరి ఏమి కనిపించాలో రూపొందించగలవు. పొడిగింపు ఇప్పటికే ఇంగ్లీష్, రష్యన్ మరియు అంతర్జాతీయ సంకేతాలతో పనిచేస్తుంది, కానీ మరిన్నింటిని ప్లాన్ చేస్తున్నారు.\n మోర్స్ కోడ్ ట్రాన్స్‌లేటర్ ఆన్‌లైన్‌లో చుక్కలు మరియు డాష్‌లతో పనిచేయడానికి ప్రత్యక్ష మరియు నమ్మదగిన మార్గాన్ని కోరుకునే వ్యక్తుల కోసం రూపొందించబడింది. ఈ సాధనం మోర్స్ కోడ్‌ను ఆంగ్లంలోకి మరియు తిరిగి అనువదించడాన్ని సులభతరం చేస్తుంది. సర్వర్‌లు లేకుండా ప్రతిదీ బ్రౌజర్ లోపల నడుస్తుంది, కాబట్టి ఫలితాలు తక్షణమే కనిపిస్తాయి మరియు ప్రైవేట్‌గా ఉంటాయి.\n అత్యంత ఆచరణాత్మక లక్షణాలలో ఒకటి ఏమిటంటే రెండు ఫీల్డ్‌లు నిజ సమయంలో సమకాలీకరించబడతాయి. మీరు సాదా వచనాన్ని టైప్ చేసినప్పుడు, సిగ్నల్ ఫీల్డ్ స్వయంచాలకంగా నవీకరించబడుతుంది. మీరు నమూనా వైపు చుక్కలు-మరియు-డాష్‌లను అతికించినప్పుడు లేదా నమోదు చేసినప్పుడు, టెక్స్ట్ ఫీల్డ్ వెంటనే స్పందిస్తుంది. పొడిగింపు ఎల్లప్పుడూ రెండు దిశలను సమలేఖనం చేస్తుంది.\n టెలిగ్రాఫ్ కీ సిమ్యులేషన్ కూడా ఉంది. ఈ ప్రత్యేక బటన్ మీరు చేతితో లయలను నొక్కడానికి అనుమతిస్తుంది. మోడ్‌ను విడిగా సక్రియం చేయవచ్చు, మీ కీబోర్డ్ లేదా మౌస్‌ను సాధారణ ఇన్‌పుట్ సాధనంగా మారుస్తుంది. ప్రతి ట్యాప్ ఒక నమూనాను ఉత్పత్తి చేస్తుంది మరియు అనువాదం ఒకేసారి టెక్స్ట్ విండోలో కనిపిస్తుంది. ఇది బ్రౌజర్‌కు అనుగుణంగా ఉన్న చారిత్రాత్మక యంత్రాన్ని ఉపయోగించినట్లుగా అనిపిస్తుంది.\n ప్రజలు ఈ అనువాదకుడిని ఎందుకు ఇన్‌స్టాల్ చేస్తారు:\n అదనపు సాఫ్ట్‌వేర్ లేకుండా ఆన్‌లైన్ మార్పిడి\n\n\n రెండు ఫీల్డ్‌ల మధ్య ఆటోమేటిక్ సింక్\n\n\n యాప్ లోపల స్పష్టమైన మోర్స్ కోడ్ వర్ణమాల సూచన\n\n\n సిగ్నల్స్ ట్యాపింగ్ కోసం టెలిగ్రాఫ్ కీ మోడ్\n\n\n భాషలు మరియు లక్షణాలను విస్తరించే నవీకరణలు\n\n\n సిగ్నల్స్ ద్వారా చూసినప్పుడు రోజువారీ పదబంధాలు మరింత సరదాగా ఉంటాయి. &quot;హలో&quot; ఎలా కనిపిస్తుందో చూడటానికి మీరు మోర్స్ కోడ్ కన్వర్టర్‌ను ఉపయోగించవచ్చు మరియు చిన్న శుభాకాంక్షలు కూడా ఉల్లాసభరితమైన స్వరాన్ని పొందుతాయి. కొంతమంది సృజనాత్మక సందేశాల కోసం మోర్స్ కోడ్‌లో ఐ లవ్ యుతో ప్రయోగాలు చేస్తారు, మరికొందరు అత్యవసర సాధన కోసం మోర్స్ కోడ్‌లో sos లేదా sos en కోడ్ మోర్స్‌ను తనిఖీ చేస్తారు. రేడియో ప్రపంచంలో ఈ వ్యవస్థకు సుదీర్ఘ సంప్రదాయం ఉంది, ఇక్కడ ఆపరేటర్లు తరచుగా చిన్న కోడ్‌లు మరియు సంక్షిప్తాలను ఉపయోగిస్తారు:\n 73 (--... ...--): అంటే “శుభాకాంక్షలు” మరియు మర్యాదపూర్వకంగా పరిచయాన్ని ముగించడానికి ఉపయోగించబడుతుంది.\n\n\n 88 (---.. ---..): స్నేహితులు లేదా సహోద్యోగుల మధ్య తరచుగా పంచుకునే “ముద్దులు” అని అర్థం.\n\n\n CQ (-.-. --.-): అన్ని ఆపరేటర్లకు సాధారణ కాల్, దీనిని &quot;మీకు కాల్ చేయి&quot; అని అనువదిస్తారు.\n\n\n GM (--. --): “శుభోదయం,” GA (--. .-): “శుభ మధ్యాహ్నం,” GE (--. .): “శుభ సాయంత్రం,” GN (--. -.): “శుభ రాత్రి.”\n\n\n R (.-.): &quot;అందుకున్నది&quot; లేదా &quot;అర్థం చేసుకుంది&quot; అనే అర్థం వచ్చే నిర్ధారణ సంకేతం.\n\n\n PSE (.--. ... .): మర్యాదపూర్వక అభ్యర్థనలలో ఉపయోగించే “దయచేసి” కి సంక్షిప్త రూపం.\n\n\n ..---...._, _ _.., లేదా _. _. వంటి అసాధారణ సన్నివేశాలు కూడా ఆలస్యం లేకుండా డీకోడ్ చేయబడతాయి, ప్రతి చుక్కలు మరియు డాష్‌లు సజీవ భాషలో భాగంగా ఉంటాయి.\n ▸ సాధారణ వినియోగ సందర్భాలలో ఇవి ఉన్నాయి:\n తరగతి సమయంలో మోర్స్ కోడ్ అంటే ఏమిటో వివరించే ఉపాధ్యాయులు\n\n\n ఇంగ్లీష్ నుండి మోర్స్ కోడ్ ప్రాజెక్టులను అభ్యసిస్తున్న విద్యార్థులు\n\n\n ఖాళీ సమయంలో మోర్స్ కోడ్ నంబర్లతో పనిచేసే అభిరుచి గలవారు\n\n\n సంస్కృతిలో భాగంగా మోర్స్ భాషలో సోస్ కోడ్‌ను చూపిస్తున్న చరిత్రకారులు\n\n\n డిజైన్ కోసం మోర్స్ కోడ్ క్రియేటర్ సాధనాలను ఉపయోగించే క్రియేటర్లు\n\n\n ఈ ఎక్స్‌టెన్షన్ మోర్స్ కోడ్ డీకోడర్‌గా కూడా పనిచేస్తుంది. ఏదైనా సీక్వెన్స్‌ను అతికించండి, మరియు అనువాదం సాదా వచనానికి ఒకేసారి కనిపిస్తుంది. మీరు _. _ లేదా // వంటి పొడవైన సీక్వెన్స్‌లను పరీక్షించినా, సాధనం అర్థాన్ని స్పష్టంగా చూపిస్తుంది. ఊహించడం లేదు, ఆలస్యం లేదు, సున్నితమైన పరస్పర చర్య మాత్రమే. చాలా మంది అభ్యాసకులకు ఇది శిక్షణ ఇవ్వడానికి మరియు నిజ సమయంలో మోర్స్‌ను ఆంగ్లంలోకి మార్చడానికి సులభమైన మార్గం అవుతుంది.\n 1️⃣ ప్రయోజనాలు క్లుప్తంగా:\n మోర్స్ వర్ణమాలకు సులభమైన పరిచయం\n\n\n మోర్స్ కోడ్ మరియు ఇతర పదబంధాలలో నో యొక్క డీకోడింగ్\n\n\n మోర్స్ కోడ్ అక్షరాలను పదాలలో అధ్యయనం చేసే అవకాశం\n\n\n ప్రయోగాల కోసం // వంటి సృజనాత్మక కలయికలు\n\n\n ధ్వని మరొక కోణాన్ని జోడిస్తుంది. అనువాదకుడు మీరు సృష్టించిన నమూనాలను తిరిగి ప్లే చేయగలడు. ఇది ప్లేబ్యాక్ వేగాన్ని మార్చడానికి కూడా మిమ్మల్ని అనుమతిస్తుంది, కాబట్టి చిన్న చుక్కలు మరియు పొడవైన డాష్‌లు మీ వేగానికి సరిపోతాయి. మీరు సాధన కోసం దీన్ని నెమ్మదించవచ్చు లేదా వాస్తవికత కోసం వేగవంతం చేయవచ్చు. సిగ్నల్‌లను ఎగుమతి చేయడానికి మరియు తరువాత వినడానికి వాటిని WAV ఫైల్‌లో సేవ్ చేయడానికి కూడా ఒక ఎంపిక ఉంది.\n ➤ దీన్ని ఎవరు ఆనందిస్తారు:\n ప్రాజెక్టులలో భాగంగా కోడ్ సోస్ మోర్స్‌ను అన్వేషిస్తున్న విద్యార్థులు\n\n\n స్పష్టమైన దృష్టాంతాలను సిద్ధం చేస్తున్న ఉపాధ్యాయులు\n\n\n వినోదం కోసం సోస్ ఎన్ కోడ్ మోర్స్‌ను డీకోడ్ చేస్తున్న రేడియో అభిమానులు\n\n\n సంకేతాల లయ ద్వారా ప్రేరణ పొందిన డిజైనర్లు\n\n\n మోర్స్ కోడ్‌ను ఎటువంటి ప్రయత్నం లేకుండా అనువదించాలనుకునే ఎవరైనా\n\n\n గోప్యత ఎల్లప్పుడూ గౌరవించబడుతుంది. ఈ పొడిగింపు పూర్తిగా బ్రౌజర్ లోపలే నడుస్తుంది, ఎటువంటి సమాచారం పంపబడదు. అక్షర శిక్షణ లేదా సృజనాత్మక పని కోసం ఈ మోర్స్ కోడ్‌తో మీ ప్రయోగాలు మీవిగానే ఉంటాయి.\n 2️⃣ తరచుగా అడిగే ప్రశ్నలు:\n మోర్స్ కోడ్ ట్రాన్స్‌లేటర్‌ని వెంటనే ఇంగ్లీషులోకి మార్చగలరా? అవును, తక్షణమే.\n\n\n అక్షరాలు మరియు సంఖ్యల కోసం మోర్స్ కోడ్ కన్వర్టర్ ఉందా? అవును, ప్రతిదీ కవర్ చేయబడింది.\n\n\n ఇది మోర్స్ కోడ్ యంత్రాన్ని అనుకరిస్తుందా? అవును, ట్యాపింగ్ ఫీచర్ ద్వారా.\n\n\n నేను ధ్వనిని సర్దుబాటు చేయవచ్చా? అవును, వేగాన్ని మార్చవచ్చు మరియు ప్లేబ్యాక్‌ను WAVగా ఎగుమతి చేయవచ్చు.\n\n\n మోర్స్ కోడ్ జనరేటర్ చేర్చబడిందా? అవును, మీరు మీ స్వంత సిగ్నల్‌లను సృష్టించుకోవచ్చు మరియు పరీక్షించవచ్చు.\n\n\n ఈ ఎక్స్‌టెన్షన్ అసాధారణ నమూనాలను నిర్వహిస్తుందా? అవును, ఇది అరుదైన సన్నివేశాలను కూడా డీకోడ్ చేస్తుంది.\n\n\n 3️⃣ ఈరోజే ఇన్‌స్టాల్ చేసుకోవడానికి కారణాలు:\n టెలిగ్రాఫ్ కీతో దాని స్వంత మోడ్‌లో ప్రాక్టీస్ చేయండి\n\n\n వర్ణమాల మరియు పూర్తి పదాల కోసం మోర్స్ కోడ్ మధ్య మారండి\n\n\n ఎటువంటి గందరగోళం లేకుండా sos en code morse వంటి సంకేతాలను అన్వేషించండి.\n\n\n మరిన్ని భాషలు మరియు లక్షణాలతో నవీకరణలను ఆస్వాదించండి\n\n\n రోజువారీ అభ్యాస సాధనంగా ఈ అనువాదకుడిపై ఆధారపడండి.\n\n\n చివరికి, మోర్స్ కోడ్ ట్రాన్స్‌లేటర్ కేవలం అనువాదకుడి కంటే ఎక్కువ. ఇది ఆధునిక సాధనాలను ఉపయోగిస్తూనే చరిత్రతో కనెక్ట్ అవ్వడానికి ఒక మార్గం.\n అలెహ్ డిజైన్: stariyleg@gmail.com\n ఐకాన్ - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"మోర్స్ కోడ్ చిహ్నాలు\">ఫ్రీపిక్ - ఫ్లాటికాన్ సృష్టించిన మోర్స్ కోడ్ చిహ్నాలు</a>\n"
  }
}