{
  "appName": {
    "message": "মর্স কোড অনুবাদক"
  },
  "shortDesc": {
    "message": "এটি মর্স কোড অনুবাদক – সাউন্ড এবং টেক্সট সহ মর্স কোড জেনারেটর। মর্স কোড অক্ষর শিখুন এবং আপনার ভাষায় অনুবাদ করুন।"
  },
  "storeDesc": {
    "message": "যদি আপনি মর্স কোড অনুবাদক-এ নতুন ভাষার জন্য সমর্থন চান, তাহলে শুধু ডেভেলপারকে ইমেইল করে লিখুন। ব্যবহারকারীদের প্রতিক্রিয়া ভবিষ্যতের আপডেটগুলিকে নির্দেশ করে, এবং আপনার ধারণাগুলি পরবর্তী কী হবে তা গঠন করতে পারে। এই এক্সটেনশন ইতিমধ্যে ইংরেজি, রাশিয়ান এবং আন্তর্জাতিক সংকেতের সাথে কাজ করে, তবে আরও ভাষার পরিকল্পনা রয়েছে।\nমর্স কোড অনুবাদক তাদের জন্য ডিজাইন করা হয়েছে যারা অনলাইনে ডট এবং ড্যাশের সাথে কাজ করার একটি সরাসরি এবং নির্ভরযোগ্য উপায় চান। এই টুলটি মর্স কোডকে ইংরেজিতে এবং আবার অনুবাদ করা সহজ করে তোলে। সবকিছু ব্রাউজারের ভিতরে চলে, মাঝখানে কোন সার্ভার নেই, তাই ফলাফলগুলি তাত্ক্ষণিকভাবে প্রদর্শিত হয় এবং ব্যক্তিগত থাকে।\nসবচেয়ে কার্যকর বৈশিষ্ট্যগুলির মধ্যে একটি হল উভয় ক্ষেত্রই বাস্তব সময়ে সমন্বয়িত। যখন আপনি সাধারণ টেক্সট টাইপ করেন, সংকেত ক্ষেত্রটি স্বয়ংক্রিয়ভাবে আপডেট হয়। যখন আপনি প্যাটার্ন সাইডে ডট এবং ড্যাশ পেস্ট বা প্রবেশ করেন, টেক্সট ক্ষেত্রটি তাত্ক্ষণিকভাবে প্রতিক্রিয়া জানায়। এক্সটেনশনটি সবসময় উভয় দিককে সঙ্গতিপূর্ণ রাখে।\nএছাড়াও একটি টেলিগ্রাফ কী সিমুলেশন রয়েছে। এই বিশেষ বোতামটি আপনাকে হাতে রিদম ট্যাপ করতে দেয়। মোডটি আলাদাভাবে সক্রিয় করা যেতে পারে, আপনার কীবোর্ড বা মাউসকে একটি সহজ ইনপুট টুলে পরিণত করে। প্রতিটি ট্যাপ একটি প্যাটার্ন তৈরি করে, এবং অনুবাদটি একবারে টেক্সট উইন্ডোতে প্রদর্শিত হয়। এটি প্রায় ব্রাউজারের জন্য অভিযোজিত একটি ঐতিহাসিক মেশিন ব্যবহারের মতো অনুভব করে।\nকেন মানুষ এই অনুবাদকটি ইনস্টল করে:\nঅতিরিক্ত সফটওয়্যার ছাড়াই অনলাইন রূপান্তর\n\n\nউভয় ক্ষেত্রের মধ্যে স্বয়ংক্রিয় সমন্বয়\n\n\nঅ্যাপের ভিতরে একটি পরিষ্কার মর্স কোড অ্যালফাবেট রেফারেন্স\n\n\nসংকেত ট্যাপ করার জন্য টেলিগ্রাফ কী মোড\n\n\nভাষা এবং বৈশিষ্ট্যগুলি সম্প্রসারিত করার জন্য আপডেট\n\n\nদৈনিক বাক্যাংশ সংকেতের মাধ্যমে দেখা হলে আরও মজাদার। আপনি দেখতে পারেন \"হ্যালো\" মর্স কোডে কেমন দেখায়, এবং এমনকি সংক্ষিপ্ত অভিবাদনও একটি মজাদার সুর নিতে পারে। কিছু মানুষ সৃজনশীল বার্তাগুলির জন্য মর্স কোডে \"আই লাভ ইউ\" নিয়ে পরীক্ষা করে, যখন অন্যরা জরুরী অনুশীলনের জন্য মর্স কোডে \"এসওএস\" বা \"এসওএস এন কোড মর্স\" পরীক্ষা করে। এই সিস্টেমের একটি দীর্ঘ ঐতিহ্য রয়েছে রেডিও জগতে, যেখানে অপারেটররা প্রায়শই সংক্ষিপ্ত কোড এবং সংক্ষিপ্ত রূপ ব্যবহার করেন:\n73 (--... ...--): \"শ্রেষ্ঠ শুভেচ্ছা\" বোঝায় এবং একটি যোগাযোগ বিনয়ের সাথে শেষ করতে ব্যবহৃত হয়।\n\n\n88 (---.. ---..): \"চুম্বন\" বোঝায়, প্রায়শই বন্ধু বা সহকর্মীদের মধ্যে ভাগ করা হয়।\n\n\nCQ (-.-. --.-): সমস্ত অপারেটরদের জন্য একটি সাধারণ কল, যা \"আপনাকে কল\" হিসাবে অনুবাদ করা হয়।\n\n\nGM (--. --): \"শুভ সকাল,\" GA (--. .-): \"শুভ অপরাহ্ন,\" GE (--. .): \"শুভ সন্ধ্যা,\" GN (--. -.): \"শুভ রাত্রি।\"\n\n\nR (.-.): একটি নিশ্চিতকরণ সংকেত যার অর্থ \"গ্রহণ করা হয়েছে\" বা \"বুঝতে পেরেছি।\"\n\n\nPSE (.--. ... .): \"দয়া করে\" এর সংক্ষিপ্ত রূপ, বিনয়ের সাথে অনুরোধে ব্যবহৃত হয়।\n\n\nএমনকি অস্বাভাবিক সিকোয়েন্স যেমন ..---...._, _ _.., বা _. _. বিলম্ব ছাড়াই ডিকোড করা হয়, প্রতিটি ডট এবং ড্যাশের লাইন একটি জীবন্ত ভাষার অংশ হয়ে ওঠে।\n▸ সাধারণ ব্যবহার ক্ষেত্রগুলির মধ্যে রয়েছে:\nশিক্ষকরা ক্লাসে মর্স কোড কী তা ব্যাখ্যা করেন\n\n\nশিক্ষার্থীরা ইংরেজি থেকে মর্স কোড প্রকল্পে অনুশীলন করছে\n\n\nশখের মানুষরা তাদের অবসর সময়ে মর্স কোডের সংখ্যা নিয়ে কাজ করছেন\n\n\nঐতিহাসিকরা সংস্কৃতির অংশ হিসেবে মর্স কোডে এসওএস কোড দেখাচ্ছেন\n\n\nসৃজনশীলরা ডিজাইনের জন্য মর্স কোড নির্মাতা টুল ব্যবহার করছেন\n\n\nএক্সটেনশনটি একটি মর্স কোড ডিকোডার হিসাবেও কাজ করে। যেকোনো সিকোয়েন্স পেস্ট করুন, এবং সাধারণ টেক্সটে অনুবাদটি একবারে প্রদর্শিত হয়। আপনি যদি পরীক্ষা করেন _. _ বা // এর মতো দীর্ঘ সিকোয়েন্স, টুলটি স্পষ্টভাবে অর্থ দেখায়। কোন অনুমান নেই, কোন বিলম্ব নেই, শুধুমাত্র মসৃণ ইন্টারঅ্যাকশন। অনেক শিক্ষার্থীর জন্য এটি প্রশিক্ষণ নেওয়ার এবং বাস্তব সময়ে মর্সকে ইংরেজিতে রূপান্তর করার সবচেয়ে সহজ উপায় হয়ে ওঠে।\n1️⃣ সুবিধাগুলি এক নজরে:\nমর্স অ্যালফাবেটের সহজ পরিচিতি\n\n\nমর্স কোডে \"না\" এবং অন্যান্য বাক্যাংশের ডিকোডিং\n\n\nশব্দে মর্স কোডের অক্ষর অধ্যয়ন করার সুযোগ\n\n\nপরীক্ষার জন্য সৃজনশীল সংমিশ্রণ যেমন //\n\n\nশব্দ একটি নতুন মাত্রা যোগ করে। অনুবাদকটি আপনার তৈরি করা প্যাটার্নগুলি পুনরায় বাজাতে পারে। এটি আপনাকে প্লেব্যাকের গতি পরিবর্তন করতে দেয়, তাই সংক্ষিপ্ত ডট এবং দীর্ঘ ড্যাশ আপনার গতির সাথে মেলে। আপনি অনুশীলনের জন্য এটি ধীর করতে পারেন বা বাস্তবতার জন্য এটি দ্রুত করতে পারেন। এমনকি সংকেতগুলি রপ্তানি করার এবং পরে শোনার জন্য WAV ফাইলে সংরক্ষণ করার একটি বিকল্পও রয়েছে।\n➤ কে এটি উপভোগ করবে:\nপ্রকল্পের অংশ হিসেবে কোড এসওএস মর্স অন্বেষণকারী শিক্ষার্থীরা\n\n\nস্পষ্ট চিত্রণ প্রস্তুতকারী শিক্ষকরা\n\n\nমজা করার জন্য এসওএস এন কোড মর্স ডিকোডিং করা রেডিও প্রেমীরা\n\n\nসংকেতগুলির রিদম দ্বারা অনুপ্রাণিত ডিজাইনাররা\n\n\nযে কেউ সহজে মর্স কোড অনুবাদ করতে চায়\n\n\nগোপনীয়তা সর্বদা সম্মানিত হয়। এক্সটেনশনটি সম্পূর্ণরূপে ব্রাউজারের ভিতরে চলে, কোন তথ্য বাইরে পাঠানো হয় না। অ্যালফাবেট প্রশিক্ষণ বা সৃজনশীল কাজের জন্য এই মর্স কোডের সাথে আপনার পরীক্ষাগুলি কেবল আপনারই থাকে।\n2️⃣ সাধারণ জিজ্ঞাসা:\nমর্স কোড অনুবাদক কি সঙ্গে সঙ্গে ইংরেজিতে রূপান্তর করতে পারে? হ্যাঁ, তাত্ক্ষণিকভাবে।\n\n\nকি অক্ষর এবং সংখ্যা জন্য একটি মর্স কোড রূপান্তরকারী আছে? হ্যাঁ, সবকিছু কভার করা হয়েছে।\n\n\nএটি কি একটি মর্স কোড মেশিনের সিমুলেশন করে? হ্যাঁ, ট্যাপিং বৈশিষ্ট্যের মাধ্যমে।\n\n\nআমি কি শব্দ সামঞ্জস্য করতে পারি? হ্যাঁ, গতি পরিবর্তন করা যেতে পারে, এবং প্লেব্যাক WAV হিসাবে রপ্তানি করা যেতে পারে।\n\n\nকি একটি মর্স কোড জেনারেটর অন্তর্ভুক্ত? হ্যাঁ, আপনি আপনার নিজস্ব সংকেত তৈরি এবং পরীক্ষা করতে পারেন।\n\n\nএক্সটেনশন কি অস্বাভাবিক প্যাটার্ন পরিচালনা করে? হ্যাঁ, এটি এমনকি বিরল সিকোয়েন্সও ডিকোড করে।\n\n\n3️⃣ আজ ইনস্টল করার কারণ:\nনিজস্ব মোডে টেলিগ্রাফ কী দিয়ে অনুশীলন করুন\n\n\nঅক্ষর এবং সম্পূর্ণ শব্দের জন্য মর্স কোডের মধ্যে স্যুইচ করুন\n\n\nকোন বিভ্রান্তি ছাড়াই এসওএস এন কোড মর্সের মতো সংকেতগুলি অন্বেষণ করুন\n\n\nআরও ভাষা এবং বৈশিষ্ট্য সহ আপডেট উপভোগ করুন\n\n\nএই অনুবাদকটিকে দৈনিক শেখার টুল হিসাবে নির্ভর করুন\n\n\nশেষে, মর্স কোড অনুবাদক একটি অনুবাদক থেকে বেশি। এটি আধুনিক টুল ব্যবহার করে ইতিহাসের সাথে সংযোগ করার একটি উপায়। \nডিজাইন করেছেন আলেহ: stariyleg@gmail.com\nআইকন - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"morse code icons\">মর্স কোড আইকন তৈরি করেছেন ফ্রিপিক - ফ্ল্যাটিকন</a>"
  }
}