{
  "appName": {
    "message": "Morse-kód Fordító"
  },
  "shortDesc": {
    "message": "Ez a Morse-kód Fordító – morze kód generátor hanggal és szöveggel. Tanuld meg a morze kód ábécét, és fordítsd le a saját nyelvedre."
  },
  "storeDesc": {
    "message": "Ha új nyelvek támogatására van szüksége a Morse-kód Fordítóban, csak írjon az fejlesztőnek e-mailben. A felhasználók visszajelzései irányítják a jövőbeli frissítéseket, és az ötletei formálhatják, hogy mi jelenik meg legközelebb. Az extension már működik angol, orosz és nemzetközi jelekkel, de további nyelvek is tervezettek.\n\nA Morse-kód Fordító olyan emberek számára készült, akik közvetlen és megbízható módot keresnek a pontok és vonalak online kezelésére. Az eszköz egyszerűvé teszi a morze kód angolra való fordítását és vissza. Minden a böngészőn belül fut, nincs köztes szerver, így az eredmények azonnal megjelennek és privátak maradnak.\n\nAz egyik legpraktikusabb funkció, hogy mindkét mező valós időben szinkronizálva van. Amikor sima szöveget ír, a jelmező automatikusan frissül. Amikor pontokat és vonalakat másol be vagy ír be a minta oldalra, a szövegmező azonnal reagál. Az extension mindig fenntartja mindkét irány szinkronizáltságát.\n\nVan egy távíró kulcs szimuláció is. Ez a különleges gomb lehetővé teszi, hogy kézzel ütemeket koppintson. A mód külön aktiválható, így a billentyűzetét vagy az egérét egyszerű bemeneti eszközzé alakíthatja. Minden koppintás egy mintát generál, és a fordítás azonnal megjelenik a szöveges ablakban. Olyan érzés, mintha egy történelmi gépet használnánk, amelyet a böngészőhöz alakítottak.\n\nMiért telepítik ezt a fordítót az emberek:\nOnline átalakítás extra szoftver nélkül\n\nAutomatikus szinkronizálás a két mező között\n\nEgyértelmű morze kód ábécé referencia az alkalmazáson belül\n\nTávíró kulcs mód a jelek koppintásához\n\nFrissítések, amelyek bővítik a nyelveket és funkciókat\n\nA napi kifejezések szórakoztatóbbak, ha jeleken keresztül nézzük őket. Használhatja a morze kód átalakítót, hogy lássa, hogyan néz ki a \"hello\", és még a rövid üdvözletek is játékos hangvételt kaphatnak. Néhányan kísérleteznek az \"szeretlek\" morze kóddal kreatív üzenetekhez, míg mások az \"sos\" morze kódot vagy az \"sos en code morse\"-t ellenőrzik vészhelyzeti gyakorláshoz. A rendszernek hosszú hagyománya van a rádiós világban, ahol az operátorok gyakran használnak rövid kódokat és rövidítéseket:\n73 (--... ...--): azt jelenti, hogy \"legjobb kívánságok\", és udvariasan zárja le a kapcsolatot.\n\n88 (---.. ---..): a \"puszik\" rövidítése, amelyet gyakran osztanak meg barátok vagy kollégák között.\n\nCQ (-.-. --.-): általános hívás minden operátor számára, lefordítva \"hívás önnek\".\n\nGM (--. --): \"jó reggelt\", GA (--. .-): \"jó délutánt\", GE (--. .): \"jó estét\", GN (--. -.): \"jó éjszakát\".\n\nR (.-.): egy megerősítő jel, amely azt jelenti, hogy \"megkaptam\" vagy \"értettem\".\n\nPSE (.--. ... .): a \"kérem\" rövidítése, udvarias kérésekhez használják.\n\nMég a szokatlan szekvenciák, mint például ..---...._, _ _.., vagy _. _. is késlekedés nélkül dekódolva vannak, így minden pont és vonal a nyelv élő részévé válik.\n▸ Gyakori felhasználási esetek:\nTanárok, akik elmagyarázzák, mi a morze kód az órán\n\nDiákok, akik angolról morze kódra gyakorolnak\n\nHobbi kedvelők, akik szabadidejükben morze kód számokkal foglalkoznak\n\nTörténészek, akik a morze sos kódot a kultúra részeként mutatják be\n\nKreatívok, akik morze kód készítő eszközöket használnak a tervezéshez\n\nAz extension morze kód dekóderként is működik. Másoljon be bármilyen szekvenciát, és a fordítás sima szövegre azonnal megjelenik. Akár a _. _-t, akár hosszabb szekvenciákat, mint például //, az eszköz világosan mutatja a jelentést. Nincs találgatás, nincs késlekedés, csak zökkenőmentes interakció. Sok tanuló számára ez válik a legegyszerűbb módjává a morze angolra való átkonvertálásának valós időben.\n\n1️⃣ Előnyök egy pillantásra:\nKönnyű bevezetés a morze ábécébe\n\nDekódolás a \"no\" morze kódban és más kifejezésekben\n\nLehetőség a morze kód betűinek tanulmányozására szavakban\n\nKreatív kombinációk, mint például // kísérletezéshez\n\nA hang új dimenziót ad. A fordító vissza tudja játszani az Ön által létrehozott mintákat. Lehetővé teszi a lejátszási sebesség megváltoztatását is, így a rövid pontok és hosszú vonalak illeszkednek az Ön tempójához. Lehet lassítani a gyakorlás érdekében, vagy felgyorsítani a realizmus érdekében. Van egy lehetőség a jelek exportálására és WAV fájlba mentésére későbbi hallgatásra.\n\n➤ Ki fogja élvezni:\nDiákok, akik a morze sos kódot projektjeik részeként fedezik fel\n\nTanárok, akik világos illusztrációkat készítenek\n\nRádiórajongók, akik szórakozásból dekódolják az sos en code morse-t\n\nTervezők, akiket a jelek ritmusa inspirál\n\nBárki, aki erőfeszítés nélkül szeretné lefordítani a morze kódot\n\nA magánélet mindig tiszteletben van tartva. Az extension teljesen a böngészőn belül fut, és nincs információ elküldve. Az Ön kísérletei ezzel a morze kóddal az ábécé tanulmányozásához vagy kreatív munkához csak az Öné maradnak.\n\n2️⃣ GYIK:\nA Morse-kód Fordító azonnal le tudja fordítani angolra? Igen, azonnal.\n\nVan morze kód átalakító betűk és számok számára? Igen, minden lefedett.\n\nSzimulálja a morze kód gépet? Igen, a koppintási funkción keresztül.\n\nBeállíthatom a hangot? Igen, a sebesség változtatható, és a lejátszás WAV formátumban exportálható.\n\nVan benne morze kód generátor? Igen, létrehozhatja és tesztelheti a saját jeleit.\n\nAz extension kezeli a szokatlan mintákat? Igen, még a ritka szekvenciákat is dekódolja.\n\n3️⃣ Okok, hogy ma telepítse:\nGyakorolja a távíró kulcsot a saját módjában\n\nVáltson a morze kód és a teljes szavak között\n\nFedezze fel az sos en code morse jeleket zűrzavar nélkül\n\nÉlvezze a frissítéseket több nyelvvel és funkcióval\n\nBízzon ebben a fordítóban mint napi tanulási eszközben\n\nA végén a Morse-kód Fordító több mint egy fordító. Ez egy módja a történelemmel való kapcsolódásnak, miközben modern eszközöket használ.\nTervezte Aleh: stariyleg@gmail.com\nIkon - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"morse code icons\">Morse kód ikonok készítette Freepik - Flaticon</a>"
  }
}