{
  "appName": {
    "message": "Μεταφραστής Κώδικα Μορς"
  },
  "shortDesc": {
    "message": "Αυτός είναι ο Μεταφραστής Κώδικα Μορς – γεννήτρια κώδικα Μορς με ήχο και κείμενο. Μάθετε το αλφάβητο του κώδικα Μορς και μεταφράστε το στη γλώσσα σας."
  },
  "storeDesc": {
    "message": "Αν θέλετε υποστήριξη για νέες γλώσσες στον Μεταφραστή Κώδικα Μορς, απλά γράψτε στον προγραμματιστή μέσω email. Η ανατροφοδότηση από τους χρήστες καθοδηγεί τις μελλοντικές ενημερώσεις, και οι ιδέες σας μπορούν να διαμορφώσουν το τι θα εμφανιστεί στη συνέχεια. Η επέκταση ήδη λειτουργεί με αγγλικά, ρωσικά και διεθνή σήματα, αλλά προγραμματίζονται περισσότερα.\n\nΟ Μεταφραστής Κώδικα Μορς έχει σχεδιαστεί για άτομα που θέλουν έναν άμεσο και αξιόπιστο τρόπο να εργάζονται με τελείες και παύλες online. Το εργαλείο διευκολύνει τη μετάφραση του κώδικα Μορς στα αγγλικά και πίσω. Όλα λειτουργούν μέσα στον περιηγητή, χωρίς διακομιστές ενδιάμεσα, έτσι ώστε τα αποτελέσματα να εμφανίζονται άμεσα και να παραμένουν ιδιωτικά.\n\nΜία από τις πιο πρακτικές δυνατότητες είναι ότι και τα δύο πεδία συγχρονίζονται σε πραγματικό χρόνο. Όταν πληκτρολογείτε απλό κείμενο, το πεδίο σήματος ενημερώνεται αυτόματα. Όταν επικολλάτε ή εισάγετε τελείες και παύλες στην πλευρά του προτύπου, το πεδίο κειμένου ανταποκρίνεται αμέσως. Η επέκταση διατηρεί πάντα ευθυγραμμισμένες και τις δύο κατευθύνσεις.\n\nΥπάρχει επίσης προσομοίωση κλειδιού τηλέγραφου. Αυτό το ειδικό κουμπί σας επιτρέπει να χτυπάτε ρυθμούς με το χέρι. Η λειτουργία μπορεί να ενεργοποιηθεί ξεχωριστά, μετατρέποντας το πληκτρολόγιο ή το ποντίκι σας σε ένα απλό εργαλείο εισόδου. Κάθε χτύπημα δημιουργεί ένα πρότυπο, και η μετάφραση εμφανίζεται στο παράθυρο κειμένου αμέσως. Αισθάνεστε σχεδόν σαν να χρησιμοποιείτε μια ιστορική μηχανή προσαρμοσμένη για τον περιηγητή.\n\nΓιατί οι άνθρωποι εγκαθιστούν αυτόν τον μεταφραστή:\nOnline μετατροπή χωρίς επιπλέον λογισμικό\n\nΑυτόματος συγχρονισμός μεταξύ και των δύο πεδίων\n\nΜια σαφής αναφορά αλφαβήτου κώδικα Μορς μέσα στην εφαρμογή\n\nΛειτουργία κλειδιού τηλέγραφου για χτύπημα σημάτων\n\nΕνημερώσεις που επεκτείνουν γλώσσες και δυνατότητες\n\nΟι καθημερινές φράσεις είναι πιο διασκεδαστικές όταν τις βλέπετε μέσω σημάτων. Μπορείτε να χρησιμοποιήσετε τον μετατροπέα κώδικα Μορς για να δείτε πώς φαίνεται το \"γεια\", και ακόμη και οι σύντομες χαιρετισμοί μπορούν να αποκτήσουν μια παιχνιδιάρικη διάθεση. Ορισμένοι άνθρωποι πειραματίζονται με το \"σ' αγαπώ\" σε κώδικα Μορς για δημιουργικά μηνύματα, ενώ άλλοι ελέγχουν το \"sos\" σε κώδικα Μορς ή \"sos en code morse\" για πρακτική έκτακτης ανάγκης. Το σύστημα έχει μια μακρά παράδοση στον κόσμο του ραδιοφώνου, όπου οι χειριστές συχνά χρησιμοποιούν σύντομους κωδικούς και συντομογραφίες:\n73 (--... ...--): σημαίνει \"καλύτερες ευχές\" και χρησιμοποιείται για να τελειώσει μια επαφή ευγενικά.\n\n88 (---.. ---..): σημαίνει \"φιλιά\", συχνά μοιράζονται μεταξύ φίλων ή συναδέλφων.\n\nCQ (-.-. --.-): μια γενική κλήση προς όλους τους χειριστές, μεταφρασμένη ως \"κλήση προς εσάς\".\n\nGM (--. --): \"καλημέρα\", GA (--. .-): \"καλησπέρα\", GE (--. .): \"καλησπέρα\", GN (--. -.): \"καληνύχτα\".\n\nR (.-.): ένα σήμα επιβεβαίωσης που σημαίνει \"λήφθηκε\" ή \"κατανοήθηκε\".\n\nPSE (.--. ... .): συντομογραφία για \"παρακαλώ\", χρησιμοποιείται σε ευγενικές αιτήσεις.\n\nΑκόμα και ασυνήθιστες ακολουθίες όπως ..---...._, _ _.., ή _. _. αποκωδικοποιούνται χωρίς καθυστέρηση, κάνοντάς κάθε γραμμή τελειών και παυλών μέρος μιας ζωντανής γλώσσας.\n▸ Κοινές περιπτώσεις χρήσης περιλαμβάνουν:\nΚαθηγητές που εξηγούν τι είναι ο κώδικας Μορς κατά τη διάρκεια του μαθήματος\n\nΜαθητές που εξασκούνται σε έργα αγγλικών προς κώδικα Μορς\n\nΧομπίστες που εργάζονται με αριθμούς κώδικα Μορς στον ελεύθερο χρόνο τους\n\nΙστορικοί που δείχνουν τον κώδικα sos σε Μορς ως μέρος του πολιτισμού\n\nΔημιουργοί που χρησιμοποιούν εργαλεία δημιουργίας κώδικα Μορς για σχεδίαση\n\nΗ επέκταση λειτουργεί επίσης ως αποκωδικοποιητής κώδικα Μορς. Επικολλήστε οποιαδήποτε ακολουθία, και η μετάφραση σε απλό κείμενο εμφανίζεται αμέσως. Είτε δοκιμάσετε _. _ είτε μεγαλύτερες ακολουθίες όπως //, το εργαλείο δείχνει τη σημασία καθαρά. Καμία εικασία, καμία καθυστέρηση, μόνο ομαλή αλληλεπίδραση. Για πολλούς μαθητές αυτό γίνεται ο πιο απλός τρόπος για να εκπαιδευτούν και να μετατρέψουν τον κώδικα Μορς στα αγγλικά σε πραγματικό χρόνο.\n1️⃣ Οφέλη με μια ματιά:\nΕύκολη εισαγωγή στο αλφάβητο Μορς\n\nΑποκωδικοποίηση του \"όχι\" σε κώδικα Μορς και άλλες φράσεις\n\nΜια ευκαιρία να μελετήσετε τα γράμματα του κώδικα Μορς σε λέξεις\n\nΔημιουργικές συνδυασμούς όπως // για πειράματα\n\nΟ ήχος προσθέτει μια άλλη διάσταση. Ο μεταφραστής μπορεί να αναπαράγει τα πρότυπα που δημιουργείτε. Επιτρέπει επίσης να αλλάξετε την ταχύτητα αναπαραγωγής, έτσι ώστε οι σύντομες τελείες και οι μεγαλύτερες παύλες να ταιριάζουν με τον ρυθμό σας. Μπορείτε να το επιβραδύνετε για εξάσκηση ή να το επιταχύνετε για ρεαλισμό. Υπάρχει ακόμη και μια επιλογή να εξάγετε σήματα και να τα αποθηκεύσετε σε αρχείο WAV για μελλοντική ακρόαση.\n➤ Ποιος θα το απολαύσει:\nΜαθητές που εξερευνούν τον κώδικα sos Μορς ως μέρος έργων\n\nΚαθηγητές που προετοιμάζουν σαφείς απεικονίσεις\n\nΦίλοι του ραδιοφώνου που αποκωδικοποιούν το sos en code morse για διασκέδαση\n\nΣχεδιαστές που εμπνέονται από τον ρυθμό των σημάτων\n\nΟποιοσδήποτε θέλει να μεταφράσει τον κώδικα Μορς χωρίς κόπο\n\nΗ ιδιωτικότητα πάντα σέβεται. Η επέκταση λειτουργεί εντελώς μέσα στον περιηγητή, χωρίς καμία πληροφορία να αποστέλλεται μακριά. Τα πειράματά σας με αυτόν τον κώδικα Μορς για εκπαίδευση αλφαβήτου ή δημιουργική εργασία παραμένουν μόνο δικά σας.\n2️⃣ Συχνές ερωτήσεις:\nΜπορεί ο Μεταφραστής Κώδικα Μορς να μετατρέψει στα αγγλικά αμέσως; Ναι, άμεσα.\n\nΥπάρχει μετατροπέας κώδικα Μορς για γράμματα και αριθμούς; Ναι, καλύπτονται όλα.\n\nΠροσομοιώνει μια μηχανή κώδικα Μορς; Ναι, μέσω της δυνατότητας χτυπήματος.\n\nΜπορώ να ρυθμίσω τον ήχο; Ναι, η ταχύτητα μπορεί να αλλάξει και η αναπαραγωγή μπορεί να εξαχθεί ως WAV.\n\nΥπάρχει συμπεριλαμβανόμενος γεννήτορας κώδικα Μορς; Ναι, μπορείτε να δημιουργήσετε και να δοκιμάσετε τα δικά σας σήματα.\n\nΗ επέκταση χειρίζεται ασυνήθιστα πρότυπα; Ναι, αποκωδικοποιεί ακόμη και σπάνιες ακολουθίες.\n\n3️⃣ Λόγοι για να εγκαταστήσετε σήμερα:\nΕξασκηθείτε με το κλειδί τηλέγραφου στη δική του λειτουργία\n\nΕναλλάξτε μεταξύ κώδικα Μορς για αλφάβητο και πλήρεις λέξεις\n\nΕξερευνήστε σήματα όπως το sos en code morse χωρίς σύγχυση\n\nΑπολαύστε ενημερώσεις με περισσότερες γλώσσες και δυνατότητες\n\nΕμπιστευθείτε αυτόν τον μεταφραστή ως εργαλείο καθημερινής μάθησης\n\nΣτο τέλος, ο Μεταφραστής Κώδικα Μορς είναι περισσότερος από ένας μεταφραστής. Είναι ένας τρόπος να συνδεθείτε με την ιστορία ενώ χρησιμοποιείτε σύγχρονα εργαλεία.\nΣχεδίαση από Aleh: stariyleg@gmail.com\nΕικονίδιο - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"morse code icons\">Εικονίδια κώδικα Μορς δημιουργημένα από Freepik - Flaticon</a>"
  }
}