{
  "appName": {
    "message": "மோர்ஸ் குறியீடு மொழிபெயர்ப்பாளர்"
  },
  "shortDesc": {
    "message": "இது மோர்ஸ் குறியீடு மொழிபெயர்ப்பாளர் - ஒலி மற்றும் உரையுடன் கூடிய மோர்ஸ் குறியீடு ஜெனரேட்டர். மோர்ஸ் குறியீடு எழுத்துக்களைக் கற்றுக்கொண்டு உங்கள் மொழியில் மொழிபெயர்க்கவும்."
  },
  "storeDesc": {
    "message": "மோர்ஸ் குறியீடு மொழிபெயர்ப்பாளரில் புதிய மொழிகளுக்கான ஆதரவை நீங்கள் விரும்பினால், டெவலப்பருக்கு மின்னஞ்சல் மூலம் எழுதுங்கள். பயனர்களிடமிருந்து வரும் கருத்து எதிர்கால புதுப்பிப்புகளுக்கு வழிகாட்டுகிறது, மேலும் உங்கள் யோசனைகள் அடுத்து என்ன தோன்றும் என்பதை வடிவமைக்கும். நீட்டிப்பு ஏற்கனவே ஆங்கிலம், ரஷ்யன் மற்றும் சர்வதேச சிக்னல்களுடன் செயல்படுகிறது, ஆனால் இன்னும் பல திட்டமிடப்பட்டுள்ளன.\n மோர்ஸ் குறியீடு மொழிபெயர்ப்பு கருவி, புள்ளிகள் மற்றும் கோடுகளுடன் ஆன்லைனில் நேரடியாகவும் நம்பகமானதாகவும் வேலை செய்ய விரும்புவோருக்காக வடிவமைக்கப்பட்டுள்ளது. இந்த கருவி மோர்ஸ் குறியீட்டை ஆங்கிலத்திற்கும் மீண்டும் மீண்டும் மொழிபெயர்ப்பதை எளிதாக்குகிறது. எல்லாமே உலாவியின் உள்ளே இயங்கும், இடையில் எந்த சேவையகங்களும் இல்லை, எனவே முடிவுகள் உடனடியாகத் தோன்றும் மற்றும் தனிப்பட்டதாகவே இருக்கும்.\n மிகவும் நடைமுறை அம்சங்களில் ஒன்று, இரண்டு புலங்களும் நிகழ்நேரத்தில் ஒத்திசைக்கப்படுகின்றன. நீங்கள் எளிய உரையைத் தட்டச்சு செய்யும் போது, ​​சிக்னல் புலம் தானாகவே புதுப்பிக்கப்படும். நீங்கள் பேட்டர்ன் பக்கத்தில் புள்ளிகள் மற்றும் கோடுகளை ஒட்டும்போது அல்லது உள்ளிடும்போது, ​​உரை புலம் உடனடியாக பதிலளிக்கிறது. நீட்டிப்பு எப்போதும் இரு திசைகளையும் சீரமைத்து வைத்திருக்கும்.\n தந்தி விசை உருவகப்படுத்துதலும் உள்ளது. இந்த சிறப்பு பொத்தான் கையால் தாளங்களைத் தட்ட உங்களை அனுமதிக்கிறது. பயன்முறையை தனித்தனியாக செயல்படுத்தலாம், உங்கள் விசைப்பலகை அல்லது சுட்டியை ஒரு எளிய உள்ளீட்டு கருவியாக மாற்றலாம். ஒவ்வொரு தட்டலும் ஒரு வடிவத்தை உருவாக்குகிறது, மேலும் மொழிபெயர்ப்பு உரை சாளரத்தில் ஒரே நேரத்தில் தோன்றும். உலாவிக்கு ஏற்றவாறு மாற்றியமைக்கப்பட்ட ஒரு வரலாற்று இயந்திரத்தைப் பயன்படுத்துவது போல் இது உணர்கிறது.\n மக்கள் இந்த மொழிபெயர்ப்பாளரை ஏன் நிறுவுகிறார்கள்:\n கூடுதல் மென்பொருள் இல்லாமல் ஆன்லைன் மாற்றம்\n\n\n இரண்டு புலங்களுக்கும் இடையில் தானியங்கி ஒத்திசைவு\n\n\n பயன்பாட்டிற்குள் தெளிவான மோர்ஸ் குறியீடு எழுத்துக்கள் குறிப்பு.\n\n\n சிக்னல்களைத் தட்டுவதற்கான தந்தி விசை முறை\n\n\n மொழிகளையும் அம்சங்களையும் விரிவாக்கும் புதுப்பிப்புகள்\n\n\n சிக்னல்கள் மூலம் பார்க்கும்போது தினசரி சொற்றொடர்கள் மிகவும் வேடிக்கையாக இருக்கும். &quot;ஹலோ&quot; எப்படி இருக்கிறது என்பதைக் காண நீங்கள் மோர்ஸ் குறியீடு மாற்றியைப் பயன்படுத்தலாம், மேலும் குறுகிய வாழ்த்துக்கள் கூட விளையாட்டுத்தனமான தொனியைப் பெறலாம். சிலர் படைப்பு செய்திகளுக்கு மோர்ஸ் குறியீட்டில் ஐ லவ் யூவைப் பரிசோதிக்கிறார்கள், மற்றவர்கள் மோர்ஸ் குறியீட்டில் sos அல்லது அவசர பயிற்சிக்கு sos en குறியீடு morse ஐச் சரிபார்க்கிறார்கள். இந்த அமைப்பு ரேடியோ உலகில் ஒரு நீண்ட பாரம்பரியத்தைக் கொண்டுள்ளது, அங்கு ஆபரேட்டர்கள் பெரும்பாலும் குறுகிய குறியீடுகள் மற்றும் சுருக்கங்களைப் பயன்படுத்துகிறார்கள்:\n 73 (--... ...--): &quot;வாழ்த்துக்கள்&quot; என்று பொருள்படும் மற்றும் ஒரு தொடர்பை பணிவுடன் முடிக்கப் பயன்படுகிறது.\n\n\n 88 (---.. ---..): நண்பர்கள் அல்லது சக ஊழியர்களிடையே பெரும்பாலும் பகிர்ந்து கொள்ளப்படும் &quot;முத்தங்கள்&quot; என்பதைக் குறிக்கிறது.\n\n\n CQ (-.-. --.-): அனைத்து ஆபரேட்டர்களுக்கும் ஒரு பொதுவான அழைப்பு, &quot;உங்களை அழைக்கவும்&quot; என்று மொழிபெயர்க்கப்பட்டுள்ளது.\n\n\n GM (--. --): “காலை வணக்கம்,” GA (--. .-): “மதிய வணக்கம்,” GE (--. .): “மாலை வணக்கம்,” GN (--. -.): “இனிய இரவு.”\n\n\n R (.-.): &quot;பெறப்பட்டது&quot; அல்லது &quot;புரிந்து கொள்ளப்பட்டது&quot; என்று பொருள்படும் உறுதிப்படுத்தல் சமிக்ஞை.\n\n\n PSE (.--. ... .): &quot;தயவுசெய்து&quot; என்பதன் சுருக்கம், கண்ணியமான கோரிக்கைகளில் பயன்படுத்தப்படுகிறது.\n\n\n ..---...._, _ _.., அல்லது _. _. போன்ற அசாதாரண வரிசைகள் கூட தாமதமின்றி டிகோட் செய்யப்பட்டு, புள்ளிகள் மற்றும் கோடுகளின் ஒவ்வொரு வரியையும் ஒரு உயிருள்ள மொழியின் பகுதியாக ஆக்குகின்றன.\n ▸ பொதுவான பயன்பாட்டு நிகழ்வுகளில் பின்வருவன அடங்கும்:\n வகுப்பின் போது மோர்ஸ் குறியீடு என்றால் என்ன என்பதை விளக்கும் ஆசிரியர்கள்\n\n\n ஆங்கிலத்திலிருந்து மோர்ஸ் குறியீட்டு திட்டங்களைப் பயிற்சி செய்யும் மாணவர்கள்\n\n\n ஓய்வு நேரத்தில் மோர்ஸ் குறியீடு எண்களுடன் பணிபுரியும் பொழுதுபோக்கு ஆர்வலர்கள்\n\n\n கலாச்சாரத்தின் ஒரு பகுதியாக மோர்ஸில் sos குறியீட்டைக் காட்டும் வரலாற்றாசிரியர்கள்.\n\n\n வடிவமைப்பிற்காக மோர்ஸ் குறியீடு படைப்பாளர் கருவிகளைப் பயன்படுத்தும் படைப்பாளர்கள்\n\n\n இந்த நீட்டிப்பு மோர்ஸ் குறியீடு டிகோடராகவும் செயல்படுகிறது. எந்த வரிசையையும் ஒட்டவும், மொழிபெயர்ப்பு எளிய உரைக்கு ஒரே நேரத்தில் தோன்றும். நீங்கள் _. _ அல்லது // போன்ற நீண்ட வரிசைகளைச் சோதித்தாலும், கருவி அர்த்தத்தை தெளிவாகக் காட்டுகிறது. யூகிக்க வேண்டாம், தாமதங்கள் இல்லை, மென்மையான தொடர்பு மட்டுமே. பல கற்பவர்களுக்கு, இது மோர்ஸை உண்மையான நேரத்தில் ஆங்கிலத்திற்கு மாற்றுவதற்கும் பயிற்சி செய்வதற்கும் எளிதான வழியாகும்.\n 1️⃣ நன்மைகள் ஒரு பார்வையில்:\n மோர்ஸ் எழுத்துக்களை எளிதாக அறிமுகப்படுத்துதல்\n\n\n மோர்ஸ் குறியீட்டில் இல்லை மற்றும் பிற சொற்றொடர்களைப் புரிந்துகொள்வது\n\n\n மோர்ஸ் குறியீட்டு எழுத்துக்களை வார்த்தைகளில் படிக்க ஒரு வாய்ப்பு.\n\n\n சோதனைகளுக்கு // போன்ற படைப்பு சேர்க்கைகள்\n\n\n ஒலி மற்றொரு பரிமாணத்தைச் சேர்க்கிறது. மொழிபெயர்ப்பாளர் நீங்கள் உருவாக்கும் வடிவங்களை மீண்டும் இயக்க முடியும். இது பிளேபேக் வேகத்தை மாற்றவும் உங்களை அனுமதிக்கிறது, எனவே குறுகிய புள்ளிகள் மற்றும் நீண்ட கோடுகள் உங்கள் வேகத்துடன் பொருந்துகின்றன. பயிற்சிக்காக நீங்கள் அதை மெதுவாக்கலாம் அல்லது யதார்த்தத்திற்காக அதை வேகப்படுத்தலாம். சிக்னல்களை ஏற்றுமதி செய்து பின்னர் கேட்பதற்காக அவற்றை WAV கோப்பில் சேமிக்கவும் ஒரு வழி உள்ளது.\n ➤ யார் இதை அனுபவிப்பார்கள்:\n திட்டங்களின் ஒரு பகுதியாக குறியீடு sos morse ஐ ஆராயும் மாணவர்கள்\n\n\n ஆசிரியர்கள் தெளிவான விளக்கப்படங்களைத் தயாரிக்கிறார்கள்.\n\n\n வேடிக்கைக்காக மோர்ஸ் குறியீட்டை டிகோட் செய்யும் ரேடியோ ரசிகர்கள்\n\n\n சிக்னல்களின் தாளத்தால் ஈர்க்கப்பட்ட வடிவமைப்பாளர்கள்\n\n\n மோர்ஸ் குறியீட்டை முயற்சி இல்லாமல் மொழிபெயர்க்க விரும்பும் எவரும்\n\n\n தனியுரிமை எப்போதும் மதிக்கப்படுகிறது. இந்த நீட்டிப்பு உலாவியின் உள்ளேயே முழுமையாக இயங்குகிறது, எந்த தகவலும் அனுப்பப்படாது. எழுத்துக்கள் பயிற்சி அல்லது படைப்பு வேலைக்கான இந்த மோர்ஸ் குறியீட்டைக் கொண்டு நீங்கள் செய்யும் சோதனைகள் உங்களுடையதாகவே இருக்கும்.\n 2️⃣ அடிக்கடி கேட்கப்படும் கேள்விகள்:\n மோர்ஸ் குறியீடு மொழிபெயர்ப்பு இயந்திரத்தை உடனடியாக ஆங்கிலத்திற்கு மாற்ற முடியுமா? ஆம், உடனடியாக.\n\n\n எழுத்துக்களுக்கும் எண்களுக்கும் மோர்ஸ் குறியீடு மாற்றி உள்ளதா? ஆம், எல்லாம் உள்ளடக்கப்பட்டுள்ளது.\n\n\n இது ஒரு மோர்ஸ் குறியீடு இயந்திரத்தை உருவகப்படுத்துகிறதா? ஆம், தட்டுதல் அம்சத்தின் மூலம்.\n\n\n ஒலியை சரிசெய்ய முடியுமா? ஆம், வேகத்தை மாற்றலாம், மேலும் பிளேபேக்கை WAV ஆக ஏற்றுமதி செய்யலாம்.\n\n\n மோர்ஸ் குறியீடு ஜெனரேட்டர் சேர்க்கப்பட்டுள்ளதா? ஆம், நீங்கள் உங்கள் சொந்த சிக்னல்களை உருவாக்கி சோதிக்கலாம்.\n\n\n நீட்டிப்பு அசாதாரண வடிவங்களைக் கையாளுமா? ஆம், இது அரிதான வரிசைகளைக் கூட டிகோட் செய்கிறது.\n\n\n 3️⃣ இன்றே நிறுவுவதற்கான காரணங்கள்:\n தந்தி விசையை அதன் சொந்த பயன்முறையில் பயிற்சி செய்யுங்கள்.\n\n\n எழுத்துக்களுக்கும் முழுமையான சொற்களுக்கும் மோர்ஸ் குறியீட்டிற்கு இடையில் மாறவும்.\n\n\n குழப்பம் இல்லாமல் sos en code morse போன்ற சிக்னல்களை ஆராயுங்கள்.\n\n\n கூடுதல் மொழிகள் மற்றும் அம்சங்களுடன் புதுப்பிப்புகளை அனுபவிக்கவும்.\n\n\n இந்த மொழிபெயர்ப்பாளரை தினசரி கற்றல் கருவியாக நம்புங்கள்.\n\n\n இறுதியில், மோர்ஸ் குறியீடு மொழிபெயர்ப்பாளர் ஒரு மொழிபெயர்ப்பாளரை விட அதிகம். இது நவீன கருவிகளைப் பயன்படுத்தும் போது வரலாற்றுடன் இணைவதற்கான ஒரு வழியாகும்.\n அலேவின் வடிவமைப்பு: stariyleg@gmail.com\n ஐகான் - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"மோர்ஸ் குறியீடு சின்னங்கள்\">ஃப்ரீபிக் உருவாக்கிய மோர்ஸ் குறியீடு ஐகான்கள் - ஃபிளாட்டிகான்</a>\n"
  }
}