{
  "appName": {
    "message": "Morse-Code-Übersetzer"
  },
  "shortDesc": {
    "message": "Dies ist der Morse-Code-Übersetzer – Morse-Code-Generator mit Sound und Text. Lernen Sie das Morse-Code-Alphabet und übersetzen Sie es in Ihre Sprache."
  },
  "storeDesc": {
    "message": "Wenn Sie Unterstützung für neue Sprachen im Morse-Code-Übersetzer wünschen, schreiben Sie einfach eine E-Mail an den Entwickler. Das Feedback der Benutzer leitet zukünftige Updates, und Ihre Ideen können beeinflussen, was als Nächstes erscheint. Die Erweiterung funktioniert bereits mit Englisch, Russisch und internationalen Signalen, aber es sind weitere Sprachen geplant.  \nDer Morse-Code-Übersetzer ist für Menschen konzipiert, die online eine direkte und zuverlässige Möglichkeit suchen, mit Punkten und Strichen zu arbeiten. Das Tool macht es einfach, Morse-Code ins Englische und zurück zu übersetzen. Alles läuft im Browser, ohne Server dazwischen, sodass die Ergebnisse sofort erscheinen und privat bleiben.  \nEine der praktischsten Funktionen ist, dass beide Felder in Echtzeit synchronisiert sind. Wenn Sie normalen Text eingeben, wird das Signalfeld automatisch aktualisiert. Wenn Sie Punkte und Striche in die Musterseite einfügen oder eingeben, reagiert das Textfeld sofort. Die Erweiterung hält immer beide Richtungen synchronisiert.  \nEs gibt auch eine Simulation eines Telegraphenhebels. Dieser spezielle Knopf ermöglicht es Ihnen, Rhythmen von Hand zu tippen. Der Modus kann separat aktiviert werden, wodurch Ihre Tastatur oder Maus zu einem einfachen Eingabewerkzeug wird. Jeder Tipp erzeugt ein Muster, und die Übersetzung erscheint sofort im Textfenster. Es fühlt sich fast so an, als würde man eine historische Maschine verwenden, die für den Browser angepasst wurde.  \nWarum Menschen diesen Übersetzer installieren:  \nOnline-Konvertierung ohne zusätzliche Software  \n\nAutomatische Synchronisation zwischen beiden Feldern  \n\nEin klares Morse-Code-Alphabetverzeichnis innerhalb der App  \n\nTelegraphenhebelsimulation zum Tippen von Signalen  \n\nUpdates, die Sprachen und Funktionen erweitern  \n\nTägliche Phrasen machen mehr Spaß, wenn sie durch Signale betrachtet werden. Sie können den Morse-Code-Konverter verwenden, um zu sehen, wie „Hallo“ aussieht, und selbst kurze Grüße können einen spielerischen Ton annehmen. Einige Menschen experimentieren mit „Ich liebe dich“ im Morse-Code für kreative Nachrichten, während andere „SOS“ im Morse-Code oder „SOS en code morse“ für Notfallübungen überprüfen. Das System hat eine lange Tradition in der Funkwelt, wo Betreiber oft kurze Codes und Abkürzungen verwenden:  \n73 (--... ...--): bedeutet „beste Wünsche“ und wird verwendet, um einen Kontakt höflich zu beenden.  \n\n88 (---.. ---..): steht für „Küsse“, oft zwischen Freunden oder Kollegen geteilt.  \n\nCQ (-.-. --.-): ein allgemeiner Aufruf an alle Betreiber, übersetzt als „Ruf an dich“.  \n\nGM (--. --): „Guten Morgen“, GA (--. .-): „Guten Nachmittag“, GE (--. .): „Guten Abend“, GN (--. -.): „Gute Nacht“.  \n\nR (.-.): ein Bestätigungssignal, das „empfangen“ oder „verstanden“ bedeutet.  \n\nPSE (.--. ... .): kurz für „bitte“, verwendet in höflichen Anfragen.  \n\nSelbst ungewöhnliche Sequenzen wie ..---...._, _ _.. oder _. _. werden ohne Verzögerung decodiert, sodass jede Zeile von Punkten und Strichen Teil einer lebendigen Sprache wird.  \n▸ Häufige Anwendungsfälle sind:  \nLehrer, die im Unterricht erklären, was Morse-Code ist  \n\nSchüler, die Projekte von Englisch zu Morse-Code üben  \n\nHobbyisten, die in ihrer Freizeit mit Morse-Code-Zahlen arbeiten  \n\nHistoriker, die SOS-Code im Morse als Teil der Kultur zeigen  \n\nKreative, die Morse-Code-Tools für Design verwenden  \n\nDie Erweiterung funktioniert auch als Morse-Code-Dekoder. Fügen Sie eine beliebige Sequenz ein, und die Übersetzung in Klartext erscheint sofort. Egal, ob Sie _. _ oder längere Sequenzen wie // testen, das Tool zeigt die Bedeutung klar an. Kein Raten, keine Verzögerungen, nur reibungslose Interaktion. Für viele Lernende wird dies zur einfachsten Möglichkeit, Morse in Echtzeit zu trainieren und ins Englische zu konvertieren.  \n1️⃣ Vorteile auf einen Blick:  \nEinfache Einführung in das Morse-Alphabet  \n\nDekodierung von „nein“ im Morse-Code und anderen Phrasen  \n\nEine Chance, Morse-Code-Buchstaben in Wörtern zu studieren  \n\nKreative Kombinationen wie // für Experimente  \n\nDer Klang fügt eine weitere Dimension hinzu. Der Übersetzer kann die Muster, die Sie erstellen, wiedergeben. Er ermöglicht es Ihnen auch, die Wiedergabegeschwindigkeit zu ändern, sodass kurze Punkte und längere Striche Ihrem Tempo entsprechen. Sie können es für das Üben verlangsamen oder für mehr Realismus beschleunigen. Es gibt sogar eine Option, Signale zu exportieren und sie in einer WAV-Datei für späteres Anhören zu speichern.  \n➤ Wer wird es genießen:  \nSchüler, die den SOS-Code im Morse als Teil von Projekten erkunden  \n\nLehrer, die klare Illustrationen vorbereiten  \n\nRadiofans, die SOS en code morse zum Spaß dekodieren  \n\nDesigner, die sich vom Rhythmus der Signale inspirieren lassen  \n\nJeder, der Morse-Code ohne Aufwand übersetzen möchte  \n\nDie Privatsphäre wird immer respektiert. Die Erweiterung läuft vollständig im Browser, ohne dass Informationen gesendet werden. Ihre Experimente mit diesem Morse-Code für das Alphabettraining oder kreative Arbeiten bleiben allein Ihnen vorbehalten.  \n2️⃣ FAQ:  \nKann der Morse-Code-Übersetzer sofort ins Englische konvertieren? Ja, sofort.  \n\nGibt es einen Morse-Code-Konverter für Buchstaben und Zahlen? Ja, alles ist abgedeckt.  \n\nSimuliert er eine Morse-Code-Maschine? Ja, durch die Tippfunktion.  \n\nKann ich den Klang anpassen? Ja, die Geschwindigkeit kann geändert werden, und die Wiedergabe kann als WAV exportiert werden.  \n\nGibt es einen Morse-Code-Generator? Ja, Sie können Ihre eigenen Signale erstellen und testen.  \n\nVerarbeitet die Erweiterung ungewöhnliche Muster? Ja, sie dekodiert sogar seltene Sequenzen.  \n3️⃣ Gründe, heute zu installieren:  \nÜben Sie mit dem Telegraphenhebel in seinem eigenen Modus  \n\nWechseln Sie zwischen Morse-Code für das Alphabet und vollständigen Wörtern  \n\nErforschen Sie Signale wie SOS en code morse ohne Verwirrung  \n\nGenießen Sie Updates mit mehr Sprachen und Funktionen  \n\nVerlassen Sie sich auf diesen Übersetzer als tägliches Lernwerkzeug  \n\nAm Ende ist der Morse-Code-Übersetzer mehr als nur ein Übersetzer. Es ist eine Möglichkeit, sich mit der Geschichte zu verbinden, während moderne Werkzeuge verwendet werden.  \nDesign von Aleh: stariyleg@gmail.com  \nIcon - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"morse code icons\">Morse-Code-Icons erstellt von Freepik - Flaticon</a>"
  }
}