{
  "appName": {
    "message": "摩尔斯电码翻译器"
  },
  "shortDesc": {
    "message": "这是摩尔斯电码翻译器 - 带声音和文本的摩尔斯电码生成器。学习摩尔斯电码字母并翻译成您的语言。"
  },
  "storeDesc": {
    "message": "如果您希望摩尔斯电码翻译器支持新的语言，只需通过电子邮件联系开发者。用户的反馈指导未来的更新，您的想法可以影响下一个出现的内容。该扩展程序已经支持英语、俄语和国际信号，但计划增加更多语言。\n摩尔斯电码翻译器旨在为希望在线直接可靠地处理点和划的人提供服务。该工具使翻译摩尔斯电码为英语及其反向操作变得简单。所有操作都在浏览器内进行，没有中间服务器，因此结果瞬间出现并保持私密。\n最实用的功能之一是两个字段实时同步。当您输入普通文本时，信号字段会自动更新。当您在模式侧粘贴或输入点和划时，文本字段会立即响应。该扩展程序始终保持两个方向的对齐。\n还有一个电报键模拟功能。这个特殊按钮让您可以手动敲击节奏。该模式可以单独激活，将您的键盘或鼠标变成一个简单的输入工具。每次敲击都会生成一个模式，翻译会立即出现在文本窗口中。这感觉就像使用一个适应于浏览器的历史机器。\n人们安装这个翻译器的原因：\n在线转换，无需额外软件\n\n两个字段之间的自动同步\n\n应用内清晰的摩尔斯电码字母参考\n\n电报键模式用于敲击信号\n\n扩展语言和功能的更新\n\n通过信号查看日常短语更有趣。您可以使用摩尔斯电码转换器查看“你好”的样子，甚至短暂的问候也可以变得有趣。有些人用摩尔斯电码实验“我爱你”以传达创意信息，而其他人则检查摩尔斯电码中的SOS或摩尔斯电码中的SOS以进行紧急练习。该系统在无线电世界中有着悠久的传统，操作员通常使用短代码和缩写：\n73 (--... ...--): 意思是“最好的祝愿”，用于礼貌地结束联系。\n\n88 (---.. ---..): 代表“亲吻”，通常在朋友或同事之间分享。\n\nCQ (-.-. --.-): 向所有操作员发出的通用呼叫，翻译为“呼叫你”。\n\nGM (--. --): “早上好”，GA (--. .-): “下午好”，GE (--. .): “晚上好”，GN (--. -.): “晚安”。\n\nR (.-.): 确认信号，意思是“收到”或“理解”。\n\nPSE (.--. ... .): “请”的缩写，用于礼貌请求。\n\n即使是像..---...._, _ _..或_. _.这样的不寻常序列也能毫不延迟地解码，使每一行点和划成为一种活语言。\n▸ 常见用例包括：\n在课堂上解释摩尔斯电码的老师\n\n练习英语到摩尔斯电码项目的学生\n\n在业余时间处理摩尔斯电码数字的爱好者\n\n展示摩尔斯SOS代码作为文化一部分的历史学家\n\n使用摩尔斯电码创作工具进行设计的创作者\n\n该扩展程序还可以作为摩尔斯电码解码器。粘贴任何序列，翻译为普通文本会立即出现。无论您测试_. _还是更长的序列如//，该工具都能清晰地显示其含义。没有猜测，没有延迟，只有流畅的互动。对于许多学习者来说，这成为了实时训练和转换摩尔斯电码为英语的最简单方式。\n1️⃣ 一目了然的好处：\n轻松了解摩尔斯字母表\n\n解码摩尔斯电码中的“没有”和其他短语\n\n有机会学习摩尔斯电码字母在单词中的应用\n\n像//这样的创意组合用于实验\n\n声音增加了另一个维度。翻译器可以播放您创建的模式。它还允许您改变播放速度，因此短点和长划可以与您的节奏匹配。您可以放慢速度以进行练习，或加快速度以增强真实感。甚至还有一个选项可以导出信号并将其保存为WAV文件以供稍后收听。\n➤ 谁会喜欢它：\n探索摩尔斯SOS代码作为项目一部分的学生\n\n准备清晰插图的老师\n\n为乐趣解码摩尔斯SOS代码的无线电爱好者\n\n受到信号节奏启发的设计师\n\n任何想要轻松翻译摩尔斯电码的人\n\n隐私始终受到尊重。该扩展程序完全在浏览器内运行，没有信息被发送出去。您对摩尔斯电码的实验，无论是字母训练还是创意工作，都是您自己的。\n2️⃣ 常见问题：\n摩尔斯电码翻译器能立即转换为英语吗？是的，瞬间。\n\n是否有字母和数字的摩尔斯电码转换器？是的，所有内容都涵盖。\n\n它是否模拟摩尔斯电码机器？是的，通过敲击功能。\n\n我可以调整声音吗？是的，可以改变速度，并且播放可以导出为WAV。\n\n是否包含摩尔斯电码生成器？是的，您可以创建和测试自己的信号。\n\n该扩展程序能处理不寻常的模式吗？是的，它甚至能解码稀有序列。\n\n3️⃣ 今天安装的理由：\n在其独立模式下练习电报键\n\n在摩尔斯电码字母和完整单词之间切换\n\n无混淆地探索像摩尔斯SOS代码这样的信号\n\n享受更多语言和功能的更新\n\n将此翻译器作为日常学习工具\n\n最后，摩尔斯电码翻译器不仅仅是一个翻译器。它是使用现代工具与历史连接的一种方式。\n设计者：Aleh: stariyleg@gmail.com\n图标 - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"摩尔斯电码图标\">摩尔斯电码图标由Freepik - Flaticon创建</a>"
  }
}