{
  "appName": {
    "message": "മോഴ്‌സ് കോഡ് വിവർത്തകൻ"
  },
  "shortDesc": {
    "message": "ഇതാണ് മോഴ്സ് കോഡ് ട്രാൻസ്ലേറ്റർ - ശബ്ദവും വാചകവുമുള്ള മോഴ്സ് കോഡ് ജനറേറ്റർ. മോഴ്സ് കോഡ് അക്ഷരമാല പഠിച്ച് നിങ്ങളുടെ ഭാഷയിലേക്ക് വിവർത്തനം ചെയ്യുക."
  },
  "storeDesc": {
    "message": "മോഴ്‌സ് കോഡ് ട്രാൻസ്ലേറ്ററിൽ പുതിയ ഭാഷകൾക്കുള്ള പിന്തുണ ആവശ്യമുണ്ടെങ്കിൽ, ഡെവലപ്പർക്ക് ഇമെയിൽ വഴി എഴുതുക. ഉപയോക്താക്കളിൽ നിന്നുള്ള ഫീഡ്‌ബാക്ക് ഭാവി അപ്‌ഡേറ്റുകളെ നയിക്കുന്നു, നിങ്ങളുടെ ആശയങ്ങൾ അടുത്തതായി എന്ത് ദൃശ്യമാകുമെന്ന് രൂപപ്പെടുത്തും. വിപുലീകരണം ഇതിനകം ഇംഗ്ലീഷ്, റഷ്യൻ, അന്താരാഷ്ട്ര സിഗ്നലുകളിൽ പ്രവർത്തിക്കുന്നു, പക്ഷേ കൂടുതൽ കാര്യങ്ങൾ ആസൂത്രണം ചെയ്തിട്ടുണ്ട്.\n ഡോട്ടുകളും ഡാഷുകളും ഉപയോഗിച്ച് ഓൺലൈനിൽ പ്രവർത്തിക്കാൻ നേരിട്ടുള്ളതും വിശ്വസനീയവുമായ മാർഗം ആഗ്രഹിക്കുന്ന ആളുകൾക്കായി മോഴ്‌സ് കോഡ് ട്രാൻസ്ലേറ്റർ രൂപകൽപ്പന ചെയ്‌തിരിക്കുന്നു. മോഴ്‌സ് കോഡ് ഇംഗ്ലീഷിലേക്കും തിരിച്ചും വിവർത്തനം ചെയ്യുന്നത് ഈ ഉപകരണം എളുപ്പമാക്കുന്നു. സെർവറുകൾ ഇടയിലില്ലാതെ എല്ലാം ബ്രൗസറിനുള്ളിൽ പ്രവർത്തിക്കുന്നു, അതിനാൽ ഫലങ്ങൾ തൽക്ഷണം ദൃശ്യമാവുകയും സ്വകാര്യമായി തുടരുകയും ചെയ്യുന്നു.\n ഏറ്റവും പ്രായോഗികമായ സവിശേഷതകളിൽ ഒന്ന്, രണ്ട് ഫീൽഡുകളും തത്സമയം സമന്വയിപ്പിക്കപ്പെടുന്നു എന്നതാണ്. നിങ്ങൾ പ്ലെയിൻ ടെക്സ്റ്റ് ടൈപ്പ് ചെയ്യുമ്പോൾ, സിഗ്നൽ ഫീൽഡ് യാന്ത്രികമായി അപ്ഡേറ്റ് ചെയ്യപ്പെടുന്നു. പാറ്റേൺ വശത്ത് ഡോട്ടുകളും ഡാഷുകളും ഒട്ടിക്കുകയോ നൽകുകയോ ചെയ്യുമ്പോൾ, ടെക്സ്റ്റ് ഫീൽഡ് ഉടനടി പ്രതികരിക്കുന്നു. എക്സ്റ്റൻഷൻ എല്ലായ്പ്പോഴും രണ്ട് ദിശകളും വിന്യസിച്ചിരിക്കുന്നു.\n ഒരു ടെലിഗ്രാഫ് കീ സിമുലേഷനും ഉണ്ട്. ഈ പ്രത്യേക ബട്ടൺ നിങ്ങളെ കൈകൊണ്ട് താളങ്ങൾ ടാപ്പ് ചെയ്യാൻ അനുവദിക്കുന്നു. മോഡ് വെവ്വേറെ സജീവമാക്കാം, നിങ്ങളുടെ കീബോർഡോ മൗസോ ഒരു ലളിതമായ ഇൻപുട്ട് ഉപകരണമാക്കി മാറ്റാം. ഓരോ ടാപ്പും ഒരു പാറ്റേൺ സൃഷ്ടിക്കുന്നു, വിവർത്തനം ഉടൻ തന്നെ ടെക്സ്റ്റ് വിൻഡോയിൽ ദൃശ്യമാകും. ബ്രൗസറിനായി അനുയോജ്യമായ ഒരു ചരിത്ര യന്ത്രം ഉപയോഗിക്കുന്നതുപോലെയാണ് ഇത് അനുഭവപ്പെടുന്നത്.\n ആളുകൾ ഈ വിവർത്തകൻ ഇൻസ്റ്റാൾ ചെയ്യുന്നത് എന്തുകൊണ്ട്:\n അധിക സോഫ്റ്റ്‌വെയർ ഇല്ലാതെ ഓൺലൈൻ പരിവർത്തനം\n\n\n രണ്ട് ഫീൽഡുകൾക്കുമിടയിൽ യാന്ത്രിക സമന്വയം\n\n\n ആപ്പിനുള്ളിൽ വ്യക്തമായ മോഴ്‌സ് കോഡ് അക്ഷരമാല റഫറൻസ്\n\n\n സിഗ്നലുകൾ ടാപ്പുചെയ്യുന്നതിനുള്ള ടെലിഗ്രാഫ് കീ മോഡ്\n\n\n ഭാഷകളും സവിശേഷതകളും വികസിപ്പിക്കുന്ന അപ്‌ഡേറ്റുകൾ\n\n\n സിഗ്നലുകളിലൂടെ നോക്കുമ്പോൾ ദൈനംദിന ശൈലികൾ കൂടുതൽ രസകരമാണ്. &quot;ഹലോ&quot; എങ്ങനെ കാണപ്പെടുന്നുവെന്ന് കാണാൻ നിങ്ങൾക്ക് മോഴ്‌സ് കോഡ് കൺവെർട്ടർ ഉപയോഗിക്കാം, കൂടാതെ ചെറിയ ആശംസകൾ പോലും കളിയായ സ്വരത്തിൽ ഉപയോഗിക്കാം. ചില ആളുകൾ സൃഷ്ടിപരമായ സന്ദേശങ്ങൾക്കായി മോഴ്‌സ് കോഡിൽ ഐ ലവ് യു പരീക്ഷിക്കുന്നു, മറ്റുള്ളവർ അടിയന്തര പരിശീലനത്തിനായി മോഴ്‌സ് കോഡിൽ സോസ് അല്ലെങ്കിൽ സോസ് എൻ കോഡ് മോഴ്‌സ് പരിശോധിക്കുന്നു. റേഡിയോ ലോകത്ത് ഈ സിസ്റ്റത്തിന് ഒരു നീണ്ട പാരമ്പര്യമുണ്ട്, അവിടെ ഓപ്പറേറ്റർമാർ പലപ്പോഴും ഹ്രസ്വ കോഡുകളും ചുരുക്കെഴുത്തുകളും ഉപയോഗിക്കുന്നു:\n 73 (--... ...--): &quot;ആശംസകൾ&quot; എന്നാണ് അർത്ഥമാക്കുന്നത്, ഒരു ബന്ധം മാന്യമായി അവസാനിപ്പിക്കാൻ ഉപയോഗിക്കുന്നു.\n\n\n 88 (---.. ---..): സുഹൃത്തുക്കൾക്കോ ​​സഹപ്രവർത്തകർക്കോ ഇടയിൽ പലപ്പോഴും പങ്കിടുന്ന &quot;ചുംബനങ്ങൾ&quot; എന്നതിന്റെ ചുരുക്കെഴുത്ത്.\n\n\n CQ (-.-. --.-): എല്ലാ ഓപ്പറേറ്റർമാർക്കും പൊതുവായ ഒരു കോൾ, &quot;നിങ്ങളെ വിളിക്കൂ&quot; എന്ന് വിവർത്തനം ചെയ്‌തിരിക്കുന്നു.\n\n\n GM (--. --): “സുപ്രഭാതം,” GA (--. .-): “ശുഭ ആഫ്റ്റർനൂൺ,” GE (--. .): “ശുഭ സായാഹ്നം,” GN (--. -.): “ശുഭ രാത്രി.”\n\n\n R (.-.): &quot;ലഭിച്ചു&quot; അല്ലെങ്കിൽ &quot;മനസ്സിലായി&quot; എന്നർത്ഥമുള്ള ഒരു സ്ഥിരീകരണ സിഗ്നൽ.\n\n\n PSE (.--. ... .): മാന്യമായ അഭ്യർത്ഥനകളിൽ ഉപയോഗിക്കുന്ന “ദയവായി” എന്നതിന്റെ ചുരുക്കെഴുത്ത്.\n\n\n ..---...._, _ _.., അല്ലെങ്കിൽ _. _. പോലുള്ള അസാധാരണമായ ശ്രേണികൾ പോലും കാലതാമസമില്ലാതെ ഡീകോഡ് ചെയ്യപ്പെടുന്നു, ഇത് ഓരോ കുത്തുകളുടെയും ഡാഷുകളുടെയും ഒരു ജീവസുറ്റ ഭാഷയുടെ ഭാഗമാക്കുന്നു.\n ▸ സാധാരണ ഉപയോഗ കേസുകളിൽ ഇവ ഉൾപ്പെടുന്നു:\n ക്ലാസ്സിൽ മോഴ്സ് കോഡ് എന്താണെന്ന് വിശദീകരിക്കുന്ന അധ്യാപകർ.\n\n\n ഇംഗ്ലീഷ് മുതൽ മോഴ്‌സ് കോഡ് വരെയുള്ള പ്രോജക്ടുകൾ പരിശീലിക്കുന്ന വിദ്യാർത്ഥികൾ\n\n\n ഒഴിവുസമയങ്ങളിൽ മോഴ്‌സ് കോഡ് നമ്പറുകൾ ഉപയോഗിച്ച് ജോലി ചെയ്യുന്ന ഹോബികൾ\n\n\n സംസ്കാരത്തിന്റെ ഭാഗമായി മോഴ്‌സിൽ സോസ് കോഡ് കാണിക്കുന്ന ചരിത്രകാരന്മാർ.\n\n\n ഡിസൈനിനായി മോഴ്‌സ് കോഡ് ക്രിയേറ്റർ ടൂളുകൾ ഉപയോഗിക്കുന്ന സ്രഷ്ടാക്കൾ\n\n\n ഈ എക്സ്റ്റൻഷൻ ഒരു മോഴ്സ് കോഡ് ഡീകോഡറായും പ്രവർത്തിക്കുന്നു. ഏതെങ്കിലും സീക്വൻസ് ഒട്ടിക്കുക, പ്ലെയിൻ ടെക്സ്റ്റിലേക്കുള്ള വിവർത്തനം ഉടനടി ദൃശ്യമാകും. നിങ്ങൾ _. _ അല്ലെങ്കിൽ // പോലുള്ള ദൈർഘ്യമേറിയ സീക്വൻസുകൾ പരീക്ഷിച്ചാലും, ഉപകരണം അർത്ഥം വ്യക്തമായി കാണിക്കുന്നു. ഊഹമില്ല, കാലതാമസമില്ല, സുഗമമായ ഇടപെടൽ മാത്രം. പല പഠിതാക്കൾക്കും ഇത് മോഴ്സ് പരിശീലിപ്പിക്കുന്നതിനും തത്സമയം ഇംഗ്ലീഷിലേക്ക് പരിവർത്തനം ചെയ്യുന്നതിനുമുള്ള ഏറ്റവും ലളിതമായ മാർഗമായി മാറുന്നു.\n 1️⃣ ആനുകൂല്യങ്ങൾ ഒറ്റനോട്ടത്തിൽ:\n മോഴ്‌സ് അക്ഷരമാലയുടെ എളുപ്പത്തിലുള്ള ആമുഖം\n\n\n മോഴ്സ് കോഡിലും മറ്റ് ശൈലികളിലും ഇല്ല എന്നതിന്റെ ഡീകോഡിംഗ്\n\n\n വാക്കുകളിലെ മോഴ്‌സ് കോഡ് അക്ഷരങ്ങൾ പഠിക്കാനുള്ള അവസരം\n\n\n പരീക്ഷണങ്ങൾക്ക് // പോലുള്ള ക്രിയേറ്റീവ് കോമ്പിനേഷനുകൾ\n\n\n ശബ്‌ദം മറ്റൊരു മാനം നൽകുന്നു. നിങ്ങൾ സൃഷ്ടിക്കുന്ന പാറ്റേണുകൾ വിവർത്തകന് പ്ലേ ചെയ്യാൻ കഴിയും. പ്ലേബാക്ക് വേഗത മാറ്റാനും ഇത് നിങ്ങളെ അനുവദിക്കുന്നു, അതിനാൽ ചെറിയ ഡോട്ടുകളും നീളമുള്ള ഡാഷുകളും നിങ്ങളുടെ വേഗതയുമായി പൊരുത്തപ്പെടുന്നു. പരിശീലനത്തിനായി നിങ്ങൾക്ക് ഇത് വേഗത കുറയ്ക്കാം അല്ലെങ്കിൽ യാഥാർത്ഥ്യബോധത്തിനായി വേഗത്തിലാക്കാം. സിഗ്നലുകൾ എക്‌സ്‌പോർട്ട് ചെയ്യാനും പിന്നീട് കേൾക്കുന്നതിനായി ഒരു WAV ഫയലിൽ സംരക്ഷിക്കാനും ഒരു ഓപ്ഷൻ പോലും ഉണ്ട്.\n ➤ ആരാണ് ഇത് ആസ്വദിക്കുക:\n പ്രോജക്റ്റുകളുടെ ഭാഗമായി കോഡ് സോസ് മോഴ്‌സ് പര്യവേക്ഷണം ചെയ്യുന്ന വിദ്യാർത്ഥികൾ\n\n\n വ്യക്തമായ ചിത്രീകരണങ്ങൾ തയ്യാറാക്കുന്ന അധ്യാപകർ\n\n\n വിനോദത്തിനായി റേഡിയോ ഫാനുകൾ സോസ് എൻ കോഡ് മോഴ്‌സ് ഡീകോഡ് ചെയ്യുന്നു\n\n\n സിഗ്നലുകളുടെ താളത്തിൽ നിന്ന് പ്രചോദനം ഉൾക്കൊണ്ട ഡിസൈനർമാർ\n\n\n മോഴ്‌സ് കോഡ് എളുപ്പത്തിൽ വിവർത്തനം ചെയ്യാൻ ആഗ്രഹിക്കുന്ന ആർക്കും\n\n\n സ്വകാര്യത എപ്പോഴും മാനിക്കപ്പെടുന്നു. എക്സ്റ്റൻഷൻ പൂർണ്ണമായും ബ്രൗസറിനുള്ളിൽ പ്രവർത്തിക്കുന്നു, ഒരു വിവരവും അയയ്ക്കില്ല. അക്ഷരമാല പരിശീലനത്തിനോ സർഗ്ഗാത്മക പ്രവർത്തനങ്ങൾക്കോ ​​വേണ്ടിയുള്ള ഈ മോഴ്‌സ് കോഡ് ഉപയോഗിച്ചുള്ള നിങ്ങളുടെ പരീക്ഷണങ്ങൾ നിങ്ങളുടേത് മാത്രമായിരിക്കും.\n 2️⃣ പതിവ് ചോദ്യങ്ങൾ:\n മോഴ്‌സ് കോഡ് ട്രാൻസ്ലേറ്ററിന് ഉടൻ തന്നെ ഇംഗ്ലീഷിലേക്ക് പരിവർത്തനം ചെയ്യാൻ കഴിയുമോ? അതെ, തൽക്ഷണം.\n\n\n അക്ഷരങ്ങളും അക്കങ്ങളും മാറ്റാൻ മോഴ്‌സ് കോഡ് കൺവെർട്ടർ ഉണ്ടോ? അതെ, എല്ലാം ഉൾപ്പെടുത്തിയിട്ടുണ്ട്.\n\n\n ഇത് ഒരു മോഴ്‌സ് കോഡ് മെഷീനിനെ അനുകരിക്കുന്നുണ്ടോ? അതെ, ടാപ്പിംഗ് സവിശേഷതയിലൂടെ.\n\n\n എനിക്ക് ശബ്‌ദം ക്രമീകരിക്കാൻ കഴിയുമോ? അതെ, വേഗത മാറ്റാനും പ്ലേബാക്ക് WAV ആയി എക്‌സ്‌പോർട്ടുചെയ്യാനും കഴിയും.\n\n\n മോഴ്സ് കോഡ് ജനറേറ്റർ ഉൾപ്പെടുത്തിയിട്ടുണ്ടോ? അതെ, നിങ്ങൾക്ക് സ്വന്തമായി സിഗ്നലുകൾ സൃഷ്ടിക്കാനും പരീക്ഷിക്കാനും കഴിയും.\n\n\n എക്സ്റ്റൻഷൻ അസാധാരണമായ പാറ്റേണുകൾ കൈകാര്യം ചെയ്യുമോ? അതെ, അത് അപൂർവമായ സീക്വൻസുകൾ പോലും ഡീകോഡ് ചെയ്യുന്നു.\n\n\n 3️⃣ ഇന്ന് തന്നെ ഇൻസ്റ്റാൾ ചെയ്യാനുള്ള കാരണങ്ങൾ:\n ടെലിഗ്രാഫ് കീ അതിന്റേതായ മോഡിൽ ഉപയോഗിച്ച് പരിശീലിക്കുക\n\n\n അക്ഷരമാലയ്ക്കും പൂർണ്ണ പദങ്ങൾക്കും മോഴ്‌സ് കോഡ് മാറുക\n\n\n ആശയക്കുഴപ്പമില്ലാതെ sos en code morse പോലുള്ള സിഗ്നലുകൾ പര്യവേക്ഷണം ചെയ്യുക.\n\n\n കൂടുതൽ ഭാഷകളിലും സവിശേഷതകളിലുമുള്ള അപ്‌ഡേറ്റുകൾ ആസ്വദിക്കൂ\n\n\n ദൈനംദിന പഠന ഉപകരണമായി ഈ വിവർത്തകനെ ആശ്രയിക്കുക.\n\n\n ആത്യന്തികമായി, മോഴ്സ് കോഡ് ട്രാൻസ്ലേറ്റർ ഒരു വിവർത്തകനേക്കാൾ കൂടുതലാണ്. ആധുനിക ഉപകരണങ്ങൾ ഉപയോഗിക്കുമ്പോൾ തന്നെ ചരിത്രവുമായി ബന്ധപ്പെടാനുള്ള ഒരു മാർഗമാണിത്.\n അലെഹ് രൂപകൽപ്പന ചെയ്തത്: stariyleg@gmail.com\n ഐക്കൺ - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"മോഴ്‌സ് കോഡ് ഐക്കണുകൾ\">ഫ്രീപിക് സൃഷ്ടിച്ച മോഴ്സ് കോഡ് ഐക്കണുകൾ - ഫ്ലാറ്റിക്കോൺ</a>\n"
  }
}