{
  "appName": {
    "message": "Morseov kod prevoditelj"
  },
  "shortDesc": {
    "message": "Ovo je Morseov kod prevoditelj – generator morseovog koda sa zvukom i tekstom. Naučite abecedu morseovog koda i prevedite na svoj jezik."
  },
  "storeDesc": {
    "message": "Ako želite podršku za nove jezike u Morseov kod prevoditelj, jednostavno pišite developeru putem e-pošte. Povratne informacije korisnika usmjeravaju buduće nadogradnje, a vaše ideje mogu oblikovati ono što će se sljedeće pojaviti. Ekstenzija već radi s engleskim, ruskim i međunarodnim signalima, ali su planirani i drugi jezici.\nMorseov kod prevoditelj je dizajniran za ljude koji žele izravan i pouzdan način rada s točkama i crticama online. Alat olakšava prevođenje morseovog koda na engleski i obrnuto. Sve se odvija unutar preglednika, bez poslužitelja između, tako da rezultati pojavljuju odmah i ostaju privatni.\nJedna od najpraktičnijih značajki je da su oba polja sinkronizirana u stvarnom vremenu. Kada upišete običan tekst, polje signala se automatski ažurira. Kada zalijepite ili unesete točke i crte u stranu uzorka, polje teksta odmah odgovara. Ekstenzija uvijek održava oba smjera usklađena.\nTu je i simulacija telegrafskog ključa. Ova posebna tipka omogućuje vam da ručno tapkate ritmove. Način se može aktivirati odvojeno, pretvarajući vašu tipkovnicu ili miš u jednostavan alat za unos. Svaki dodir generira uzorak, a prijevod se odmah pojavljuje u prozoru s tekstom. Osjeća se gotovo kao korištenje povijesne mašine prilagođene za preglednik.\nZašto ljudi instaliraju ovaj prevoditelj:\nOnline konverzija bez dodatnog softvera\n\nAutomatska sinkronizacija između oba polja\n\nJasna referenca na morseov abecedni alfabet unutar aplikacije\n\nNačin telegrafskog ključa za tapkanje signala\n\nNadogradnje koje proširuju jezike i značajke\n\nSvake fraze su zabavnije kada se gledaju kroz signale. Možete koristiti konverter morseovog koda da vidite kako izgleda \"hello\", a čak i kratki pozdravi mogu poprimiti razigrani ton. Neki ljudi eksperimentiraju s \"i love you\" u morseovom kodu za kreativne poruke, dok drugi provjeravaju \"sos\" u morseovom kodu ili \"sos en code morse\" za vježbu u hitnim situacijama. Sustav ima dugu tradiciju u radijskom svijetu, gdje operateri često koriste kratke kodove i skraćenice:\n73 (--... ...--): znači \"najbolje želje\" i koristi se za pristojno završavanje kontakta.\n\n88 (---.. ---..): označava \"poljupce\", često dijeljene među prijateljima ili kolegama.\n\nCQ (-.-. --.-): opći poziv svim operaterima, preveden kao \"poziv za vas.\"\n\nGM (--. --): \"dobro jutro,\" GA (--. .-): \"dobar dan,\" GE (--. .): \"dobro večer,\" GN (--. -.): \"laku noć.\"\n\nR (.-.): signal potvrde koji znači \"primljeno\" ili \"razumijem.\"\n\nPSE (.--. ... .): skraćeno od \"molim,\" koristi se u pristojnim zahtjevima.\n\nČak i neobične sekvence poput ..---...._, _ _.., ili _. _. se dekodiraju bez odgađanja, čineći svaki red točaka i crtica dijelom živog jezika.\n▸ Uobičajeni slučajevi korištenja uključuju:\nUčitelje koji objašnjavaju što je morseov kod tijekom nastave\n\nStudente koji vježbaju projekte od engleskog do morseovog koda\n\nHobiiste koji rade s brojevima u morseovom kodu u slobodno vrijeme\n\nPovjesničare koji prikazuju sos kod u morseu kao dio kulture\n\nKreatore koji koriste alate za izradu morseovog koda za dizajn\n\nEkstenzija također radi kao dekoder morseovog koda. Zalijepite bilo koju sekvencu, a prijevod na običan tekst pojavljuje se odmah. Bilo da testirate _. _ ili duže sekvence poput //, alat jasno pokazuje značenje. Nema nagađanja, nema odgađanja, samo glatka interakcija. Za mnoge učenike ovo postaje najjednostavniji način za vježbanje i pretvaranje morseovog koda u engleski u stvarnom vremenu.\n1️⃣ Prednosti na prvi pogled:\nLako uvođenje u morseov alfabet\n\nDekodiranje \"no\" u morseovom kodu i drugih fraza\n\nPrilika za proučavanje slova morseovog koda u riječima\n\nKreativne kombinacije poput // za eksperimente\n\nZvuk dodaje još jednu dimenziju. Prevoditelj može reproducirati uzorke koje kreirate. Također vam omogućuje promjenu brzine reprodukcije, tako da kratke točke i duže crte odgovaraju vašem ritmu. Možete usporiti za vježbu ili ubrzati za realizam. Postoji čak i opcija za izvoz signala i njihovo spremanje u WAV datoteku za kasnije slušanje.\n➤ Tko će uživati u tome:\nStudenti koji istražuju kod sos morse kao dio projekata\n\nUčitelji koji pripremaju jasne ilustracije\n\nObožavatelji radija koji dekodiraju sos en code morse iz zabave\n\nDizajneri inspirirani ritmom signala\n\nSvi koji žele prevoditi morseov kod bez napora\n\nPrivatnost se uvijek poštuje. Ekstenzija radi potpuno unutar preglednika, bez slanja informacija van. Vaši eksperimenti s ovim morseovim kodom za obuku abecede ili kreativni rad ostaju samo vaši.\n2️⃣ Česta pitanja:\nMože li Morseov kod prevoditelj odmah pretvoriti na engleski? Da, odmah.\n\nPostoji li konverter morseovog koda za slova i brojeve? Da, sve je pokriveno.\n\nSimulira li morseovu kod mašinu? Da, kroz značajku tapkanja.\n\nMogu li prilagoditi zvuk? Da, brzina se može promijeniti, a reprodukcija se može izvesti kao WAV.\n\nPostoji li generator morseovog koda uključen? Da, možete kreirati i testirati svoje vlastite signale.\n\nRukuje li ekstenzija neobičnim uzorcima? Da, dekodira čak i rijetke sekvence.\n\n3️⃣ Razlozi za instalaciju danas:\nVježbajte s telegrafskim ključem u vlastitom načinu\n\nPrebacujte se između morseovog koda za abecedu i cijele riječi\n\nIstražujte signale poput sos en code morse bez zabune\n\nUživajte u nadogradnjama s više jezika i značajki\n\nOslonite se na ovog prevoditelja kao alat za svakodnevno učenje\n\nNa kraju, Morseov kod prevoditelj je više od prevoditelja. To je način povezivanja s poviješću dok koristite moderne alate.\nDizajn od Aleh: stariyleg@gmail.com\nIkona - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"morse code icons\">Ikone morseovog koda kreirao Freepik - Flaticon</a>"
  }
}