{
  "appName": {
    "message": "Morse koda tulkotājs"
  },
  "shortDesc": {
    "message": "Šis ir Morse koda tulkotājs – morse koda ģenerators ar skaņu un tekstu. Iemācieties morse koda alfabētu un tulkojiet uz savu valodu."
  },
  "storeDesc": {
    "message": "Ja vēlaties atbalstu jauniem valodu tulkojumiem Morse koda tulkotājā, vienkārši uzrakstiet izstrādātājam pa e-pastu. Lietotāju atsauksmes vada nākotnes atjauninājumus, un jūsu idejas var ietekmēt to, kas parādīsies nākotnē. Paplašinājums jau darbojas ar angļu, krievu un starptautiskajiem signāliem, bet plānotas ir vēl citas valodas.\nMorse koda tulkotājs ir izstrādāts cilvēkiem, kuri vēlas tiešu un uzticamu veidu, kā strādāt ar punktiem un svītrām tiešsaistē. Rīks padara vienkāršu morse koda tulkošanu uz angļu valodu un atpakaļ. Viss darbojas pārlūkprogrammā, bez serveriem starpā, tāpēc rezultāti parādās nekavējoties un paliek privāti.\nViena no praktiskākajām funkcijām ir tā, ka abi lauki tiek sinhronizēti reāllaikā. Kad jūs rakstāt parasto tekstu, signāla lauks automātiski atjaunojas. Kad jūs ielīmējat vai ievadāt punktus un svītras modeļa pusē, teksta lauks reaģē nekavējoties. Paplašinājums vienmēr uztur abas virzienus saskaņotus.\nIr arī telegrafa taustiņa simulācija. Šis īpašais taustiņš ļauj jums ar roku piesist ritmus. Režīmu var aktivizēt atsevišķi, pārvēršot jūsu tastatūru vai peli par vienkāršu ievades rīku. Katrs piesitiens ģenerē modeli, un tulkojums parādās teksta logā uzreiz. Tas jūtas gandrīz kā vēsturiskas mašīnas izmantošana, kas pielāgota pārlūkprogrammai.\nKāpēc cilvēki instalē šo tulkotāju:\nTiešsaistes konversija bez papildu programmatūras\n\nAutomātiska sinhronizācija starp abiem laukiem\n\nSkaidrs morse koda alfabēta atsauce lietotnē\n\nTelegrafa taustiņa režīms signālu piesitšanai\n\nAtjauninājumi, kas paplašina valodas un funkcijas\n\nIkdienas frāzes ir jautrākas, kad tās tiek skatītas caur signāliem. Jūs varat izmantot morse koda konvertoru, lai redzētu, kā izskatās “sveiki”, un pat īsas sveicieni var iegūt rotaļīgu toni. Daži cilvēki eksperimentē ar “es tevi mīlu” morse kodā radošiem ziņojumiem, kamēr citi pārbauda “sos” morse kodā vai “sos en code morse” ārkārtas praksei. Šī sistēma ir ar ilgu tradīciju radio pasaulē, kur operatori bieži izmanto īsus kodus un saīsinājumus:\n73 (--... ...--): nozīmē “labākie vēlējumi” un tiek izmantots, lai pieklājīgi pabeigtu kontaktu.\n\n88 (---.. ---..): apzīmē “skūpstus”, bieži dalās starp draugiem vai kolēģiem.\n\nCQ (-.-. --.-): vispārējs aicinājums visiem operatoriem, tulkots kā “zvans jums”.\n\nGM (--. --): “labrīt,” GA (--. .-): “labdien,” GE (--. .): “labvakar,” GN (--. -.): “labanakti.”\n\nR (.-.): apstiprinājuma signāls, kas nozīmē “saņemts” vai “saprasts.”\n\nPSE (.--. ... .): īss “lūdzu”, kas tiek izmantots pieklājīgos pieprasījumos.\n\nPat neparastas secības, piemēram, ..---...._, _ _.., vai _. _. tiek atšifrētas bez kavēšanās, padarot katru punktu un svītru par dzīvas valodas daļu.\n▸ Biežākie lietošanas gadījumi ietver:\nSkolotāji, kuri skaidro, kas ir morse kods stundas laikā\n\nStudenti, kas praktizē angļu valodu uz morse koda projektiem\n\nHobiji, kas strādā ar morse koda numuriem brīvajā laikā\n\nVēsturnieki, kas rāda “sos” kodu morse kā kultūras daļu\n\nRadītāji, kas izmanto morse koda rīkus dizainam\n\nPaplašinājums arī darbojas kā morse koda dekodētājs. Ielīmējiet jebkuru secību, un tulkojums uz parasto tekstu parādās uzreiz. Neatkarīgi no tā, vai jūs testējat _. _ vai garākas secības, piemēram, //, rīks skaidri parāda nozīmi. Nav minēšanas, nav kavēšanās, tikai vienmērīga mijiedarbība. Daudziem mācībniekiem tas kļūst par vienkāršāko veidu, kā apmācīt un konvertēt morse uz angļu valodu reāllaikā.\n1️⃣ Priekšrocības vienā skatījumā:\nViegla ievada morse alfabētā\n\nDekodēšana “nē” morse kodā un citās frāzēs\n\nIespēja studēt morse koda burtus vārdos\n\nRadošas kombinācijas, piemēram, // eksperimentiem\n\nSkaņa pievieno vēl vienu dimensiju. Tulkotājs var atskaņot modeļus, ko jūs izveidojat. Tas arī ļauj mainīt atskaņošanas ātrumu, lai īsie punkti un garās svītras atbilstu jūsu tempam. Jūs varat to palēnināt praksei vai paātrināt reālisma dēļ. Ir pat iespēja eksportēt signālus un saglabāt tos WAV failā turpmākai klausīšanai.\n➤ Kam tas patiks:\nStudenti, kas pēta “sos” morse kodu kā daļu no projektiem\n\nSkolotāji, kas sagatavo skaidras ilustrācijas\n\nRadio fani, kas dekodē “sos en code morse” izklaidei\n\nDizaineri, kurus iedvesmo signālu ritms\n\nIkviens, kurš vēlas tulkot morse kodu bez piepūles\n\nPrivātums vienmēr tiek ievērots. Paplašinājums darbojas pilnībā pārlūkprogrammā, bez informācijas nosūtīšanas prom. Jūsu eksperimenti ar šo morse kodu alfabēta apmācībai vai radošam darbam paliek tikai jūsu.\n2️⃣ Biežāk uzdotie jautājumi:\nVai Morse koda tulkotājs var tūlīt pārvērst uz angļu valodu? Jā, nekavējoties.\n\nVai ir morse koda konvertētājs burtiem un cipariem? Jā, viss ir iekļauts.\n\nVai tas simulē morse koda mašīnu? Jā, caur piesitiena funkciju.\n\nVai es varu pielāgot skaņu? Jā, ātrumu var mainīt, un atskaņošanu var eksportēt kā WAV.\n\nVai ir iekļauts morse koda ģenerators? Jā, jūs varat izveidot un testēt savus signālus.\n\nVai paplašinājums apstrādā neparastas secības? Jā, tas dekodē pat retas secības.\n\n3️⃣ Iemesli, lai instalētu šodien:\nPraktizējiet ar telegrafa taustiņu tā atsevišķajā režīmā\n\nPārejiet starp morse kodu alfabētam un pilniem vārdiem\n\nIzpētiet signālus, piemēram, “sos en code morse”, bez neskaidrībām\n\nIzbaudiet atjauninājumus ar vairāk valodām un funkcijām\n\nPaļaujieties uz šo tulkotāju kā ikdienas mācību rīku\n\nGalu galā, Morse koda tulkotājs ir vairāk nekā tikai tulkotājs. Tas ir veids, kā sazināties ar vēsturi, izmantojot mūsdienu rīkus.\nDizains: Aleh: stariyleg@gmail.com\nIkona - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"morse code icons\">Morse koda ikonas izveidojis Freepik - Flaticon</a>"
  }
}