{
  "appName": {
    "message": "मॉर्स कोड अनुवादक"
  },
  "shortDesc": {
    "message": "हे मॉर्स कोड अनुवादक आहे - ध्वनी आणि मजकूरासह मॉर्स कोड जनरेटर. मॉर्स कोड वर्णमाला शिका आणि आपल्या भाषेत अनुवाद करा."
  },
  "storeDesc": {
    "message": "जर तुम्हाला मॉर्स कोड अनुवादक मध्ये नवीन भाषांसाठी समर्थन हवे असेल, तर फक्त विकासकाला ई-मेलद्वारे लिहा. वापरकर्त्यांकडून मिळालेला अभिप्राय भविष्यातील अद्यतनांना मार्गदर्शन करतो, आणि तुमच्या कल्पना पुढील गोष्टींवर प्रभाव टाकू शकतात. हे विस्तार इंग्रजी, रशियन आणि आंतरराष्ट्रीय सिग्नलसह कार्य करते, परंतु आणखी भाषांचा समावेश करण्याची योजना आहे.\nमॉर्स कोड अनुवादक त्या लोकांसाठी डिझाइन केले आहे जे ऑनलाइन डॉट्स आणि डॅशेससह कार्य करण्याचा थेट आणि विश्वसनीय मार्ग शोधत आहेत. हे साधन मॉर्स कोडचे इंग्रजीत अनुवाद करणे आणि पुन्हा परत आणणे सोपे करते. सर्व काही ब्राउझरच्या आत चालते, मध्यभागी कोणतेही सर्व्हर नसतात, त्यामुळे परिणाम त्वरित दिसतात आणि खाजगी राहतात.\nएक अत्यंत व्यावहारिक वैशिष्ट्य म्हणजे दोन्ही क्षेत्रे वास्तविक वेळेत समक्रमित असतात. जेव्हा तुम्ही साधा मजकूर टाइप करता, तेव्हा सिग्नल क्षेत्र आपोआप अद्यतनित होते. जेव्हा तुम्ही पॅटर्न बाजूला डॉट्स आणि डॅशेस पेस्ट किंवा एंटर करता, तेव्हा मजकूर क्षेत्र त्वरित प्रतिसाद देते. हे विस्तार नेहमी दोन्ही दिशांना समांतर ठेवते.\nतसेच एक टेलिग्राफ की सिम्युलेशन आहे. हा विशेष बटण तुम्हाला हाताने ताल वाजवण्याची परवानगी देतो. हा मोड स्वतंत्रपणे सक्रिय केला जाऊ शकतो, तुमच्या कीबोर्ड किंवा माऊसला एक साधे इनपुट साधन बनवतो. प्रत्येक टॅप एक पॅटर्न तयार करतो, आणि अनुवाद त्वरित मजकूर विंडोमध्ये दिसतो. हे ब्राउझरमध्ये अनुकूलित ऐतिहासिक मशीन वापरण्यासारखे वाटते.\nलोक हे अनुवादक का स्थापित करतात:\nअतिरिक्त सॉफ्टवेअरशिवाय ऑनलाइन रूपांतरण\n\n\nदोन्ही क्षेत्रांमधील स्वयंचलित समक्रमण\n\n\nअॅपमध्ये स्पष्ट मॉर्स कोड अल्फाबेट संदर्भ\n\n\nसिग्नल टॅप करण्यासाठी टेलिग्राफ की मोड\n\n\nभाषा आणि वैशिष्ट्ये वाढवणारे अद्यतन\n\n\nदैनिक वाक्ये सिग्नलद्वारे पाहिल्यावर अधिक मजेदार असतात. तुम्ही \"नमस्कार\" कसे दिसते ते पाहण्यासाठी मॉर्स कोड रूपांतरक वापरू शकता, आणि अगदी लहान अभिवादनांना एक खेळकर स्वरूप मिळवता येतो. काही लोक रचनात्मक संदेशांसाठी मॉर्स कोडमध्ये \"मी तुझ्यावर प्रेम करतो\" याचा प्रयोग करतात, तर इतर लोक आपत्कालीन सरावासाठी मॉर्स कोडमध्ये \"सॉस\" किंवा \"सॉस एन कोड मॉर्स\" तपासतात. या प्रणालीचा रेडिओ जगात एक दीर्घ परंपरा आहे, जिथे ऑपरेटर सामान्यतः लहान कोड आणि संक्षेपणांचा वापर करतात:\n73 (--... ...--): \"सर्वोत्तम शुभेच्छा\" याचा अर्थ आहे आणि संपर्क समाप्त करण्यासाठी वापरला जातो.\n\n\n88 (---.. ---..): \"चुंबन\" यासाठी उभा आहे, जो सहसा मित्र किंवा सहकाऱ्यांमध्ये सामायिक केला जातो.\n\n\nCQ (-.-. --.-): सर्व ऑपरेटरांना एक सामान्य कॉल, \"तुमच्याकडे कॉल\" म्हणून अनुवादित.\n\n\nGM (--. --): \"शुभ प्रभात,\" GA (--. .-): \"शुभ दुपार,\" GE (--. .): \"शुभ संध्या,\" GN (--. -.): \"शुभ रात्र.\"\n\n\nR (.-.): \"प्राप्त\" किंवा \"समजले\" याचा अर्थ असलेला एक पुष्टीकरण सिग्नल.\n\n\nPSE (.--. ... .): \"कृपया\" यासाठी लघुरूप, विनम्र विनंत्यांमध्ये वापरला जातो.\n\n\nअसामान्य अनुक्रम जसे की ..---...._, _ _.., किंवा _. _. विलंबाशिवाय डिकोड केले जातात, प्रत्येक डॉट आणि डॅशची रेखा एक जिवंत भाषेचा भाग बनवते.\n▸ सामान्य वापर प्रकरणे समाविष्ट:\nशिक्षक जे वर्गात मॉर्स कोड काय आहे ते स्पष्ट करतात\n\n\nविद्यार्थी इंग्रजी ते मॉर्स कोड प्रकल्पांचा सराव करतात\n\n\nहॉबीस्ट जे त्यांच्या मोकळ्या वेळेत मॉर्स कोड नंबरसह कार्य करतात\n\n\nइतिहासकार जे संस्कृतीचा भाग म्हणून मॉर्समध्ये सॉस कोड दर्शवतात\n\n\nनिर्माते जे डिझाइनसाठी मॉर्स कोड निर्मात्याचे साधने वापरतात\n\n\nहे विस्तार मॉर्स कोड डिकोडर म्हणूनही कार्य करते. कोणतीही अनुक्रम पेस्ट करा, आणि साध्या मजकूरात अनुवाद त्वरित दिसतो. तुम्ही _. _ किंवा // सारख्या लांब अनुक्रमांची चाचणी करत असाल तरी, साधन स्पष्टपणे अर्थ दर्शवते. अंदाज नाही, विलंब नाही, फक्त गुळगुळीत संवाद. अनेक शिकणाऱ्यांसाठी हे मॉर्सला इंग्रजीत वास्तविक वेळेत रूपांतरित करण्याचा सर्वात सोपा मार्ग बनतो.\n1️⃣ फायदे एक नजरेत:\nमॉर्स अल्फाबेटमध्ये सोपी ओळख\n\n\nमॉर्स कोडमध्ये \"नाही\" आणि इतर वाक्यांचे डिकोडिंग\n\n\nशब्दांमध्ये मॉर्स कोड अक्षरे अभ्यासण्याची संधी\n\n\nप्रयोगांसाठी रचनात्मक संयोजन जसे की //\n\n\nध्वनी आणखी एक आयाम जोडतो. अनुवादक तुम्ही तयार केलेले पॅटर्न प्ले बॅक करू शकतो. हे प्लेबॅक गती बदलण्याची परवानगी देते, त्यामुळे लहान डॉट्स आणि लांब डॅशेस तुमच्या गतीसह जुळतात. तुम्ही सरावासाठी ते मंद करू शकता किंवा वास्तवतेसाठी ते गती वाढवू शकता. सिग्नल्स निर्यात करण्याचा आणि नंतर ऐकण्यासाठी WAV फाईलमध्ये जतन करण्याचा एक पर्याय देखील आहे.\n➤ कोणाला हे आवडेल:\nप्रकल्पांचा भाग म्हणून कोड सॉस मॉर्सचा अभ्यास करणारे विद्यार्थी\n\n\nस्पष्ट चित्रे तयार करणारे शिक्षक\n\n\nमजेसाठी सॉस एन कोड मॉर्स डिकोड करणारे रेडिओ चाहते\n\n\nसिग्नलच्या तालाने प्रेरित डिझाइनर्स\n\n\nकोणतीही व्यक्ती जी मेहनत न करता मॉर्स कोडचा अनुवाद करू इच्छिते\n\n\nखाजगीपणा नेहमीच आदरला जातो. हे विस्तार पूर्णपणे ब्राउझरच्या आत चालते, कोणतीही माहिती बाहेर पाठवली जात नाही. तुमचे मॉर्स कोडचे प्रयोग अल्फाबेट प्रशिक्षण किंवा रचनात्मक कामासाठी तुमच्याच राहतात.\n2️⃣ वारंवार विचारले जाणारे प्रश्न:\nमॉर्स कोड अनुवादक इंग्रजीत त्वरित रूपांतरित करू शकतो का? होय, त्वरित.\n\n\nअक्षरे आणि संख्यांसाठी मॉर्स कोड रूपांतरक आहे का? होय, सर्व काही समाविष्ट आहे.\n\n\nहे मॉर्स कोड मशीनची सिम्युलेशन करते का? होय, टॅपिंग वैशिष्ट्याद्वारे.\n\n\nमी ध्वनी समायोजित करू शकतो का? होय, गती बदलली जाऊ शकते, आणि प्लेबॅक WAV म्हणून निर्यात केला जाऊ शकतो.\n\n\nयामध्ये मॉर्स कोड जनरेटर समाविष्ट आहे का? होय, तुम्ही तुमचे स्वतःचे सिग्नल तयार आणि चाचणी करू शकता.\n\n\nहे विस्तार असामान्य पॅटर्न हाताळते का? होय, हे अगदी दुर्मिळ अनुक्रमांचे डिकोडिंग करते.\n\n\n3️⃣ आज स्थापित करण्याचे कारण:\nत्याच्या स्वतःच्या मोडमध्ये टेलिग्राफ कीसह सराव करा\n\n\nअल्फाबेट आणि संपूर्ण शब्दांसाठी मॉर्स कोडमध्ये स्विच करा\n\n\nसिग्नल्स जसे की सॉस एन कोड मॉर्स यांचा अभ्यास करा कोणतीही गोंधळ न करता\n\n\nअधिक भाषां आणि वैशिष्ट्यांसह अद्यतने आनंद घ्या\n\n\nदैनिक शिकण्याच्या साधन म्हणून या अनुवादकावर अवलंबून रहा\n\n\nशेवटी, मॉर्स कोड अनुवादक एक अनुवादकापेक्षा अधिक आहे. हे आधुनिक साधने वापरताना इतिहासाशी कनेक्ट होण्याचा एक मार्ग आहे.\nडिझाइन अलेह: stariyleg@gmail.com\nआयकॉन - <a href=\"https://www.flaticon.com/free-icons/morse-code\" title=\"morse code icons\">मॉर्स कोड आयकॉन फ्रीपिक - फ्लेटिकॉन द्वारे तयार केलेले</a>"
  }
}